/* 내용정리 · 과목 4 데이터 모델링
   tools/notes-build.js 가 tools/notes-src/ch4.md 에서 만든다. 손으로 고치지 말 것. */
DAP_NOTES.add({
 "ch": 4,
 "title": "데이터 모델링",
 "sourceFiles": [
  "IV. 데이터 모델링.hwpx",
  "IV. 데이터 모델링.pdf"
 ],
 "images": {
  "IV-01": {
   "src": "img/IV-01.jpg",
   "w": 1000,
   "h": 819
  },
  "IV-02": {
   "src": "img/IV-02.jpg",
   "w": 1000,
   "h": 662
  },
  "IV-03": {
   "src": "img/IV-03.jpg",
   "w": 1000,
   "h": 656
  },
  "IV-04": {
   "src": "img/IV-04.jpg",
   "w": 1000,
   "h": 327
  },
  "IV-05": {
   "src": "img/IV-05.jpg",
   "w": 1000,
   "h": 677
  },
  "IV-06": {
   "src": "img/IV-06.jpg",
   "w": 1000,
   "h": 606
  },
  "IV-07": {
   "src": "img/IV-07.jpg",
   "w": 1000,
   "h": 662
  },
  "IV-08": {
   "src": "img/IV-08.jpg",
   "w": 1000,
   "h": 580
  },
  "IV-09": {
   "src": "img/IV-09.jpg",
   "w": 1000,
   "h": 624
  },
  "IV-10": {
   "src": "img/IV-10.jpg",
   "w": 1000,
   "h": 678
  },
  "IV-11": {
   "src": "img/IV-11.jpg",
   "w": 1000,
   "h": 556
  },
  "IV-12": {
   "src": "img/IV-12.jpg",
   "w": 1000,
   "h": 582
  },
  "IV-13": {
   "src": "img/IV-13.jpg",
   "w": 1000,
   "h": 294
  },
  "IV-14": {
   "src": "img/IV-14.jpg",
   "w": 48,
   "h": 38
  },
  "IV-15": {
   "src": "img/IV-15.jpg",
   "w": 1000,
   "h": 629
  },
  "IV-16": {
   "src": "img/IV-16.jpg",
   "w": 1000,
   "h": 583
  },
  "IV-17": {
   "src": "img/IV-17.jpg",
   "w": 1000,
   "h": 582
  },
  "IV-18": {
   "src": "img/IV-18.jpg",
   "w": 1000,
   "h": 604
  },
  "IV-19": {
   "src": "img/IV-19.jpg",
   "w": 1000,
   "h": 477
  },
  "IV-20": {
   "src": "img/IV-20.png",
   "w": 1000,
   "h": 475
  },
  "IV-21": {
   "src": "img/IV-21.jpg",
   "w": 1000,
   "h": 542
  },
  "IV-22": {
   "src": "img/IV-22.jpg",
   "w": 1000,
   "h": 662
  },
  "IV-23": {
   "src": "img/IV-23.jpg",
   "w": 1000,
   "h": 402
  },
  "IV-24": {
   "src": "img/IV-24.png",
   "w": 1000,
   "h": 377
  },
  "IV-25": {
   "src": "img/IV-25.jpg",
   "w": 1000,
   "h": 574
  },
  "IV-26": {
   "src": "img/IV-26.jpg",
   "w": 1000,
   "h": 618
  },
  "IV-27": {
   "src": "img/IV-27.jpg",
   "w": 1000,
   "h": 190
  },
  "IV-28": {
   "src": "img/IV-28.jpg",
   "w": 1000,
   "h": 589
  },
  "IV-29": {
   "src": "img/IV-29.jpg",
   "w": 1000,
   "h": 786
  },
  "IV-30": {
   "src": "img/IV-30.jpg",
   "w": 1000,
   "h": 515
  },
  "IV-31": {
   "src": "img/IV-31.jpg",
   "w": 1000,
   "h": 635
  },
  "IV-32": {
   "src": "img/IV-32.jpg",
   "w": 1000,
   "h": 666
  },
  "IV-33": {
   "src": "img/IV-33.jpg",
   "w": 1000,
   "h": 704
  },
  "IV-34": {
   "src": "img/IV-34.jpg",
   "w": 1000,
   "h": 561
  },
  "IV-35": {
   "src": "img/IV-35.jpg",
   "w": 1000,
   "h": 669
  },
  "IV-36": {
   "src": "img/IV-36.jpg",
   "w": 1000,
   "h": 645
  },
  "IV-37": {
   "src": "img/IV-37.jpg",
   "w": 1000,
   "h": 732
  },
  "IV-38": {
   "src": "img/IV-38.jpg",
   "w": 1000,
   "h": 623
  },
  "IV-39": {
   "src": "img/IV-39.jpg",
   "w": 1000,
   "h": 416
  },
  "IV-40": {
   "src": "img/IV-40.jpg",
   "w": 1000,
   "h": 413
  },
  "IV-41": {
   "src": "img/IV-41.jpg",
   "w": 1000,
   "h": 1175
  },
  "IV-42": {
   "src": "img/IV-42.jpg",
   "w": 1000,
   "h": 1357
  },
  "IV-43": {
   "src": "img/IV-43.jpg",
   "w": 1000,
   "h": 1196
  },
  "IV-44": {
   "src": "img/IV-44.jpg",
   "w": 1000,
   "h": 671
  },
  "IV-45": {
   "src": "img/IV-45.jpg",
   "w": 1000,
   "h": 788
  },
  "IV-46": {
   "src": "img/IV-46.jpg",
   "w": 1000,
   "h": 313
  },
  "IV-47": {
   "src": "img/IV-47.jpg",
   "w": 1000,
   "h": 570
  },
  "IV-48": {
   "src": "img/IV-48.jpg",
   "w": 1000,
   "h": 521
  },
  "IV-49": {
   "src": "img/IV-49.jpg",
   "w": 1000,
   "h": 541
  },
  "IV-50": {
   "src": "img/IV-50.jpg",
   "w": 1000,
   "h": 551
  },
  "IV-51": {
   "src": "img/IV-51.jpg",
   "w": 1000,
   "h": 474
  },
  "IV-52": {
   "src": "img/IV-52.jpg",
   "w": 1000,
   "h": 365
  },
  "IV-53": {
   "src": "img/IV-53.jpg",
   "w": 1000,
   "h": 702
  },
  "IV-54": {
   "src": "img/IV-54.jpg",
   "w": 1000,
   "h": 819
  },
  "IV-55": {
   "src": "img/IV-55.jpg",
   "w": 1000,
   "h": 691
  },
  "IV-56": {
   "src": "img/IV-56.jpg",
   "w": 576,
   "h": 192
  },
  "IV-57": {
   "src": "img/IV-57.jpg",
   "w": 576,
   "h": 190
  },
  "IV-58": {
   "src": "img/IV-58.jpg",
   "w": 576,
   "h": 192
  },
  "IV-59": {
   "src": "img/IV-59.jpg",
   "w": 576,
   "h": 192
  },
  "IV-60": {
   "src": "img/IV-60.jpg",
   "w": 1000,
   "h": 616
  },
  "IV-61": {
   "src": "img/IV-61.jpg",
   "w": 1000,
   "h": 652
  },
  "IV-62": {
   "src": "img/IV-62.jpg",
   "w": 1000,
   "h": 878
  },
  "IV-63": {
   "src": "img/IV-63.jpg",
   "w": 1000,
   "h": 1174
  },
  "IV-64": {
   "src": "img/IV-64.jpg",
   "w": 1000,
   "h": 745
  },
  "IV-65": {
   "src": "img/IV-65.jpg",
   "w": 1000,
   "h": 590
  },
  "IV-66": {
   "src": "img/IV-66.jpg",
   "w": 1000,
   "h": 743
  },
  "IV-67": {
   "src": "img/IV-67.jpg",
   "w": 1000,
   "h": 667
  },
  "IV-68": {
   "src": "img/IV-68.jpg",
   "w": 1000,
   "h": 498
  },
  "IV-69": {
   "src": "img/IV-69.jpg",
   "w": 1000,
   "h": 530
  },
  "IV-70": {
   "src": "img/IV-70.jpg",
   "w": 1000,
   "h": 690
  },
  "IV-71": {
   "src": "img/IV-71.jpg",
   "w": 1000,
   "h": 659
  },
  "IV-72": {
   "src": "img/IV-72.jpg",
   "w": 1000,
   "h": 631
  },
  "IV-73": {
   "src": "img/IV-73.jpg",
   "w": 1000,
   "h": 658
  },
  "IV-74": {
   "src": "img/IV-74.jpg",
   "w": 1000,
   "h": 297
  },
  "IV-75": {
   "src": "img/IV-75.jpg",
   "w": 954,
   "h": 432
  },
  "IV-76": {
   "src": "img/IV-76.jpg",
   "w": 1000,
   "h": 287
  },
  "IV-77": {
   "src": "img/IV-77.jpg",
   "w": 1000,
   "h": 324
  },
  "IV-78": {
   "src": "img/IV-78.jpg",
   "w": 1000,
   "h": 719
  },
  "IV-79": {
   "src": "img/IV-79.jpg",
   "w": 1000,
   "h": 742
  },
  "IV-80": {
   "src": "img/IV-80.jpg",
   "w": 898,
   "h": 386
  },
  "IV-81": {
   "src": "img/IV-81.jpg",
   "w": 1000,
   "h": 309
  },
  "IV-82": {
   "src": "img/IV-82.jpg",
   "w": 1000,
   "h": 295
  },
  "IV-83": {
   "src": "img/IV-83.jpg",
   "w": 1000,
   "h": 251
  },
  "IV-84": {
   "src": "img/IV-84.jpg",
   "w": 944,
   "h": 630
  },
  "IV-85": {
   "src": "img/IV-85.jpg",
   "w": 738,
   "h": 476
  },
  "IV-86": {
   "src": "img/IV-86.jpg",
   "w": 1000,
   "h": 595
  },
  "IV-87": {
   "src": "img/IV-87.jpg",
   "w": 890,
   "h": 340
  },
  "IV-88": {
   "src": "img/IV-88.jpg",
   "w": 952,
   "h": 1196
  },
  "IV-89": {
   "src": "img/IV-89.jpg",
   "w": 1000,
   "h": 297
  },
  "IV-90": {
   "src": "img/IV-90.jpg",
   "w": 1000,
   "h": 452
  },
  "IV-91": {
   "src": "img/IV-91.jpg",
   "w": 1000,
   "h": 312
  },
  "IV-92": {
   "src": "img/IV-92.jpg",
   "w": 680,
   "h": 490
  },
  "IV-93": {
   "src": "img/IV-93.jpg",
   "w": 880,
   "h": 490
  },
  "IV-94": {
   "src": "img/IV-94.jpg",
   "w": 1000,
   "h": 283
  },
  "IV-95": {
   "src": "img/IV-95.jpg",
   "w": 1000,
   "h": 853
  },
  "IV-96": {
   "src": "img/IV-96.jpg",
   "w": 1000,
   "h": 1197
  },
  "IV-97": {
   "src": "img/IV-97.jpg",
   "w": 934,
   "h": 1098
  },
  "IV-98": {
   "src": "img/IV-98.jpg",
   "w": 1000,
   "h": 994
  },
  "IV-99": {
   "src": "img/IV-99.jpg",
   "w": 1000,
   "h": 1067
  },
  "IV-100": {
   "src": "img/IV-100.jpg",
   "w": 1000,
   "h": 766
  },
  "IV-101": {
   "src": "img/IV-101.jpg",
   "w": 1000,
   "h": 600
  },
  "IV-102": {
   "src": "img/IV-102.jpg",
   "w": 966,
   "h": 480
  },
  "IV-103": {
   "src": "img/IV-103.jpg",
   "w": 1000,
   "h": 530
  },
  "IV-104": {
   "src": "img/IV-104.jpg",
   "w": 1000,
   "h": 600
  },
  "IV-105": {
   "src": "img/IV-105.jpg",
   "w": 1000,
   "h": 836
  },
  "IV-106": {
   "src": "img/IV-106.jpg",
   "w": 1000,
   "h": 189
  },
  "IV-107": {
   "src": "img/IV-107.jpg",
   "w": 1000,
   "h": 825
  },
  "IV-108": {
   "src": "img/IV-108.jpg",
   "w": 1000,
   "h": 820
  },
  "IV-109": {
   "src": "img/IV-109.jpg",
   "w": 1000,
   "h": 840
  },
  "IV-110": {
   "src": "img/IV-110.jpg",
   "w": 872,
   "h": 326
  },
  "IV-111": {
   "src": "img/IV-111.jpg",
   "w": 1000,
   "h": 494
  },
  "IV-112": {
   "src": "img/IV-112.jpg",
   "w": 834,
   "h": 494
  },
  "IV-113": {
   "src": "img/IV-113.jpg",
   "w": 1000,
   "h": 642
  },
  "IV-114": {
   "src": "img/IV-114.jpg",
   "w": 1000,
   "h": 506
  },
  "IV-115": {
   "src": "img/IV-115.jpg",
   "w": 980,
   "h": 648
  },
  "IV-116": {
   "src": "img/IV-116.jpg",
   "w": 996,
   "h": 378
  },
  "IV-117": {
   "src": "img/IV-117.jpg",
   "w": 1000,
   "h": 247
  },
  "IV-118": {
   "src": "img/IV-118.jpg",
   "w": 826,
   "h": 654
  },
  "IV-119": {
   "src": "img/IV-119.jpg",
   "w": 1000,
   "h": 684
  },
  "IV-120": {
   "src": "img/IV-120.jpg",
   "w": 1000,
   "h": 863
  },
  "IV-121": {
   "src": "img/IV-121.jpg",
   "w": 1000,
   "h": 776
  },
  "IV-122": {
   "src": "img/IV-122.jpg",
   "w": 866,
   "h": 686
  },
  "IV-123": {
   "src": "img/IV-123.jpg",
   "w": 970,
   "h": 686
  },
  "IV-124": {
   "src": "img/IV-124.jpg",
   "w": 876,
   "h": 676
  },
  "IV-125": {
   "src": "img/IV-125.jpg",
   "w": 872,
   "h": 660
  },
  "IV-126": {
   "src": "img/IV-126.jpg",
   "w": 962,
   "h": 766
  },
  "IV-127": {
   "src": "img/IV-127.jpg",
   "w": 938,
   "h": 842
  }
 },
 "chapters": [
  {
   "no": 1,
   "title": "데이터 모델링 이해",
   "sections": [
    {
     "no": 1,
     "title": "데이터 모델링 개요",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "데이터 모델링 정의",
       "body": "- 데이터 모델링(Data Modeling)\n  - 현실 세계 조직의 업무에서 필요로 하는 정보를 컴퓨터 세계의 데이터베이스에 저장, 활용하기 위한 지적인 작업 과정\n  - 데이터 모델(Data Model)\n    - 현실 세계를 데이터베이스로 표현하는 중간과정\n    - 저장 할 데이터의 구조 및 업무 규칙을 표현하기 위해 사용하는 지적인 도구\n- **개념 데이터 모델링(Conceptual Data Modeling)**\n  - 추상화(Abstraction)를 통하여 개념 세계에서 정보의 구조와 업무 규칙을 ERD로 표현해 가는 과정\n- **논리 데이터 모델링(Logical Data Modeling)**\n  - 개념 데이터 모델 → 특정 DB(계층적, 망형, 관계형)로 구현할 것을 결정하고, 그 구조로 표현하는 것\n  - 오늘날 개념 데이터 모델링과 논리 데이터 모델링을 명확히 구분하지 않고 합쳐서 논리 데이터 모델링(또는 데이터 모델링)이라 함.\n- **물리 데이터 모델링(Physical Data Modeling) / 데이터베이스 설계**\n      - 논리 데이터 모델링의 산출물(논리 데이터 모델-ERD)을 특정 DBMS(Oracle 등)에서 이해하고 처리할 수 있도록 하는 일련의 과정\n[[img:IV-01]]\n#### 가. 데이터 모델링 탄생 배경\n[[img:IV-02]]\n- 초창기 컴퓨터 : 데이터보다는 주로 처리 알고리즘에 관심\n- 일괄(batch) 처리 업무에 컴퓨터 이용 시작(1950년대)\n- 파일시스템의 사용 : 데이터 중복, 불일치, 시스템 통합의 한계 등 문제\n- 데이터베이스 기술 : 프로그램으로부터 데이터의 독립성 보장, 정보시스템 개발/유지보수의 생산성 향상\n- 데이터 구조의 개념화 : 계층형(Hierarchical) 데이터베이스, 망형(Network) 데이터베이스, 관계형(Relational) 데이터베이스\n- IBM의 IMSD(Information Management System DataBase) RDB\n  - 당시 정보시스템 구축 설계 방법 : 데이터보다는 프로세스와 기능 위주의 구조적(Structural) 방법론, 데이터 흐름도(DFD, Data Flow Diagram)\n  - 정보시스템은 통합 개념이 아닌 그때그때 필요한 시스템을 구현 → 정보의 고립화 초래\n  - 데이터의 중복 → 정보의 고립화, 데이터의 정확성/일관성 문제, 시스템 통합의 한계\n- 이후 관계형 데이터베이스의 기본 개념, 논리 데이터 모델링 소개\n- 온라인 거래 처리(OLTP) 시스템 : 관계형 데이터베이스, 엔터티-관계도(ERD) 이용\n[[img:IV-03]]\n[[img:IV-04]]\n- 정보의 고립화\n  - 원인\n    - 전사 데이터 모델 기반 없이 시스템 개발\n    - 복잡한 업무 흐름에 의한 중복된 데이터\n  - 현상\n    - 불필요한 개발과 과다한 유지보수 비용\n    - 데이터 일관성과 정확한 유지 불가능\n    - 업무 요구에 비탄력적\n    - 의사 소통 문제\n    - 시스템 통합의 한계\n    - 낮은 생산성\n#### 나. 정보 시스템 개발 방법론\n\n‖ **개발 방법론** | **구조적 방법론** | **정보공학 방법론** | **객체지향 방법론** | **컴포넌트 기반 방법론** |\n| **연대** | 1960년대 ~¶1980년대 중반 | 1980년대 중반 ~¶1990년대 중반 | 1990년대 중반 ~ 2000년대 | 1990년대 후반 ~ 현재 |\n| **주요기술**¶**환경** | 메인프레임 환경¶단위업무 전산화¶3세대 언어¶파일ㆍ계층형 DB¶소프트웨어 공학 | 클라이언트/서버¶전사규모 전산화¶4세대 언어¶관계형 DB¶통합 CASE | 인터넷 환경¶다양한 SW 요구¶객체지향 언어¶대부분 관계형 DB¶UML | 웹서비스 환경¶업무기능 단위 컴포넌트¶J2EE, COM¶대부분 관계형 DB¶UML |\n| **주요기법** | 기능 모형¶자료흐름도(DFD)¶구조적 프로그램 | 데이터 모형¶엔터티관계도(ERD)¶프로세스 계층도¶폭포수 개발 | 객체 모형¶Use Case Diagram¶분석ㆍ설계 패턴¶반복ㆍ점진 개발 | 컴포넌트 모형¶Class Diagram¶컴포넌트 명세, 추출, 연동¶아키텍처 설계 |\n| **모델링** | 기능 모델링 | 데이터 모델링¶프로세스 모델링 | USE ASE 모델링¶객체 모델링 | USE CASE 모델링¶컴포넌트 모델링 |\n\n- 구조적 방법론(Structured Methodology)\n  - 절차 중심 업무 파악 및 시스템 구현\n  - 사용자 기능 요구, 데이터 흐름도(DFD, Data Flow Diagram)\n  - 정보 시스템 분석의 질적인 향상 도모 → 조직 전반의 거시적 관점 부족, 데이터 모델링 방법의 미흡, 계층형 DB 모델의 한계\n  - 관계형 모델 이론 발표(IBM의 E.F. CODD 박사)\n[[img:IV-05]]\n[[img:IV-06]]\n- 정보공학 방법론(IEM, Information Engineering Methodology)\n  - 데이터와 프로세스를 병행으로 분석하면서도 데이터에 좀 더 초점을 맞추는 정보 시스템 개발 방법론(James Martin)\n  - **정보 전략 계획(ISP, Information Strategy Planning) : 아키텍처 모델링**\n    - **정보 아키텍처**\n      - 데이터와 프로세스를 병행 분석 후 상호작용 분석 정리\n      - 데이터 아키텍처, 프로세스 아키텍처 → 업무 영역 분석(Business Area Analysis) 단계의 입력\n      - 데이터와 프로세스 관점에서 상세한 엔터티-관계도, 프로세스 계층도(PHD, Process Hierarchy Diagram)를 통하여 업무 분석\n    - **시스템 아키텍처**\n      - 정보 아키텍처를 시스템화\n      - 설계 단계에서 파악된 데이터, 프로세스를 이용하여 시스템 단위의 화면 설계, 데이터베이스 설계 후 구현\n    - **기술 아키텍처** : 시스템 아키텍처의 기반 기술 구조 형성\n    - **조직 아키텍처** : 정보/시스템/기술 아키텍처의 구현\n  - 전사아키텍처(EA, Enterprise Architecture) 방법론으로 발전하며 많이 사용\n    (∵ 객체지향이나 컴포넌트 기반 방법론에서도 데이터베이스는 관계형 데이터베이스 주로 사용)\n[[img:IV-07]]\n- 객체지향ㆍ컴포넌트 기반 방법론"
      },
      {
       "no": 2,
       "title": "데이터 모델링의 중요성",
       "body": "- 논리 데이터 모델링에서 다루는 대상은 ‘맞다’ ‘틀리다’로 답할 수 있는 ‘업무에서 발생하는 사실’을 다루는 것이다.\n- 논리 데이터 모델링\n  - 현업 사용자, 업무 분석가, 응용 설계자, 응용 개발자 등 정보시스템과 관련된 모든 이해관계자들이 전체적이고 종합적인 관점에서 업무를 인식하고, 상세한 업무규칙까지도 이해하는 데 도움을 주는 포괄적이며 중요한 개념 및 사상을 내포하고 있다.\n  - 중요한 업무 분석 기법 중 하나로 활용\n- 생성하려고 하는 데이터베이스 내에 데이터 무결성이 중요\n  - 데이터 무결성 : 관계형 테이블에 관계형 연산(입력/수정/삭제/조회)을 수행할 때, 테이블 내 데이터 값의 정확성(Accuracy)과 일관성(Consistency)을 보장하는 일련의 업무 규칙\n- 데이터 모델은 데이터베이스 설계에 대한 계획 또는 청사진\n\n[정리] {2013}\n- {b}**{u}모델링 기본 원칙{/u}**{/b}\n- {b}**커뮤니케이션 원칙(Communication Principle)**{/b}\n  - 요구 사항은 모든 사람들이 이해할 수 있도록 {r}{u}명확하게 공표{/u}{/r}됨은 물론\n  - {r}{u}최종 사용자 지향적{/u}{/r}으로 {r}{u}분명하게 파악되는 수준{/u}{/r}으로 작성되어야 한다.\n- {b}**모델링 상세화 원칙 (Granularity Principle)**{/b}\n  - 데이터는 {r}{u}데이터의 본질{/u}{/r}{u}과{/u} {r}{u}잠재적 사용{/u}{/r}{u}을 이해할 수 있을 만큼{/u} 상세화되어야 한다\n- {b}**논리적 표현 원칙 (Logical Representation Principle)**{/b}\n  - 조직의 데이터에 대한 논리적 측면을 최대한 표현해야 한다.\n  - 모델은 물리적 제약 조건 없이 {r}{u}비즈니스를 그대로 반영{/u}{/r}해야 한다.\n\n[정리] {2013}\n- {b}**{u}좋은 데이터 모델의 요소{/u}**{/b}\n- {b}**완전성(Completeness) :**{/b} 업무에 필요한 모든 데이터가 데이터 모델에 정의 되어 있어야 한다.\n- {b}**중복 배제(Non-Redundancy)**{/b}\n- {b}**비즈니스 룰 (Business Rules)**{/b}\n- {b}**데이터 재사용(Data Reusability)**{/b}\n  - 단위시스템 별이 아닌 전사 차원의 {r}**통합성**{/r}과 {r}**독립성**{/r}에 대한 충분한 검토 필요\n- {b}**안정성 및 확장성(Stability and Flexibility)**{/b}\n- {b}**간결함(Elegance)**{/b} **:** 간결함의 기본적인 전제는 {r}통합{/r}이다.\n- {b}**의사소통**{/b}\n- {b}**통합성**{/b}\n- {b}**{u}데이터 모델링 시 주의점{/u}**{/b}\n- **중복(Duplication)**\n- **비유연성(Inflexibility)**\n  - 사소한 업무 변화에도 데이터 모델이 수시로 변경되지 않도록 하는 것\n  - 데이터의 정의를 데이터 사용 프로세스와 분리\n- **비일관성(Inconsistency)**\n  - 데이터 {u}중복이 없더라도{/u} 다른 데이터와 **{u}모순됨{/u}**을 고려하지 않고 {u}데이터를 수정{/u}할 때 발생한다.\n  - 예) 데이터의 중복이 없더라도 신용 상태에 대한 갱신 없이 납부 이력 정보를 갱신하는 것\n- {b}**{u}데이터 모델링 필요성{/u}**{/b}\n- **파급 효과(Leverage)**\n  - 시스템 구축 완성 시점에 데이터 모델의 변경은 표준/응용 영향 분석과 변경 작업이 대규모로 발생하여 큰 위험 요소가 된다.\n- **복잡한 정보 요구 사항의 간결한 표현(Conciseness)**\n  - 데이터 모델은 정보 요구 사항과 한계를 명확하고 간결하게 표현할 수 있는 도구이다.\n- **데이터 품질(Data Quality)**\n  - 데이터 구조의 문제로 인한 데이터 품질의 문제는 치유하기에 불가능한 경우가 대부분이다."
      }
     ]
    },
    {
     "no": 2,
     "title": "데이터 모델링 기법 이해",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "엔터티-관계 데이터 모델(Entity-Relationship Model) : Peter Chen 제안(1976년)",
       "body": "#### 가. 추상화\n- 개념 데이터 모델링 : 현실 세계에 대한 인식을 추상적 개념으로 표현하는 과정\n  - ERD : Entity(개체) → (추상화) → Entity Type(개체 타입)\n  - 객체지향 컴포넌트 기반 : Entity(개체) → (추상화) → Class\n  - 여러 엔터티들을 집합으로 파악하는 것\n- {r}**유형화(Classification)**{/r}\n  - 현실 세계에 존재하는 같은 성질을 갖는 멤버들을 타입 또는 유형(Class)이라는 하나의 개념으로 정의\n  - 하나의 엔터티는 바라보는 관점에 따라 여러 가지로 유형화 가능\n    (하나의 엔터티를 여러 가지 엔터티 타입으로 유형화 가능)\n    예) ‘소나타’ ⇒ 어떤 회사에서는 ‘상품’ 엔터티 타입, 어떤 회사에서는 ‘고정자산’ 엔터티 타입\n  - {r}IS-MEMBER-OF{/r}의 관계\n- {r}**집단화(Aggregation)**{/r}\n  - 값(Value)을 유형화하면 속성\n  - 속성 타입들의 세트로 구성되는 새로운 타입(엔터티 타입)을 정의하는 개념\n    - 예) ‘핸들’, ‘바퀴’, ‘페달’이라는 속성(타입)들의 집단화 → ‘자전거’ 엔터티 타입\n  - {r}IS-PART-OF{/r}의 관계\n- {r}**일반화(Generalization)**{/r}\n  - 여러 엔터티 타입 간의 공통적인 특성을 파악하는 과정\n  - 둘 또는 그 이상의 엔터티 타입 요소 간에 서브세트(부분집합)를 정의하는 개념\n  - 엔터티를 바라보는 관점에 따라 여러 가지 방법이 가능\n  - 슈퍼타입(전체집합)에 정의된 모든 특성은 서브타입(부분집합)으로 상속\n  - {r}IS-A{/r}의 관계\n    {r}**C-MAP-GA**{/r} **(**{r}**C**{/r}**lassification-is_**{r}**M**{/r}**ember_of,** {r}**A**{/r}**ggregation-is_**{r}**P**{/r}**art_of,** {r}**G**{/r}**eneralization-is-**{r}**A**{/r}**)**\n    **추상화란 현실세계 존재하는 구체적 개체(Entity) 또는 객체(Object)들의 공통된 특징, 즉 추상적 특징을 파악하여 인식의 대상으로 삼는 행위를 말한다.**\n[[img:IV-08]]\n#### 나. 타입과 인스턴스\n[[img:IV-09]]\n- 논리 데이터 모델링에서 모델링의 대상 : 엔터티 타입, 관계, 속성\n- 페어링(Paring)\n- 엔터티 타입(type)은 언터티(instance)의 집합\n- 관계(type)는 퍼어링(instance)의 집합\n- 속성(type)은 값(instance)의 집합\n- Instance\n  - 현실 세계 업무에서 발생하는 엔터티 타입/관계/속성의 실제 발생 사례(sample)\n  - instance chart\n    - 엔터티 타입 instance chart : 엔터티의 사례\n    - 관계 instance chart : 페어링의 사례\n    - 속성 instance chart : 값의 사례\n\n‖ **모델** | **개념** | **개념 세계에서 추상화(유형화)한 것**¶**(Type, Class, 타입, 유형, 집합, 복수)** | **현실 세계 존재하는 하나의 개체**¶**(Instance, Occurrence, 단수)** |\n| **엔터티-관계**¶**데이터 모델** | 업무에서 다루는 사물(Thing) | **엔터티(Entity)** | **인스턴스(Instance)** |\n| ^^ | ^^ | 엔터티 타입(Entity Type)¶개체 타입(Entity Type)¶실체 유형(Entity Type) | 엔터티(Entity)¶개체(Entity)¶실체(Entity) |\n| ^^ | 사물(thing) 사이 연관 | **관계(Relationship)** | **페어링(Paring)** |\n| ^^ | 사물(thing) 사이 특성 | **속성(Attribute)** | **값(Value)** |\n| **Object-**¶**Component Model** | 업무에서 다루는 사물(thing) | **클래스(Class)** | **객체(Object)** |"
      },
      {
       "no": 2,
       "title": "엔터티-관계 데이터 모델 구성요소",
       "body": "- 엔터티-관계 데이터 모델의 구성요소 : 엔터티, 관계, 속성\n  - 인스턴스, 페어링, 값의 추상화를 통해 집합적인 단일 개념으로 정의한 논리 객체\n- 엔터티-관계 데이터 모델 표기법\n  - 정보공학(Information Engineering) 방법론 표기법\n  - 케이스 메소드(Case*Method) 방법론 표기법\n[[img:IV-10]]\n#### 가. 엔터티\n- 조직의 업무를 수행하는데 필요로 하는 사물(Thing), 사건(Event) 또는 개념(Concept)을 나타내는 어떤 것\n  - 동일한 업무 행위를 하는 단일 개념으로 정의한 멤버(인스턴스)들의 집합체\n    - 어떻게 정의하느냐에 따라 인스턴스들의 구성이 달라질 수 있음.\n      (인스턴스들의 동일한 성질을 어디까지로 한정할 것인지를 결정하는 것에 따라 잘라질 수 있음.)\n    - 예) ‘고객’의 의미를 어디까지 정의하느냐에 따라 달라질 수 있음. 구매한 사람/법인, 잠재 고객,\n  - 유사한 속성을 갖는 단일 개념으로 정의한 멤버들의 집합체\n    - 어떤 한 인스턴스를 설명하거나 묘사할 수 있는 특성들에 대해 다른 여러 인스턴스들이 동일한 특성들로 설명 또는 묘사될 수 있음을 의미\n    - 예) 특정 ‘학번’, ‘이름’, ‘학과’로 특정지어지는 ‘홍길동’이라는 학생은 ‘인스턴스’,\n      ‘학번’, ‘이름’, ‘학과’ 등의 공통적인 특성 항목들을 공유하는 학생들의 집합인 ‘학생’은 엔터티(Entity-집합)\n#### 나. 관계\n- 하나 또는 두 개의 엔터티에서 인스턴스를 연관시키는 업무적인 이유\n- 하나 또는 두 개의 엔터티 사이 업무적인 이유에 의해서 연결된 페어링의 집합\n- 관계의 기수성(Cardinality, Degree)과 선택성\n- 유일 식별자(UID, Unique Identifier), 외부 식별자(Foreign Identifier), 연결(Associative) 엔터티로 관계\n- 관계의 역할 및 중요성\n  - 관계는 여러 개의 엔터티를 조인(Join)하여 정보를 조회할 수 있다.\n  - 관계는 중복 데이터를 배제하는 데 도움이 되므로 데이터 정확성 향상에 기여한다.\n#### 다. 속성과 도메인\n- 속성 : 엔터티에 저장되어 있는 인스턴스들의 특성을 설명하는 항목\n- 도메인(Domain) : 하나의 속성이 갖는 같은 종류의 모든 값들의 집합\n  - 시스템 정의 유형 도메인 : 시스템이 제공하는 문자(Character), 날짜(Date), 숫자(Number) 등\n  - 사용자 정의 유형 도메인 : 예) ‘상태코드’\n- **각 속성은 어느 한 도메인 상에서 정의되어야 하고, 정의된 속성은 반드시 그 해당 도메인으로부터만 값을 취할 수 있다.**\n#### 라. 식별자\n- 유일 식별자(Unique Identifier) : 어떤 특정 인스턴스 하나를 식별할 수 있는 하나 또는 하나 이상의 속성\n- 엔터티 무결성(Entity Integrity) 규칙\n  - **일련의 식별자 속성은 반드시 값을 갖는다.**\n  - **일련의 식별자 속성의 값은 유일(Unique)하다.**\n  - **식별자를 구성하는 일련의 속성은 최소한의 개수로 해야 한다.**\n[정리] {2013}\n- {b}**{u}개괄 데이터 모델{/u}**{/b}\n  - 전사 데이터 영역 모델 (계획자 관점)\n  - 상위 수준의 전사 데이터 영역을 분류하여 표현한 것이며, 상위 주제 영역 수준의 데이터 구성도가 이에 해당된다.\n  - 상위 주제 영역 수준의 데이터 구성도 (**주제 영역 상위**)\n  - 데이터 영역과 데이터 집합을 업무 영역에 국한하지 않고 전사적 관점에서 정의하는 것으로, 각 데이터 영역은 다른 데이터 영역과 관계를 가질 수 있다\n- {b}**{u}개념 데이터 모델{/u}**{/b} (책임자 관점)\n  - {r}**{u}주제 영역{/u}**{/r}{u}을 정의하고 주제 영역 내의{/u} {r}**{u}핵심 엔터티{/u}**{/r}{u}를 도출하여, 그들간의{/u} {r}**{u}관계{/u}**{/r}{u}를 정의하는 것.{/u}\n  - 전사 수준의 데이터 모델로 {r}**단위 주제 영역**{/r} 또는 {r}**핵심 엔터티**{/r} 정도를 표현한 데이터 모델\n  - 전사 수준에서 사용하는 데이터를 전체적으로 표현할 수 있는 기본 틀로서, 전사 데이터아키텍처를 관리하는 데 있어 매우 유용한 모델이다.\n  - **현행 시스템의** {r}**데이터구조를 분석**{/r}**하여 전체 업무 범위와 업무 구성 요소를 확인하고 전체 데이터의 윤곽을 잡기 위해** {r}**핵심적인 데이터 집합**{/r}**을 도출하고** {r}**전사 수준에서의 데이터 구조를 정의**{/r}\n  - **주제 영역 하위**\n  - 핵심 엔터티는 일반적으로 단위 주제 영역별로 한두 개가 정도가 도출된다."
      }
     ]
    },
    {
     "no": 3,
     "title": "데이터 모델링 표기법 이해",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "엔터티-관계 데이터 모델 표기법",
       "body": "#### 가. 엔터티 표기법\n- ER-Win의 IDEFIX(Integraion DEFinition for information modeling) 표기법\n- **정보공학(IE) 엔터티 표기법**\n  - {b}독립(Independent) 엔터티{/b} : 하나의 인스턴스를 식별하는 데 어떤 다른 인스턴스에 의존하지 않는 엔터티\n  - 종속(Dependent) 엔터티 : 하나의 인스턴스를 식별하는 데 하나 또는 하나 이상의 다른 인스턴스에 의존하는 엔터티\n    - {r}**특성(Characteristic) 엔터티**{/r} : {u}하나의 인스턴스에 여러 번 발생하는 속성의 그룹(예-사원경력, 고객주소 등){/u}\n    - {b}**연관(Associative) 엔터티**{/b} : {u}두 개 이상의 연관된 다른 엔터티로부터 식별자를 상속받는 엔터티{/u}(다대다 관계 해소 시 생성, 예-주문 상품 등)\n    - {b}**서브타입(Sub-type) 엔터티**{/b} : 다른 부분집합과 구별되는 공통 속성이나 관계를 공유하는 엔터티 부분집합(예-개인고객, 법인고객 등)\n[[img:IV-11]]\n- **Case*Method 엔터티 표기법**\n  - 부모 유일 식별자가 자식 유일 식별자의 일부가 되는지 여부에 따라 UID바 표시\n    - UID바(UID Bar, Unuique Identifier bar) : 부모이 유일식별자 속성이 자식의 유일 식별자 속성의 일부 또는 전체가 될 때 표시\n  - 서브타입은 슈퍼타입 안에 표시\n[[img:IV-12]]\n#### 나. 속성 표기법\n- 속성\n  - 엔터티에 저장되는 인스턴스들의 특성을 설명하는 항목\n  - 단어들을 조합한 명사적 용어로 표현\n  - ‘엔터티명 + 수식어 + 도메인명’, 예) 사원입사일자\n- 유일 식별자(UID, Uinique Identifier)/주키(PK, Primary Key) : 하나의 인스턴스를 식별해 낼 수 있는 하나 또는 그 이상의 속성\n- 외래 식별자(Fereign Identifier)/외래키(FK, Foreign Key) : 다른 엔터티로부터 상속 받은 속성\n- 필수(Mandatory) 속성\n  - ‘*’ 표시(CASE*Method 표기법)\n  - 속성 값이 반드시 필요한 속성\n  - 물리 데이터베이스 설계 시점에 ‘NOT NULL’ 표기\n- 선택 (Optional) 속성\n  - ‘o’ 로 표시(CASE*Method 표기법)\n  - 반드시 필요하지는 않은 속성\n  - 물리 데이터베이스 설계 시점에 ‘NULL’ 표기\n[[img:IV-13]]\n#### 다. 관계 표기법\n- 관계\n  - 하나 또는 두 개의 엔터티에서 인스턴스를 연관시키는 업무적인 이유\n  - 하나 또는 두 개의 엔터티 사이 연결되어 있는 페어링의 집합\n- 1) 관계 기수성(Cardinality, Degree) 표기법\n  - 일(一)은 ‘-’, 다(多)는 까마귀발(Crow’s Foot) 형태()로 표현\n[[img:IV-14]]\n  - 일대일 관계 / 일대다 관계 / 다대다 관계\n[[img:IV-15]]\n- 2) 관계 선택성 표기법\n  - 필수 관계 : 실선(CASE*Method), 동그라미 생략(IE)\n  - 선택 관계 : 점선(CASE*Method), 동그라미 표시(IE)\n- 선택성(Optional) : 페어링(Paring)의 존재 여부\n  - 하나 또는 두 개의 엔터티 간에 관계가 설정될 때, 모든 인스턴스 간에 페어링이 존재해야 하는지(Mandatory), 아니면 모든 인스턴스에 대하여 페어링이 존재할 필요가 없는지(Optional)를 나타낸다.\n- 선택성의 결정 방법(과거)\n  - 필수(Mandatory) : 관계 읽기를 통하여 반드시(Must)이면 필수 관계\n     – 하나 이상의 사원이 반드시 하나의 부서에 소속되어 있다.\n  - 선택(Optional) : 관계 읽기를 통하여 일 수도(May)이면 선택 관계\n     – 하나 부서에는 여러 명의 사원이 소속될 수도 있다.\n- {b}선택성의 결정 방법(현재){/b}\n  - {b}**필수(Mandatory)**{/b} : 다{b}른 엔터티에 어떤 행(Row)을 입력하기 전에 상대 엔터티에 적어도 한 건의 행(Row)이 반드시 있어야만 하는 경우{/b}\n  - 선택(Optional) : 다른 엔터티에 어떤 행(Row)을 입력하기 전에 상대 엔터티에 어떤 행(Row)이 존재할 필요가 없는 경우\n[[img:IV-16]]\n- 3) 관계 식별성 표기법\n  - 식별 관계(Identifying Relationship)\n    - 부모 엔터티의 식별자가 자식 엔터티의 식별자의 일부분이 되는 관계\n    - 자식 엔터티는 부모 에터티에 대하여 존재 종속적이고 식별 종속적\n    - 자식 엔터티의 인스턴스를 식별할 때 반드시 부모 엔터티의 인스턴스를 먼저 식별\n    - UID Bar(CASE*Method), 실선(IE)\n[[img:IV-17]]\n  - 비식별 관계(Non-Identifying Relationship)\n    - 부모 엔터티의 식별자가 자식 엔터티의 식별자의 일부분이 안 되고 일반 속성으로 표현되는 관계\n    - 자식 엔터티는 부모 에터티에 대하여 존재 종속적이지만, 식별 종속적은 아님.\n    - 자식 엔터티의 인스턴스를 식별할 때 부모 엔터티의 인스턴스를 먼저 식별할 필요 없음.\n    - UID Bar가 없음(CASE*Method), 점선(IE)\n[[img:IV-18]]"
      }
     ]
    },
    {
     "no": 4,
     "title": "관계형 모델 이론",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "릴레이션 개념",
       "body": "- RDBMS에 생성한 테이블(Table) 개념 : 수학 집합이론의 릴레이션(Relation)으로부터 유래\n  - 행(Row) : 튜플(Tuple)\n  - 열(Column) : 애트리뷰트(Attribute)\n[[img:IV-19]]\n[[img:IV-20]]\n- 릴레이션 정의\n- 릴레이션(Relation)\n  - 두 개의 집합 x, y가 있을 때 두 집합간의 관계 R을 만족하는 모든 순서쌍을 말한다.\n    - 집합 x = {1, 2, 3}, 집합 y = {1, 2, 3, 4, 5} 일 때\n    - 집합 {x, y} =  (1,1), (1,2), (1,3), (1,4), (1,5), (2,2), (2,4), (3,3)\n    - 집합 G 릴레이션 = x, y 곱집합의 부분집합\n  - {r}**주어진 도메인들의 카티션 프로덕트(Cartesian Product)의 부분집합 (수학적 정의)**{/r}\n      - 학생 집합, 과목 집합, 수강과목 집합\n\n[표] 학생 × 과목 = 수강과목\n\n| 학생 | << |\n| 성명 | 생년월일 |\n| 장동건 | 196$/12/$$ |\n| 황정민 | 197$/10/$$ |\n\n‖ 과목 |\n| 과목명 |\n| 인사관리 |\n| 생산관리 |\n| 재무관리 |\n\n| 수강과목 | << | << |\n| 성명 | 생년월일 | 과목명 |\n| 장동건 | 196$/12/$$ | 인사관리 |\n| 장동건 | 196$/12/$$ | 생산관리 |\n| 장동건 | 196$/12/$$ | 재무관리 |\n| 황정민 | 197$/10/$$ | 인사관리 |\n| 황정민 | 197$/10/$$ | 생산관리 |\n| 황정민 | 197$/10/$$ | 재무관리 |\n\n[[img:IV-21]]\n  - R(A1, A2, ..., An) : 릴레이션 R의 스키마\n    - 릴레이션 이름 R, 일정수의 애트리뷰트 A1, A2, ..., An의 집합으로 구성\n    - 예 - 고객(고객번호, 성명, 생년월일, ..., 전화번호)\n    - 릴레이션 R의 인스턴스 : 어느 한 시점에 릴레이션 R에 포함되어 있는 튜플(Tuple)의 집합\n  - Relation 구성\n    - Relation schema : 릴레이션 구조\n    - Relation Instance : 릴레이션에 발생된 행(Row)\n    - Degree : 애트리뷰트의 개수\n    - Cardinality : 튜플(Tuple=Row)의 수\n\n‖  | **Relation** | **Entity** | **특성** |\n| **Schema** | **Relation Schema**¶릴레이션의 논리적 구조 | **Entity Schema**¶엔터티의 논리적 구조 | 정적¶(시간에 따라 변하지 않음) |\n| **Instance** | **Relation Instance**¶어느 한 시점의 릴레이션의 내용¶(Tuple 전체) | **Entity Instance**¶어느 한 시점의 엔터티의 내용¶(저장된 인스턴스 집합) | 동적¶(시간에 따라 생성/소멸) |\n\n- 속성과 도메인의 개념\n  - 애트리뷰트(속성) 값\n    - 관계형 모델에서 데이터의 가장 작은 논리적 단위\n    - 의미를 갖는 더 이상 분해할 필요가 없는 값 (원자값, Atomic Value)\n  - 도메인(Domain)\n    - 하나의 애트리뷰트(속성)가 갖는 같은 타입(유형)의 모든 원자 값들의 집합\n    - **각 속성은 어느 한 도메인 상에서 정의되어야 하고, 정의된 속성은 반드시 그 해당 도메인으로부터만 값을 취할 수 있다.**\n    - 시스템 정의 도메인(타입), 사용자 정의 도메인(타입)"
      },
      {
       "no": 2,
       "title": "관계형 모델 이론",
       "body": "- E.F Codd 박사가 수학의 집합이론(Set Theory)과 1차 술어 논리(1st Predicate Logic)를 이론적 배경으로 관계형 데이터베이스 모델 제작\n- {r}**데이터 구조(Data Structure)**{/r}\n  - 사용자가 인식하는 데이터의 구성 (organization of the data, as users perceive them)\n    - {r}**데이터 조작(Data Manipulation)**{/r}\n  - 사용자가 관계형 데이터 구조에 행하는 일련의 연산(처리) 형태\n    (type of operation users perform on the relational data structure)\n    - {r}**데이터 무결성(Data Integrity)**{/r}\n  - 사용자가 일련의 관계형 연산을 수행할 때 관계형 테이블의 데이터값이 어떻게 되어야 하는지를 통제하는 일련의 업무규칙(set of business rules that govern how relational data values behave when users perform relational operations)\n  - Handbook of Relational Database Design –1989\n  - Candace C. Fleming & Barbara von halle\n- 관계형 모델은 단순성을 지향\n  - 단순성 : 약간의 친숙한 개념들을 사용하여 모델을 묘사할 수 있음\n- 데이터 무결성(Integrity)\n  - 사용자가 관계형 테이블에 입력, 수정, 삭제, 조회의 데이터 조작을 수행할 때 데이터의 일관성(Consistency)과 정확성(Correctness)을 유지할 수 있도록 하는 일련의 업무 규칙(Set of Business Rules)\n  - 될 수 있으면 프로그램의 로직이 아니라 데이터베이스 시스템이 데이터 무결성을 보장할 수 있도록\n  - 논리 데이터 모델링 과정에서 업무 규칙을 논리 데이터 모델 내에 정확히 기술\n    → 데이터 무결성 업무 규칙을 프로그램으로 처리할 것인지, DBMS에서 설정할 것인지 시스템 설계 과정 중에 결정\n- 예) Oracle\n    - 각종 제약(Constraint) 및 트리거(Trigger)\n    - 기본 키(PK) 제약, 외래 키(Foreign Key) 제약, 체크(Check) 제약, NOT NULL 제약, 참조무결성을 보장하는 트리거(Trigger)\n#### 가. 데이터 구조\n- 관계형 모델 릴레이션의 6가지 특성\n  - **6가지 특성을 가진 행(Row)과 열(Column)로 구성된 2차원의 테이블로 표현**\n\n| 고객 (Customer) | << | << | << | << | << |\n| 고객번호 | 성명 | 생년월일 | 주민번호 | 전화번호 | 취미 |\n| 201105017 | 장동건 | 196$/12/$$ | 6$12$$-$$$$$$$ | 010-$$$$-$$$$ | 골프, 사진, 영화감상 |\n| 201207121 | 황정민 | 197$/03/$$ | 7$03$$-$$$$$$$ | 010-$$$$-$$$$ | 등산, 당구, 독서 |\n| 201301077 | 송강호 | 197$/10/$$ | 7$10$$-$$$$$$$ | 010-$$$$-$$$$ | 당구, 낚시, 음악감상, 사진 |\n| 201405111 | 송중기 | 197$/06/$$ | 7$06$$-$$$$$$$ | 010-$$$$-$$$$ | 독서, 골프, 영화감상 |\n| 201511007 | 이병헌 | 197$/12/$$ | 7$12$$-$$$$$$$ | 010-$$$$-$$$$ | 음악감상, 독서, 스키 |\n\n  - 각 열은 하나의 값을 가진다. (Entries in columns are single-valued.)\n  - 각 열의 값은 동일한 종류이다. (Entries in columns are of the same kind.)\n  - 각 행은 유일하다. (Each row is unique.)\n  - 열의 순서는 의미가 없다. (Sequence of columns is insignificant.)\n  - 행의 순서는 의미가 없다. (Sequence of rows is insignificant.)\n  - 각 열은 유일한 이름을 갖는다. (Each column has a unique name.)\n- Handbook of Relational Database Design –1989\n- Candace C. Fleming & Barbara von halle\n- 1) 각 열은 하나의 값을 가진다.\n  - 릴레이션이 갖는 애트리뷰트의 원자성 : 한 릴레이션에 나타난 애트리뷰트 값은 논리적으로 더 이상 분해할 수 없는 값으로 업무적인 이유에 의한 단위 값\n  - attribute 값으로 반복그룹(repeating group)이 허용되지 않는다. → 1차 정규형(1NF) 릴레이션\n- **하나의 속성에 여러 값을 정의한 경우**\n\n| 고객 (Customer) | << | << | << | << | << |\n| 고객번호 | 성명 | 생년월일 | 주민번호 | 전화번호 | 취미 |\n| 201105017 | 장동건 | 196$/12/$$ | 6$12$$-$$$$$$$ | 010-$$$$-$$$$ | {b}골프, 사진, 영화감상{/b} |\n| 201301077 | 황정민 | 197$/10/$$ | 7$10$$-$$$$$$$ | 010-$$$$-$$$$ | {b}당구, 낚시, 음악감상, 사진{/b} |\n| 201405111 | 송강호 | 197$/06/$$ | 7$06$$-$$$$$$$ | 010-$$$$-$$$$ | {b}독서, 골프, 영화감상{/b} |\n| 201511007 | 송중기 | 197$/12/$$ | 7$12$$-$$$$$$$ | 010-$$$$-$$$$ | {b}음악감상, 독서, 스키{/b} |\n\n- **취미로 인하여 고객 집합이 반복 그룹이 되는 경우**\n\n[표] 고객 × 취미 = 고객취미\n\n| 고객 | << |\n| 성명 | 생년월일 |\n| 장동건 | 196$/12/$$ |\n| 황정민 | 197$/10/$$ |\n\n‖ 취미 |\n| 취미명 |\n| 수영 |\n| 골프 |\n| 등산 |\n\n| 고객취미 | << | << |\n| 성명 | 생년월일 | 취미명 |\n| 장동건 | 196$/12/$$ | 수영 |\n| 장동건 | 196$/12/$$ | 골프 |\n| 장동건 | 196$/12/$$ | 등산 |\n| 황정민 | 197$/10/$$ | 수영 |\n| 황정민 | 197$/10/$$ | 골프 |\n| 황정민 | 197$/10/$$ | 등산 |\n\nselect 성명 from 고객취미 where 취미명 = ‘골프\n→ ’where절에 기술한 속성(취미명)의 단위가 원자 값이어야 한다.\n  - 관계형 모델의 처리방식은 집합 처리 방식으로 관계형 테이블 내 모든 속성은 원자 값으로 구성되어야 함.\n    - 순차(Sequential)처리 방식 : 파일 포인터를 이용한 파일/세그먼트에서 레코드를 한건씩 처리하는 방식\n    - 집합(Set) 처리 방식 : 전체집합에서 부분집합을 구하는 SQL 문\n  - 반복그룹 속성의 비정규화된 테이블 → 입력/수정/삭제 이상 현상 발생 → 데이터의 일관성/정확성 깨짐\n  - 다중값(Multi Value)을 갖는 속성 → 정규화(Normalization)를 해야 함.\n  - 속성이 반복그룹 속성이 아닌 단일 값(Single Value)이면서 원자 값 (Atomic Value)이어야 하는 이유\n    - 정보 접근의 유연성\n    - 테이블 구조 변경의 유연성\n    - 입력, 수정, 삭제 이상 현상을 없애고 데이터의 무결성(정확성과 일관성) 확보\n- 2) 각 열의 값은 동일한 종류이다.\n  - 속성은 같은 성격을 갖는 속성 값을 추상화하여 개념화한 것\n  - 도메인 무결성 : 관계형 릴레이션 내에 각 애트리뷰트의 값은 동일한 종류로 정의해야 한다.\n- 3) 각 행은 유일하다.\n  - 튜플(Tuple)의 유일성 : 두 개의 똑같은 튜플은 한 릴레이션에 포함될 수 없다.\n  - 엔터티 무결성(Entity Integrity)\n- 4) 열의 순서는 의미가 없다. → 애트리뷰트의 무순서성\n- 5) 행의 순서는 의미가 없다. → 튜플의 무순서성\n- 6) 각 열은 유일한 이름을 갖는다.\n  - 열이 표현되는 테이블 내에서는 반드시 유일한 이름을 가져야 한다.\n    (단, DBMS 전체 또는 주어진 데이터베이스에서 조차 유일할 필요는 없다.)\n#### 나. 데이터 조작\n- 관계형 데이터 모델의 데이터 조작 : 입력/수정/삭제/조회를 할 때 집합적으로 처리\n  - **집합 처리 (not one record at a time)**\n  - **관계 연산자 : 조회**\n    - Select(or Restrict) : 열에 의거한 행의 부분집합.\n    - Project : 열의 부분집합\n    - Product : 두 관계 테이블 간 행의 조합을 묶음\n    - Join : 열의 기준에 의거하여 각 행을 수평적으로 묶음\n    - Union : 중복을 없이하여 각 행을 수직적으로 묶음\n    - Intersection : 관계 테이블 간의 공통된 행\n    - Difference : 하나의 관계 테이블에만 있는 행\n    - Division : 다른 관계 테이블의 모든 행에 대응하는 열을 제외한 열\n  - **처리 연산자 : 관계 테이블의 내용에 변화**\n    - Insert : 행의 입력\n    - Update : 행의 수정\n    - Delete : 행의 삭제\n- Handbook of Relational Database Design –1989\n- Candace C. Fleming & Barbara von halle\n- 세그먼트(Segment) : 계층형 데이터베이스 모델의 파일로 관계형 모델의 테이블과 같은 개념\n- 계층형 데이터베이스 모델\n\n|  | 부서 | << | << | << |  |\n|  | 부서코드 | 부서명 | << | ... |  |\n| 부서사원 | << | << | << | << | << |\n| 사원번호 | 사원명 | 생년월일 | << | 입사일자 | 직급 |\n\n- 관계형 데이터베이스 모델\n\n‖ **CASE*Method 표기법** | **정보공학(IEM) 표기법** |\n| **부서**¶# 부서코드¶* 부서명 | **부서**¶부서코드¶──¶부서명 |\n| **사원**¶# 사원번호¶* 사원명¶* 생년월일¶* 입사일자¶* 직급¶* 부서코드(FK) | **사원**¶사원번호¶──¶사원명¶생년월일¶입사일자¶직급¶부서코드(FK) |\n\n- 요구사항 : 부서별 사원수를 알고 싶다.\n  - 계층형 데이터베이스의 데이터 처리 방식 : 한 건씩의 레코드를 처리하는 순차 처리 방식\n  - **관**계형 데이터베이스의 데이터 처리 방식 : 속성의 원자값(Atomic Value)에 의한 집합 처리 방식\n    SELECT 부서.부서명, COUNT(사원.사원번호)\n    FROM   부서, 사원\n    WHERE  부서.부서코드 = 사원.부서코드\n    GROUP BY 부서명\n    ORDER NY 부서명\n#### 다. 데이터 무결성\n- 데이터 관점의 다중 무결성\n  - **{u}데이터 무결성{/u}**\n    사용자가 일련의 관계형 처리(입력, 수정, 삭제, 조회)를 수행할 때 관계형 엔터티(테이블)의 데이터 값이 어떻게 작용해야 하는지를 통제하는 일련의 업무규칙으로 엔터티, 관계, 도메인 무결성 규칙 및 연쇄 작용이 있다.\n  - **엔터티 무결성 규칙(Entity Integrity Rule)**\n    주 키(특정 행을 유일하게 인식하는 하나 이상의 열)는 널(NULL) 값을 포함하지 않는다.\n  - 참조 무결성 규칙(Reference Integrity Rule)\n    관계 엔터티(테이블)의 모든 외래 키 값은 관련 있는 관계 엔터티(테이블)의 모든 주 키 값이 존재해야 한다.\n  - **도메인(속성) 무결성 규칙(Domain Integrity Rule)**\n    엔터티(테이블) 내의 모든 열(Column)에 관한 무결성 규칙으로 데이터 타입, 길이, 허용 값, 기본값, 유일성, 널(Null) 여부 등에 관한 제한이다.\n  - **연쇄작용(Triggering Operation) 또는 업무 규칙(Business Rule)**\n    입력, 삭제, 수정 또는 조회 등의 작업이 동일 엔터티(테이블) 혹은 다른 엔터티(테이블)의 속성에 영향을 미치는 업무규칙을 정의하는 것이다.\n- Handbook of Relational Database Design –1989\n- Candace C. Fleming & Barbara von halle\n- 1) 엔터티 무결성 규칙\n  - 튜플의 유일성\n- **유일 식별자란 엔터티 내 특정 건(Instance)을 다른 것과 구별할 수 있도록 식별해주는 하나 이상의 속성과 관계의 조합이다.**\n- 식별자를 구성하는 각 속성이 널(Null)이 아닐 것\n- 엔터티 내 특정 건(Instance)의 유일성(Uniqueness)을 보장할 것\n- 최소한의 속성 집합(Minimal)일 것\n  - 식별자를 구성하는 각 속성이 널(Null)이 아닐 것\n    - Null : 모르는 값 또는 정의할 수 없는 값\n- **식별자(Identifier)는 왜 널(NULL) 값을 허용하지 않는가?**\n\n  - T2 ← SELECT PK, A, B FROM T1\n  - T3 ← SELECT PK, C, D FROM T1\n  - T4 ← SELECT PK, A, B, C, D FROM T2, T3 WHERE T2.PK = T3.PK\n\n| T1 | << | << | << | << |\n| PK | A | B | C | D |\n| NULL | A1 | B1 | C1 | D1 |\n| Key1 | A2 | B2 | C2 | D2 |\n\n| T2 | << | << |\n| PK | A | B |\n| NULL | A1 | B1 |\n| Key1 | A2 | B2 |\n\n| T3 | << | << |\n| PK | C | D |\n| NULL | C1 | D1 |\n| Key1 | C2 | D2 |\n\n| T4 | << | << | << | << |\n| PK | A | B | C | D |\n| NULL | A1 | B1 | C1 | D1 |\n| Key1 | A2 | B2 | C2 | D2 |\n\n  - T1 테이블을 이용해 T2, T3 테이블을 만들고, T2, T3 테이블을 JOIN하면 T1테이블에 있었던 원래의 행을 조회할 수 없다.\n  - Null 값은 조인이 안 되어 조회가 안 되므로 무결성이 깨진다.\n  - 엔터티 내 특정 건(Instance)의 유일성(Uniqueness)을 보장할 것\n- **식별자(Identifier)는 왜 유일해야 하는가?**\n\n  - T2 ← SELECT PK, A, B FROM T1\n  - T3 ← SELECT PK, C, D FROM T1\n  - T4 ← SELECT PK, A, B, C, D FROM T2, T3 WHERE T2.PK = T3.PK\n\n| T1 | << | << | << | << |\n| PK | A | B | C | D |\n| Key1 | A1 | B1 | C1 | D1 |\n| Key1 | A2 | B2 | C2 | D2 |\n\n| T2 | << | << |\n| PK | A | B |\n| Key1 | A1 | B1 |\n| Key1 | A2 | B2 |\n\n| T3 | << | << |\n| PK | C | D |\n| Key1 | C1 | D1 |\n| Key1 | C2 | D2 |\n\n| T4 | << | << | << | << |\n| PK | A | B | C | D |\n| Key1 | A1 | B1 | C1 | D1 |\n| Key1 | A1 | B1 | C2 | D2 |\n| Key1 | A2 | B2 | C1 | D1 |\n| Key1 | A2 | B2 | C2 | D2 |\n\n  - T1 테이블을 이용해 T2, T3 테이블을 만들고, T2, T3 테이블을 JOIN하면 T1 테이블에 원래의 행에는 없었던 행이 조회된다(Product-다대다 곱집합 발생).\n    - 주 키(PK) 선정 기준\n      - 주 키를 구성하는 각각의 칼럼 수를 최소한의 집합으로 할 것 → 아니면, 유일성이 깨질 수 있음.\n      - 값의 수정이 없는 것 → 아니면, 자식 테이블에 미치는 영향이 많으므로 가능하면 이런 경우 주키 후보에서 제외\n      - 업무적으로 활용도가 높은 것\n  - 최소한의 속성 집합(Minimal)일 것\n- **유일 식별자(Identifier)는 왜 최소한의 속성 집합으로 구성되어야 하는가?**\n\n| **사원**¶# 사원번호¶* 사원명¶* 생년월일¶... |\n\n| **사원**¶# 사원번호¶# 사원명¶* 생년월일¶... |\n\n| 사원 | << | << |\n| 사원번호 | 사원명 | ... |\n| 100 | 장동건 | ... |\n| 200 | 황정민 | ... |\n| 300 | 송중기 | ... |\n| ... | ... | ... |\n\n| 사원 | << | << |\n| 사원번호 | 사원명 | ... |\n| 100 | 장동건 | ... |\n| 200 | 황정민 | ... |\n| 200 | 송강호 | ... |\n| 300 | 송중기 | ... |\n| ... | ... | ... |\n\n- **유일성은 수학의 무한대처럼 어떤 다른 속성을 합쳐도 유일하다.**\n- **최소한의 속성 집합이 아니면** {r}**유일 식별자의 유일성이 깨질 수 있다.**{/r}\n  - 유일성이 깨짐, 다른 테이블과 조인하면 카테션 프로덕트 발생하여 데이터가 2배로 증가\n- 2) 참조무결성 규칙\n- **엔터티(테이블)의 주 키(Primary Key:PK)와 마찬가지로 외래 키(Foreign Key:FK)도 데이터 무결성에 관한 업무 규칙을 내포하고 있다.**\n- **참조 무결성 규칙(Referential Integrity Rule)**\n  **엔터티(테이블)의 모든 외래 키(FK) 값은 관계있는 엔터티(테이블)에 주 키(PK) 값으로 존재해야 한다.**\n- **데이터베이스 설계 관점에서 선택하지 말고, 현업의 업무 규칙에 따라 적절한 규칙을 선택한다.**\n\n‖ **CASE*Method 표기법** | **정보공학(IEM) 표기법** |\n| **부서**¶# 부서코드¶* 부서명 | **부서**¶부서코드¶──¶부서명 |\n| **사원**¶# 사원번호¶* 사원명¶* 생년월일¶* 입사일자¶* 직급¶* 부서코드(FK) | **사원**¶사원번호¶──¶사원명¶생년월일¶입사일자¶직급¶부서코드(FK) |\n\n- **입력 규칙(Insert Rule) : 자식 엔터티의 행(Row)이 입력될 때**\n- **삭제 규칙(Delete Rule) : 부모 엔터티의 행(Row)을 삭제할 때(또는 행의 주 키(PK)를 수정할 때)**\n  - 외래 키가 나타나는 엔터티 → 자식 엔터티, 주키를 외래 키로 전이 시켜주는 엔터티 → 부모 엔터티\n[[img:IV-22]]\n- {b}‘주문’ 엔터티(자식 엔터티)에 행이 입력되기 전에 부모 엔터티인 ‘고객’ 엔터티에 먼저 등록되어 있어야 한다.{/b}\n- {b}‘주문상품’ 엔터티(자식 엔터티)에 행이 입력되기 전에, 부모 엔터티인 ‘주문’ 엔터티에 행이 먼저 등록되어 있어야 한다.{/b}\n- {b}부모 엔터티에 행이 입력될 때는 외래 키는 상관 없음.{/b}\n- {b}종속(Dependent) 또는 제한(Restrict)으로 대응되는 부모 엔터티에 행이 있는 경우에만 자식 엔터티에 행의 입력을 허용{/b}\n- {b}부모/자식 양쪽 모두 선택 관계이면 외래 키 속성 값을 널(Null) 처리 가능{/b}\n  - {b}입력 규칙{/b}\n    - {b}자식 엔터티에 행이 입력될 때, 부모 엔터티에 그 행이 먼저 존재해야 하는지를 결정하는 업무 규칙{/b}\n\n‖ **규칙** | **형태** | **내용** |\n| **입력규칙**¶**(Insert)** | **restrict** | **자식테이블에서 행을 입력할 때 부모 테이블에 없는 값을 사용하면**¶**→ 투플삽입 불가 (부모 엔터티에 먼저 등록되어 있어야 한다.)** |\n| ^^ | none | 그것을 참조하고 있는 자식 테이블의 값을 그대로 유지 |\n\n  - {b}삭제 규칙{/b}\n    - {b}부모 엔터티에 행이 삭제될 때, 자식 엔터티에 어떻게 영향을 줄 것인지를 결정하는 업무 규칙{/b}\n\n‖ **규칙** | **형태** | **내용** |\n| **삭제(수정)**¶**규칙**¶**(delete/**¶**update)** | **restrict** | **자식 테이블에서 참조하는 경우 → 부모 테이블에 있는 값 삭제(수정) 불가** |\n| ^^ | **cascade** | **참조하고 있는 자식 테이블의 값도 함께 삭제(수정)** |\n| ^^ | set null | 그것을 참조하고 있는 자식 테이블의 값은 null로 바꾼다. |\n| ^^ | set default | 그것을 참조하고 있는 자식 테이블의 값은 미리 지정해 놓은 값으로 변경 |\n| ^^ | none | 그것을 참조하고 있는 자식 테이블의 값을 그대로 유지 |\n\n    - {b}한쪽 필수, 한쪽 선택 관계{/b}\n    - {b}양쪽 필수 관계{/b}\n    - {b}연쇄작용(Triggering Operation) : (양쪽 필수 관계) 자식 엔터티의 마지막 행이 삭제될 때 → 부모 엔터티도 같이 삭제{/b}\n  - {r}**외래키 제약 조건(Foreign Key Constraint)**{/r}\n    - {r}설계 단계{/r}에 성능과 데이터 무결성을 고려하여 외래키 제약 조건을 데이터베이스의 {r}물리적으로 설정할지{/r}, {r}프로그램으로 해결할지{/r} 결정\n  - 현행에서 목표로의 데이터 이행시,\n    - 참조무결성이 깨져 있는 데이터들은 어떤 기본 값(Default Value)을 설정하여 참조무결성이 깨져 있는 것을 해결하고, 목표 데이터베이스에서는 참조무결성이 깨지는 일이 없도록 관리\n##### 3) 도메인 무결성 규칙\n  - 엔터티(테이블) 내의 모든 열(Column)에 관한 무결성 규칙\n  - 데이터 타입, 길이, 허용 값, 기본 값, 널(NULL) 여부 등\n  - 도메인의 중요성\n    - 도메인의 어떤 특정 값이 결정될 때 이 값을 보고 의사 결정을 한다.\n    - 같은 도메인의 값들까리 비교가 허용된다.\n    - 도메인은 데이터베이스 정의의 한 부분으로 분명하게 정의함으로써 속성이 취할 수 있는 값을 제한\n      - → 속성을 정의할 때 그 해당 도메인도 함께 명세함으로써 실제 속성의 값으로 나타난 값이 적당하냐 아니냐를 DBMS가 검사할 수 있게 됨.\n    - 결정된 도메인의 특정 값에 의한 의사 결정\n  - 도메인 무결성(Domain Integrity) / 속성 무결성\n    - 속성 값의 정확성을 보장하도록 하는 업무 규칙\n    - 체크 제약(Check Constraint) 설정도 포함\n##### 4) 연쇄 작용 또는 업무 규칙\n  - 연쇄 작용 (Triggering Operation) : {u}입력/수정/삭제/조회{/u} 등의 작업이 동일 **{u}엔터티{/u}** 혹은 다른 엔터티의 **{u}속성{/u}**에 영향을 미치는 업무 규칙을 정의하는 것\n    - 예1) 어떤 주문에 있어서 납품일자는 준문일자보다 과거일 수 없다.\n    - 예2) 유도(Derived) 속성, 계산(Calculated) 속성(예- 주문 총액, 이자)\n- **속성값의 무결성과 관련된 모든 업무적인 규칙에 대하여 다음과 같은 항목을 현업으로부터 도출하여 정의한다.**\n- 사용자 규칙 : 해당 업무규칙을 알기 쉽고 명확하게 기술\n- 사건 : INSERT / UPDATE / DELETE / SELECT\n- 엔터티 : 사건의 대상이 되는 엔터티(테이블)\n- 속성 : 사건의 대상이 되는 속성(사건이 Update인 경우)\n- 조건 : 연쇄작용을 일으키기 위한 조건\n- 연쇄작용 : 업무규칙에 의해 해당 사건이 일어났을 때 수행되어야 할 행위\n  - 연쇄작용 유형\n      - 유형 1 : 사용자 규칙에 의한 연쇄작용 (납기일은 주문일로부터 3일 이후여야 한다.)\n      - 유형 2 : Source 속성값의 변화에 따른 유도 속성값의 변화를 정의 (주문.주문총액)\n      - 유형 3 : 시점에 의해 자동으로 일어나는 연쇄작용. (일 마감작업)\n      - 유형 4 : 개체타입 간의 관계에 따른 무결성 유지의 필요성을 정의한 연쇄작용\n                (참조무결성 규칙의 정의만으로 해결할 수 없는 경우)\n\n‖ **CASE*Method 표기법** | **정보공학(IEM) 표기법** |\n| **주문**¶# 주문번호¶* 고객번호¶* 주문일자¶* 주문총액 | **주문**¶주문번호¶──¶고객번호¶주문일자¶주문총액 |\n| **주문상품**¶# 주문번호(FK)¶# 상품코드¶* 주문수량¶* 주문단가¶* 주문금액 | **주문상품**¶주문번호(FK)¶상품코드¶──¶주문수량¶주문단가¶주문금액 |\n\n**{u}(양쪽 필수 관계){/u}**\n**{u}해당 주문건의 마지막 주문상품을 삭제하면 해당 주문을 함께 삭제하거나 마지막 주문상품의 삭제를 취소한다.{/u}**\n- 양쪽 필수 관계 모델 경우 : 한쪽 선택, 한쪽 필수로 잘못 모델링 할 경우 데이터 무결성이 깨질 수 있음.\n- **각각의 테이블에 대하여 입력, 수정, 삭제 시의 업무 규칙을 정의하라.**\n\n| 고객 | << | << |\n| 고객번호 | 성명 | ... |\n| 201105017 | 장동건 | ... |\n| 201207121 | 황정민 | ... |\n| 201301077 | 송중기 | ... |\n| ... | ... | ... |\n\n| 주문 | << | << | << |\n| 주문번호 | 고객번호 | 주문일자 | 주문총액 |\n| C20010501007 | 201105017 | 2011/06/01 | ... |\n| C20010701725 | 201207121 | 2012/08/01 | ... |\n| F20030121796 | 201301077 | 2013/02/01 | ... |\n|  | ... | ... | ... |\n\n| 주문상품 | << | << | << | << |\n| 주문번호 | 내역번호 | 상품코드 | 수량 | 단가 |\n| C20010501007 | 001 | P95001 | 10 | 90,000 |\n| C20010501007 | 002 | P97121 | 5 | 50,000 |\n| C20010701725 | 001 | ... | 15 | 300,000 |\n| C20010701725 | 002 | ... | 100 | 5,000 |\n|  | ... | ... | ... | ... |\n\n| 상품 | << |\n| 상품코드 | 상품명 |\n| P95001 | MP3 |\n| P97121 | ... |\n| P98200 | ... |\n| C20101 | ... |\n| C27008 | ... |\n\n‖ **연쇄 작용 정의 사례(Triggering Operation) ⇒ 업무 규칙(Business Rule)** | << | << | << | << |\n| **사건** | **엔터티** | **속성** | **조건** | **처리** |\n| INSERT | 주문 | 주문총액 | 주문내역에 새로운 행(Row)을 입력하면 | SUM(수량*단가=금액) |\n| UPDATE | 주문 | 주문총액 | 주문내역에 상품코드 또는 수량을 수정하면 | SUM(수량*단가=금액) |\n| DELETE | 주문 | 주문총액 | 주문내역의 행(Row)을 삭제하면 | SUM(수량*단가=금액) |\n| - | - | - | - | - |\n\n  - 업무 규칙의 양이 많아서 논리 데이터 모델 내에 정리 할 수 없다면, 참고 자료를 작성하여 논리 데이터 모델과 연계성을 갖도록 함. (통상 프로그램 내에 녹아 있는 경우가 대부분)\n\n‖  | **관계형 데이터베이스 모델** | **비 관계형 데이터베이스 모델** |\n| **구조**¶**(Structure)** | 6가지 특성을 갖는 Table¶{r}Post-Define(사후 정의) Schema{/r}¶DB 구조 변경이 상대적으로 쉬움 | Flat(특성이 없는) File¶{r}Pre-Define(사전 정의) Schema{/r}¶DB 구조 변경이 어려움 |\n| **조작**¶**(Manipulation)** | 8개의 조회 연산자, 처리 연산자¶집합(SET) 처리¶원자값(Atomic Value) 처리 | READ 조회, 처리 연산자¶한 건씩(Record) 처리¶Pointer 처리 |\n| **무결성**¶**(Integrity)** | 엔터티, 참조, 도메인 무결성 및 연쇄작용 | 무결성 개념 없음 |\n|  | {r}Key와 접근경로(Index)는 별개의 개념{/r}¶Data에 대한 접근경로가 유연함 | {r}Key와 접근경로(Index)가 거의 동일{/r}¶Data에 대한 접근경로가 제한적 |"
      }
     ]
    }
   ]
  },
  {
   "no": 2,
   "title": "데이터 모델링",
   "sections": [
    {
     "no": 1,
     "title": "논리 데이터 모델링 이해",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "논리 데이터 모델링 핵심",
       "body": "- 논리 데이터 모델링의 핵심\n  - 업무에서 필요로 하는 데이터에 존재하는 사실을 인식/기록하는 것\n  - 현업 사용자의 업무에서 필요로 하는 요구 사항에 따라 데이터 관점에서 요구 사항을 이해/정리하여\n  - 이해 관계자(현업 사용자, 응용 운영자, 응용 설계자, 응용 개발자 등)들에게 데이터에 존재하는 업무 사실을 정확하게 알려주기 위하여 문서화하는 것\n  - 논리 데이터 모델링에서 파악한 것을 어떤 조직의 업무 사실에 기초하여 그 조직에서 필요로 하는 데이터의 구조 및 업무 규칙을 논리 데이터 모델에 기록하는 것\n- 논리 데이터 모델링 과정에 업무에 능통한 전문가의 참여가 중요\n  **논리 데이터 모델링의 핵심은 어떻게 데이터에 접속하는지, 누가 데이터에 접속하는지, 데이터에 접속하는 방법의 전산화와는 독립적으로 비즈니스 데이터에 존재하는 사실을 인식, 기록하는 기법일 뿐만 아니라 철학이다.**\n  **(At the heart of logical data modeling is a philosophy – as well as a technique – for recognizing and documenting the fact that business data have an existence, independent of how they are accessed, who accesses them, and where or not such access is computerized.)**\n- Handbook of Relational Database Design –1989\n- Candace C. Fleming & Barbara von halle\n[[img:IV-23]]\n#### 가. 논리 데이터 모델링 필수 성공 요소\n- 업무에 능통한 현업 사용자와 함께 데이터 모델링을 진행하라 (전문가의 참여는 필수)\n- 절차(Procedure)보다는 데이터에 초점을 두고 모델링을 진행하라\n  (무슨(What) 데이터를 왜(Wh) 사용하고, 관리하는지)\n- 데이터의 구조(Structure)와 무결성(Integrity)을 함께 고려하라\n- 개념화(Conceptualization)와 정규화(Normalization) 기법을 적용하라\n  - 개념화(Conceptualization) : 현실 세계에서 발생하는 업무 데이터를 엔터티/관계/속성으로 표현하는 추상화\n  - 정규화(Normalization) : 데이터의 이상현상(입력 이상, 수정 이상, 삭제 이상)을 제거하여 데이터의 무결성과 유연성을 향상 시키는 기법\n- 가능하면 다이어그램(Diagram)을 이용하여 업무를 표현하라\n- 데이터 모델링을 지원하는 데이터 사전을 구축하라\n  - 메타 데이터 관리 시스템 도입을 통한 데이터 표준화\n  - 데이터 거버넌스(종합 통제 관리) 측면에서 중요\n#### 나. 논리 데이터 모델링 목적 및 효과\n- 해당 비즈니스에 대한 데이터 관점에서의 명확한 이해\n- 전사적인 통합 데이터 체계 확립\n  - 논리 데이터 모델링을 통하여 전사의 데이터에 대한 구조 체계화, 통합 데이터 체계를 확립\n  - 응용 시스템 위주의 데이터 관리 → 데이터 중복 유발 → 데이터 불일치 초래\n- 데이터의 일관성 및 정확성 유지를 위한 규칙 도출\n  - 데이터에 대한 정확한 업무 규칙과 데이터 처리 규칙들을 생성 관리해야 함.\n- 안정적인 데이터베이스 설계의 토대 마련\n- 사용자와의 명확한 의사소통을 위한 수단으로 활용\n  - 시스템 설계자, 업무 담당자, 응용 프로그램 개발자 간의 의사소통의 수단으로 사용"
      },
      {
       "no": 2,
       "title": "논리 데이터 모델링 절차",
       "body": "- 현업 사용자의 업무에서 필요로 하는 요구 사항에 따라 데이터 관점에서 요구 사항을 이해하고 정리하여 이해 관계자(현업 사용자, 응용 운영자, 응용 설계자, 응용 개발자)들에게 데이터에 존재하는 업무 사실을 정확하게 알려 주기 위하여 문서화하는 전 과정\n[[img:IV-24]]\n  - 주제 영역 정의\n    - 주제 영역 : 조직이 사용하는 데이터의 최상위 집합\n    - 하향식(Top Down) 분석, 계층적 표현\n  - 엔터티 정의\n  - 관계 정의 : 특수 관계(배타적 관계, 자기참조적 관계)\n  - 속성 정의\n  - 식별자 확정\n  - 정규화 : 데이터 이상 현상 제거\n  - {r}이력 관리{/r} : {r}OLAP(On-Line Analytical Processing) 환경에서는 시간의 이력(History) 관점에서 데이터 분석 중요{/r}"
      }
     ]
    },
    {
     "no": 2,
     "title": "주제 영역 정의",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "주제 영역 개념",
       "body": "- 주제 영역(Subject Area)\n  - 주요자원, 상품, 활동을 중심으로 조직이 관심을 가지는 영역, ‘~분야’\n  - 조직이 사용하는 데이터의 최상위 집합 (예 - 제조 업체의 경우 인사, 생산, 자재, 판매 등의 주제 영역)\n- 하나의 주제 영역 내에 정의되는 엔터티 간의 관계는 밀접하고,\n  다른 주제 영역에 포함되는 엔터티 간의 상호작용은 최소화할 수 있도록 정의\n- 계획 수립 단계는 하향식 분석을 원칙으로 하고, 검증을 위해서 부분적으로 상향식 분석을 사용\n- 데이터를 하향식으로 분석하기 위한 개념으로 유용한 것이 주제 영역\n- 주제 영역은 계층적으로 표현 가능, 주제 영역을 분해하면 하위 수준의 주제 영역이나 엔터티가 나타남.\n- Divide and Conquer(분할 후 정복)\n  - 전체 업무를 점차적으로 세분화해 나가면서 정해진 규칙을 이용하여 모델링\n  - 분해(Decomposition) : 세분화 과정"
      },
      {
       "no": 2,
       "title": "주제 영역 도출",
       "body": "#### 가. 주제 영역 발견 기법\n- 가치사슬(Value Chain) 분석 기법 사용\n  - 부가가치 창출에 직접 또는 간접적으로 관련된 일련의 활동, 기능, 프로세스의 연계\n  - 프로젝트 초기 단계 : 조직이 무슨 일을 하는지를 업무 활동과 연계해서 파악\n  - 프로젝트 분석 단계 : 주제 영역 단위별로 데이터를 깊이 있게 분석\n  - 보조(Supoort) 활동, 본원(Primary) 활동\n[[img:IV-25]]\n#### 나. 주제 영역 도출 방안\n##### 1) 업무 기능의 이름으로부터 도출\n  - 최상위 업무 활동에서 한두 단계를 내려가면서 기능을 분석하고 이에 대응하는 데이터 영역을 정의\n  - 업무 활동과 데이터의 상호보완관계를 유지하며 조직의 업무 파악 (cf- 업무 활동 : what)\n##### 2) 업무에서 사용하는 데이터의 명사형 도출 (예 – 구매부, 인사부, 생산부, 인사 시스템, 고객 시스템)\n##### 3) 하향식 접근 방법(Divide and Conquer)\n- 최상위 주제영역 → 단위 주제 영역 → 엔터티\n##### 4) 상향식 접근 방법\n  - 업무영역 분석 단계에서 엔터티를 도출하면서 각각의 엔터티가 지금의 주제영역에 맞는지 확인하면서 도출하거나, 어떤 엔터티들을 모아서 하나의 다른 주제 영역으로 정의할 때\n#### 다. 주제 영역 명명\n##### 1) {r}업무에서 사용하는 용어{/r}를 부여한다. (예 – 인사 분야, 생산 분야, 판매 분야 등)\n##### 2) 유일한 {r}단수형 명사{/r}를 사용한다.\n##### 3) {r}**{u}데이터의 그룹을 의미하는 이름{/u}**{/r}을 부여한다. (업무 활동을 의미하는 이름은 배제한다.)\n  - 재무관리(기능), 재무시스템 ⇒ 재무 분야(데이터)\n  - 인사관리(기능), 인사시스템 ⇒ 인사 분야(데이터)\n[[img:IV-26]]"
      },
      {
       "no": 3,
       "title": "주제 영역 활용",
       "body": "#### 가. 목적\n- 업무 분석의 효율을 높인다.\n  - 데이터의 계층적 구조 파악에 도움\n  - 점진적인 상세화로 상위 수준에서 모델의 안정성 유지\n- 업무 기능(Function)과 병행하여 분석하는 경우에 모델의 품질 확보에 기여한다.\n- 주제 영역 계층과 업무 기능 계층 간의 대응 관계를 확인한다.\n- 주제 영역은 기업의 전사 업무를 위한 전체 데이터 구성에 대한 청사진을 제공한다.\n- 데이터 구성 및 통합에 대한 방향 제시(선언적 성격)\n- 효율적 데이터 관리를 위한 기준을 제공한다.\n#### 나. 장점\n- 데이터 및 업무 활동 모델의 품질 보증(Quality Assurance)\n- 프로젝트 관리(Project Management) : 업무 범위에 대한 기준 확보\n- 분할 후 정복(Divide and Conquer)으로 집중화한 토의 가능\n- 모델 개발 조정(Development Coordination) 용이\n- 저장소(Repository) 관리 용이\n- 상세 사항의 전개 혹은 축약 가능"
      },
      {
       "no": 4,
       "title": "주제 영역 정의 내용",
       "body": "#### 가. 주제 영역 목록\n- 레벨 : 주제 영역의 계층 수준(1차, 2차, ... 단위)\n- 주제 영역명\n- 설명(단위 주제 영역의 경우)\n- 대표 엔터티 : 해당 주제 영역 내에서 대표적인 엔터티를 기술한다.\n#### 나. 주제 영역 정의서 샘플 양식\n[[img:IV-27]]"
      },
      {
       "no": 5,
       "title": "주제 영역 사례",
       "body": "[[img:IV-28]]\n[[img:IV-29]]\n- 프로젝트 초기 주제 영역 도출 시 업무 활동 분석을 통하여 주제 영역을 정의하는 것이 유리\n  - 프로젝트 초기 단계 : 업무 활동(기능) 중심으로 업무 파악\n  - 프로젝트 분석 단계 : 단위 주제 영역 내 ERD 작성(데이터 주도(driven)의 업무 파악 진행)"
      }
     ]
    },
    {
     "no": 3,
     "title": "엔터티 정의",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "엔터티 개념",
       "body": "- 조직에서 업무를 수행하는데 필요한 사물(Thing), 사건(Event) 또는 개념(Concept)을 나타내는 어떤 것\n- ➊ {u}동일한 업무 행위{/u}나 ➋ {u}유사한 속성을 갖는 단일 개념{/u}으로 정의한 인스턴스(Instance)들의 집합체\n- 정보가 관리되는 어떤 구별 가능한 사람, 장소, 사물, 사건 또는 개념\n- 정보가 저장되는 실질적 또는 추상적인 어떤 사람 또는 사물\n- 다른 것과 구별되어 식별될 수 있는 사물\n- 향후 참조를 위해 저장되어야 할 데이터를 표현한 어떤 것\n- 구별 가능한 객체\n[[img:IV-30]]"
      },
      {
       "no": 2,
       "title": "엔터티 분류",
       "body": "#### 가. 일반적인 엔터티 분류\n- **유형(Tangible) 엔터티** : 물리적으로 존재하는 대상(고객, 상품 등)\n- **활동(Active) 엔터티** : 어떤 사건에 관한 정보(주문, 계약, 장비 고장 등)\n- **개념(Concept) 엔터티** : 관리할 정보가 있는 무형의 개념(계정과목, 성적 등)\n#### 나. 모델 관점 엔터티 분류\n- **독립 엔터티(Independent Entity)** : 인스턴스 식별에 있어서 어떤 다른 인스턴스에 의존하지 않는 엔터티\n- **종속 엔터티(Dependent Entity)** : 인스턴스 식별에 있어서 하나 또는 하나 이상의 다른 인스턴스에 의존하는 엔터티\n  - {r}**특성(Characteristic) 엔터티**{/r} {r}:{/r}\n    - {r}하나의 인스턴스에 여러 번 발생하는 속성의 그룹으로, 다른 인스턴스에 의하여 직접적으로 인식되지 않는 엔터티{/r}(예 – 사원경력)\n    - 한 개의 식별 부모만을 갖는다. (고객주소)\n  - {r}**연관(Associative) 엔터티**{/r}\n    - 두 개 이상의 연관된 다른 엔터티로부터 식별자를 상속받는 엔터티(다대다 관계 해소 시 생성)\n    - 두 개 이상의 식별 엔터티를 가짐\n  - **서브타입(Subtype) 엔터티** : 다른 부분집합과 구별되는 공통 속성이나 관계를 공유하는 엔터티의 부분집합\n- 모델 관점 엔터티 분류 : [그림 IV-2-9] ER-Win 표현 방식(CASE*Method 표기법에는 없음)\n[[img:IV-31]]\n- 고객, 상품, 주문 인스턴스 : 독립 엔터티\n- 고객주소, 주문상품, 개인고객, 법인고객 : 종속 엔터티\n#### 다. 발생 시점 엔터티 분류 (DA# 모델링 툴에서 사용하는 분류 방법)\n##### 1) 키 엔터티(Key Entity)\n  - 업무 행위의 주체나 목적어가 되는 엔터티\n  - 자신의 부모를 가지지 않는 엔터티\n- 예) 사원, 부서, 고객, 상품, 자재\n##### 2) 메인 엔터티(Main Entity)\n  - 키 엔터티가 행위를 함으로써 발생되는 행위의 집합 중에서 좀 더 하위의 행위를 발생시키는 주체나 목적어가 될 수 있는 엔터티\n  - **부모 엔터티를 가지고 있어야만 생성 가능**\n  - 전체를 단계적으로 파악하고자 하는 의도\n    - 키 엔터티를 제외한 엔터티 중에서 업무의 중심에 해당하는 엔터티 → 메인 엔터티\n    - 나머지 → 액션 엔터티\n  - 예)\n    - 보험계약, 사고, 예금원장, 청구 …\n    - 구매의뢰, 출하지시, 공사 …\n    - 주문, 예산편성, 매출 …\n##### 3) 액션 엔터티(Action Entity)\n  - **부모 엔터티를 가지고 있어야만 생성 가능**\n  - 키 엔터티와 메인 엔터티가 아닌 것은 모두 액션 엔터티\n  - 상위 엔터티들이 어떻게 결정되느냐에 따라서 크게 영향 \n    → 업무의 본질은 살아 있지만 최초에 예상했거나 과거에 정의했던 의미상의 주어가 크게 달라질 수 있음.\n- 예) 상태 이력, 차량 수리 내역, 상세 주문 내역, ···"
      },
      {
       "no": 3,
       "title": "엔터티 도출",
       "body": "[[img:IV-32]]\n- 엔터티 도출 방법\n  - 현행 DBMS 有, 현행 논리 데이터 모델 無 → 역공학(Reverse Engineering)으로 테이블/엔터티 추출\n  - 각종 서식, 보고서로부터 도출\n  - 사용자 인터뷰, 정보 요구 사항을 정리하여 도출\n  - 정보 전략 계획(ISP, Information Strategy Planning), 전사아키텍처 계획(EAP, Enterprise Architecture Planning)으로부터 생성된 자료를 통하여 도출\n  - 업무 수행 프로세스로부터 도출\n  - 엔터티 분류 기법을 활용하여 도출\n#### 가. 현행 데이터베이스로부터 도출\n- 현행 데이터베이스를 정밀하게 분석해야 하는 이유\n  - 현행 데이터베이스가 조직의 정보 요구 사항을 빠짐없이 정확하게 지원하고 있는지 확인하기 위해\n  - 현행 데이터베이스의 구조적인 문제점 및 해결 방안을 도출하기 위해\n  - 목표 정보 요구 사항을 지원하기 위하여 논리 데이터 모델을 어떻게 생성할지를 결정하기 위해\n  - 목표 데이터베이스로의 데이터 이행이 필요한 경우, 원천 데이터를 정확히 파악하기 위해\n[[img:IV-33]]\n- 차세대 정보시스템 구축 단계\n  - 현행 시스템이 존재하지 않는 경우 : 계획 → 분석 → 설계 →개발 → 테스트 → 운영\n  - 현행 시스템이 존재하는 경우 : 계획 → 분석 → 설계 →개발 → 테스트 → **{u}이전(Transition, 데이터 이행 및 시스템 이전){/u}** → 운영\n    - 데이터 이행 단계 : 이행 전략 수립, 이행 대상/범위 결정, 이행 매핑 정의, 이행 프로그램 개발, 이행 데이터 검증/정제, 이행 테스트, 운영 환경 데이터 이행\n  - 차세대 구축 단계와 데이터 이행 단계를 잘 혼합한 일정 수립 중요\n    - 데이터 이행 담당 영역에서는 개발자들이 프로그램 개발이 끝나기 전에 기준정보(예, 부서, 사원, 고객, 상품 등)부터 데이터를 이행하여 대용량의 질 좋은 현행 데이터를 활용하여 단위 테스트를 잘할 수 있도록 해야 함.\n    - 프로그램 개발 단계부터 목표 시스템의 개별 테이블에 대한 데이터 이행이 이루어져야 함\n    - 프로그램 개발 단계에 이행 데이터에 대한 테이블별 검증 및 정제도 함께 이루어져야 함.\n    - 종합 테스트 단계에서는 데이터 이행 리허설을 N차에 걸쳐 수행\n- 데이터 거버넌스(Governance, 통제 관리) 체계가 없는 환경(현행 데이터 모델이 없는 경우)\n  - 데이터 모델링 도구를 사용하여 **{u}역공학(Reverse Engineering){/u}**으로 DBMS에 접근하여 Dictionary로부터 정보를 읽어서 데이터 모델 생성\n#### 나. 정보 요구 분석\n- 정보 요구 : 부서(조직)가 주어진 목적을 달성하고 기능을 수행하기 위해서 필요로 하는 정보\n- 정보 요구 목록에서 데이터와 관련된 내용을 식별하고, 데이터 관련 내용이 논리 데이터 모델에 어떻게 반영되었는가를 프로젝트 관계자(현업, 분석가, 설계자, 개발자 등)에게 논리 데이터 모델과 함께 설명할 수 있는 자료 생성\n\n‖ **범주** | **관심 분야** | **사용자** | **특성** |\n| **전략**¶**(Strategy)** | 변환¶(업종, 고객, 상품 등) | 경영층 | 장기적 관점¶전사 관점¶외부 정보 활용¶동적 정보/판단 정보 |\n| **기획**¶**(Planning)** | 조정 및 추진 | 부서장¶기획부서 | 중단기 관점(3, 6개월)¶주요 기능 관점¶연계된 데이터 활용¶의사결정 정보 |\n| **통제**¶**(Control)** | 업무 감독¶(규정대로 수행 여부) | 하급관리자¶(과장, 대리) | 단기 관점(일, 주간)¶프로세스 관점¶실적 데이터¶정규보고 정보 |\n| **운영**¶**(Operation)** | 작업 | 실무자 | 즉시 관점¶업무 수행 관점¶실제 거래 데이터¶거래정보 |\n\n#### 다. 업무에서 사용하는 문서로부터 도출 : 현업에서 사용하고 있는 실 데이터 값이 보이는 문서\n#### 라. 사용자 인터뷰로부터 도출\n#### 마. 아키텍처 모델로부터 도출\n- 정보 전략 계획(ISP, Information Strategy Planning), 전사아키텍처 계획(EAP, Enterprise Architecture Planning)으로부터 생성된 전사 개념 데이터 모델을 이용하여 엔터티 도출\n#### 바. 업무를 수행하는 프로세스로부터 도출\n- 업무 프로세스 : 잘 정의된 목적을 달성하기 위하여 업무 입력요소를 받아 업무 산출요소로 변환시키는 일련의 작업 활동들의 집합\n- 프로세스는 How가 아니라 그 조직에서 무슨 일을 한다는 What(무엇)\n#### 사. 엔터티 분류 기법을 활용하여 도출\n- 엔터티 도출이 어려운 이유 : 데이터 모델링 전문가는 그 조직의 업무 행위나 유사한 속성들을 이해하기 어렵다.\n  - 논리 데이터 모델링 실전을 경험할 수 있는 기회가 별로 없음.\n  - 논리 데이터 모델링 대상이 되는 업무에 대한 경험/이해도 부족\n  - 논리 데이터 모델 이해 관계자의 집합이론과 1차 술어 논리에 근거한 관계형 모델 이론의 이해 부족"
      },
      {
       "no": 4,
       "title": "엔터티 검증",
       "body": "#### 가. 조직의 업무를 수행하는 데 필요한 의미 있는 정보를 나타내야 한다.\n[[img:IV-34]]\n#### 나. 특정 사례가 아닌 유사한 사물들을 대표하는 집합체\n- 엔터티(Entity)란 업무와 관련된 현실 세계 모든 인스턴스(Instance)들의 집합이다.\n  업무 내용 : “구매부서에서 공급처에 자재에 대한 주문을 수행하고”\n\n‖ **엔터티** | **구매부서** | **공급처** | **자재** | **주문** |\n| **인스턴스**¶**(특정사례)** | 부서번호 : 부서명¶100 : 구매부¶... : ... | 고객번호 : 고객명¶1001 : 영림¶2001 : 대한¶3001 : 고려¶... : ... | 자재코드 : 자재명¶A100 : 구리¶B200 : 아연¶A300 : 철¶... : ... | 주문번호 : 주문일자¶9900001 : 990802¶9900002 : 990915¶9900003 : 991011¶... : ... |\n\n⇒ ‘구매부서’를 엔터티로 정의하는 것은 적합하지 않음. (‘구매부’라는 단일 사례만을 갖고 있음.)\n‘구매부서‘는 부서 엔터티의 하나의 인스턴스로 보는 것이 더 타당\n#### 다. 인스턴스가 포함할 내부 연관성 있는 속성에 의해 결정된 단일 개념을 대표해야 한다.\n- 일반화(추상화) 수준이 높은 데이터 모델 : 각각의 조직에서 원하는 많은 정보 요구를 수용하자면 매우 유연한 데이터 모델을 필요로 함.\n  - SAP R/3(전사자원 관리 솔루션), SIEBEL(고객관리 솔루션) - Party 개념의 모델 사용\n  - 프로젝트 초기 단계 조직 전체의 업무에 대한 개념 데이터 모델 생성 시\n- 추상화 수준이 높은 데이터 모델\n  - {r}유연성이 있지만, 업무를 이해하기 어려움{/r}\n  - 데이터 관리 쉽지 않음\n  - 데이터 무결성 보장 어려움\n- 가급적 Party 같은 추상화 수준이 높은 데이터 모델 사용 지양\n[[img:IV-35]]\n[[img:IV-36]]\n- [그림 IV-2-14] Party(추상화 수준이 높은 데이터 모델)라는 엔터티의 정의 적합한가?\n- [그림 IV-2-15] ‘사원’, ‘고객’을 일반화 기법을 적용하여 하나의 엔터티로 통합하는 것이 적절한가?\n#### 라. 엔터티 내 인스턴스의 출현을 구별할 수 있는 능력을 제공해야 한다.\n- 인스턴스를 구별할 수 있는 능력을 제공해야 한다. (엔터티 무결성)\n- 식별자를 구성하는\n  - ➊ 일련의 속성 값이 반드시 있어야 하고,\n  - ➋ 이 값들이 유일해야 하며,\n  - ➌ 이 일련의 속성이 최소한의 개수로 이루어져야 함.\n#### 마. 정규화 규칙을 만족해야 한다."
      },
      {
       "no": 5,
       "title": "엔터티 정의 사항",
       "body": "‖ **엔터티 정의 사항** | << |\n| **엔터티명** | 명명 규칙을 준수해야 한다.¶포함하는 모든 속성을 정확히 표현하는 엔터티 명을 부여한다. |\n| **엔터티 설명** | 엔터티가 무엇인지를 표현해야 한다.¶엔터티가 업무에서 왜 중요한가를 설명해야 한다. |\n| **엔터티 분류** | 방법론 종속적으로 반드시 해야 하는 것은 아니다.¶업무를 파악하는 데 좋은 분류 기준을 수립하는 것이 중요하다. |\n| **현재 발생 건수** | 설계 및 구축 단계를 위하여 현재 발생 건수를 파악한다. |\n| **발생 건수 변화** | 설계 및 구축 단계를 위하여 예상되는 변화율을 파악한다. |\n| **권한** | 엔터티를 생성/수정/삭제하는 메타 데이터 권한을 정의한다.¶엔터티의 데이터를 생성/수정/삭제하는 권한을 정의한다. |\n| **식별자 속성** | 엔터티 내 하나의 인스턴스를 식별할 수 있는 속성을 표현한다. |\n| **외래 식별자 속성** | 다른 엔터티로부터 참조되는 식별자 속성을 표현한다. |\n| **식별자 이외 속성** | 정규화 규칙에 따라 식별자에 종속되는 속성을 표현한다. |\n\n#### 가. 엔터티명\n- 지켜야할 명명 규칙(naming rule)\n  - 1) 엔터티 명은 현실 세계의 인스턴스 및 정보를 대표하도록 한다.\n    - 의사소통을 위한 의미 있고, 업무 개념을 명확하게 반영할 수  있는 이름\n    - 현업에서 사용하는 용어 이용\n  - 2) 엔터티 명 자체로 의미를 표현하도록 한다. (직관적으로 이해할 수 있는 명칭 사용)\n  - 3) 물리적인 사항을 개념화한 논리적 사물을 반영하도록 한다. \n       (물리적인 표현을 피하고, 논리적인 표현을 사용하여 엔터티 고유의 특성을 나타낼 수 있도록)\n  - 4) 최소한의 어휘를 사용하여 의미를 전달할 수 있도록 한다.\n- 지키지 말아야 할 명명 규칙\n  - 1) 데이터 관리자의 승인을 받지 않은 약어 또는 두문자어(Acronym)\n    - (약어, 두문자어의) 잘못된 사용 → 업무 이해 저해, 업무에 대한 잘못된 해석 야기\n    - 예) ‘규손금’ ← ‘규정 손해금’, ‘납방’ ← ‘납입방법’, ‘납주’ ←‘납입주기’\n  - 2) 테이블, 파일, 메뉴, 보고서, 입력화면 같은 정보시스템 구성요소\n  - 3) 두 가지 이상의 개념을 동시에 사용하는 표현\n#### 나. 엔터티 설명\n- 엔터티 그 자체가 무엇(what)이며 업무에서 왜(why) 중요한가와 엔터티의 범위(scope) 기술\n- 업무에서 일반적으로 사용하고 있는 용어를 이용하여 기술\n- 엔터티에 속하는 인스턴스들이 무엇인지(범위), 어떻게 다른 인스턴스들과 구별되는지 설명\n#### 다. 엔터티 분류\n#### 라. 현재 발생 건수 : DB 설계자/운영자 지원, 데이터 이행(저장공간 사용계획 수립) 지원 목적\n#### 마. 발생 건수 변화\n#### 바. 권한\n- 엔터티, 속성, 관계, 기타 모델 구성요소를 생성/변경 권한\n- 엔터티의 데이터 입력, 수정, 삭제, 조회 권한\n#### 사. 식별자 속성\n#### 아. 외래 식별자 속성\n#### 자. 식별자 이외 속성"
      },
      {
       "no": 6,
       "title": "엔터티 일반화",
       "body": "#### 가. 일반화 정의\n- 일반화(Generalization) : 현실 세계의 사물, 사건을 단순화하여 표현하는 추상화 기법 중 하나로 엔터티의 부분집합을 정의하는 것\n  - 슈퍼타입 엔터티 : 일반화 계층의 가장 상위에 있는 엔터티\n  - 서브타입 엔터티 : 공통의 속성이나 관계를 공유하는 인스턴스들의 부분집합\n[[img:IV-37]]\n#### 나. 일반화 특성\n- 일반화 특성\n  - 슈퍼타입은 두 개 이상의 독립적인 서브타입으로 구성된다.\n  - 슈퍼타입은 각 서브타입들의 공통적인 속성과 관계를 가진다.\n  - 서브타입은 자신의 속성이나 독립적인 관계를 가진다.\n  - 자신의 속성이나 관계를 가지지 않는 서브타입도 존재 가능 → 일반적인 속성으로 처리\n[[img:IV-38]]\n- 직위코드 → 서브타입으로 표현\n- (왼쪽) ER-Win에서의 정보공학 표기법 : 거의 사용 안함\n- (오른쪽) CASE*Method  표기법 : 많이 사용하는 방식\n- CASE*Method 방법론의 일반화 특징\n[[img:IV-39]]\n  - 슈퍼타입과 서브타입은 결코 부모 : 자식 관계가 아니다.\n  - 슈퍼타입의 인스턴스는 서브타입 중 단 하나와 반드시 연결되어야 한다.\n  - 서브타입은 서로 중첩되지 않아야 하며 그 전체집합은 슈퍼타입과 1:1이다.\n  - 전체집합에 확신이 없다면 ‘기타’ 구분을 생성한다.\n  - 슈퍼타입 A = 서브타입 B ∪ 서브타입 C\n  - 서브타입 B ∩ 서브타입  C = Ø(공집합)\n- 배타적(Exclusive) / 포함적(Inclusive) 일반화\n[[img:IV-40]]\n  - {r}배타적(Exclusive) 표기법{/r}\n    - 슈퍼타입 사원 = 서브타입 계약직 ∪ 서브타입 정규직\n  - {r}포함적(Inclusive) 표기법{/r}\n    - 슈퍼타입 연예인 = 서브타입 탤런트 ∪ 서브타입 가수 ∪ 서브타입 영화배우 (X)\n    - (정보공학 표기법) {r}슈퍼타입 인스턴스 하나가 서브타입 인스턴스 여러 개로 될 수 있음{/r}\n    - (CASE*Method 표기법) {r}포함적 일반화 표현 불가능{/r} → DA# 모델링 툴에서는 지원\n#### 다. 일반화 시점\n- 인스턴스가 공통적인 속성 집합(common set of attributes)을 가지고 있을 때 – 속성의 명확화\n[[img:IV-41]]\n- 인스턴스가 공통적인 관계 집합(common set of relationship)을 가지고 있을 때 – 관계의 명확화\n  ※ 사채 인스턴스들만 공채 평가를 수행함.\n[[img:IV-42]]\n- 인스턴스가 공통적인 관계 집합(common set of relationship)을 가지고 있을 때 – 관계의 명확화(양쪽 선택 관계)\n[[img:IV-43]]\n법인 - 고객 : 1대다 **양쪽 선택,** 비식별 관계\n개인고객은 법인번호가 필요 없음 → 양쪽 선택 관계\n고객이 법인인 경우 → 반드시 법인번호를 가져야함\n#### 라. 일반화 장단점\n- 데이터의 통합적 관리 가능\n  - 데이터 관리 노력/프로그램 수효 감소 효과\n  - 데이터의 복잡성 증가, 데이터 무결성 약화 가능\n\n‖ **구분** | **일반화(Generalization)** | **상세화(Specialization)** |\n| **장점** | 데이터가 통합되어 있어 조회가 간편¶한 개의 프로그램으로 업무 처리 가능¶동일한 종류의 업무 추가 시 최소한의 변경으로 지원 가능¶전체적인 업무 로직 변화의 경우 신속하게 반영 가능 | 업무에 대한 명확한 파악 가능¶데이터의 추가/변경이 자유로움¶특화된 업무에 대한 속성 관리나 프로그램이 용이¶장애나 에러에 대한 파급효과 작음¶데이터 구조가 명확하여 업무 파악이나 인수인계를 신속하게 수행 가능 |\n| **단점** | 공통적이지 않은 속성이 많은 경우 효과 반감¶여러 업무의 데이터가 서로 섞여 있어 내용을 정확하게 파악하기 힘듦¶{r}모든 업무를 이해하는 인원만이 데이터 관리 수행 가능{/r}¶특정 업무에만 관련된 데이터 변경이 있을 경우 타 업무에 영향 | {r}엔터티(테이블)의 수효가 늘어나서 관리의 어려움 발생{/r}¶데이터 간의 불일치 초래¶통합적인 정보 도출 어려움¶동일한 로직도 별도의 프로그램으로 개발해야 하므로 관리가 비효율적 |\n\n- ER-Win 모델링 도구 : 다중 서브타입 구현 불가능\n- DA# 모델링 도구\n\n[정리] {2013}\n- **집합의** {r}**순수성**{/r}\n  - 엔터티는 반드시 순수한 {r}본질(本質) 집합{/r}이 되어야 한다\n  - 정의하고자 하는 집합이 {r}개체(個體) 집합(사람, 상품){/r}이 되든지, 아니면 {r}행위(行爲) 집합(입금, 계약){/r}이 되든지 간에 반드시 {u}둘 중의 어느 하나가 되어야 한다{/u}\n  - 이들이 {u}서로 결합된 형태{/u}라면 그것은 {r}관계{/r}이다.\n  - 개체 집합(고객, 상품)이거나 행위 집합(입금, 계약)이어야 하며 충돌(납입자, 입금자)이 있어서는 안 된다.\n  - 집합 순수성의 예외 사례\n  - {r}릴레이션의 엔터티화 (피보험자){/r}\n  - {r}일부 집합 정의 (금융기관){/r}\n  - {r}배타적 관계 (배송처 - 고객, 공사현장, 물류센터){/r}\n- **집합의 동질성**\n  - 집합에 들어갈 개체들의 동일한 성질을 어디까지로 한정할 것인가?\n  - 예) 사원, 협력사직원, 일용직"
      }
     ]
    },
    {
     "no": 4,
     "title": "관계 정의",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "관계 개념",
       "body": "- 관계(Relationship) : 하나 또는 두 개의 엔터티(Entity)로부터 인스턴스(Instance)를 연관시키는 업무규칙\n[[img:IV-44]]\n- 부모ㆍ자식 엔터티\n  - 외래키(Foreign Key)가 있는 곳 → 자식 엔터티\n    cf) {r}업무적인 발생 순서와는 무관{/r} (결제-납품)\n[[img:IV-45]]\n- cf) 결제 – 납품 관계\n  - 업무 관점 : 납품이 먼저 발생하고 납품한 내역을 한 번에 결제하므로 결제가 나중에 발생\n  - 데이터 모델 관점 : ‘결제’ 엔터티의 주키가 ‘납품’ 엔터티에 외래 키로 나타나므로 결제가 부모, 납품이 자식\n- 관계 읽기\n- 기존의 관계 선택성 결정 방식\n  - “모든 고객은 여러 개의 주문을 할 수도 있다.” may be이면 선택\n  - “모든 주문은 반드시 하나의 고객에 의하여 된다.” must이면 필수\n- 새로운 관계를 찾고 해석하는 방식\n  **(항상 어느 엔터티에 인스턴스가 입력되는 시점에 관계가 있는 상대편의 엔터티에 인스턴스가 필요한지 필요 없는지를 근거로 관계의 선택성을 결정한다.)**\n  - **“하나의 고객 입력 시 주문은 입력 안 될 수도 있다.”면 선택**\n  - **“하나의 주문 입력 시 고객은 반드시 입력되어 있어야 한다.”면 필수**\n[[img:IV-46]]"
      },
      {
       "no": 2,
       "title": "관계 도출",
       "body": "[[img:IV-47]]\n- 일대일 한쪽 필수, 한쪽 선택\n  - 업무영역 엔터티 인스턴스 : ‘인사’, ‘급여’, ‘구매, ’생산‘\n  - DB 엔터티 인스턴스 : ’인사DB’, ‘급여DB’, ‘구매DB’, ‘생산DB’\n- 일대다\n  - 업무영역 엔터티 인스턴스 : ‘인사’\n  - DB 엔터티 인스턴스 : ‘Orcle’, ‘Sybase’, ;SQL Server’ 하나 이상의 DB에 존재\n  - **⇒** ‘업무영역’과 ‘DB’ 엔터티를 그 조직에서 **{u}어떻게 정의하느냐에 따라 관계 정의가 달라질 수 있음.{/u}**\n- 관계 유형\n  - 존재 관계(Existence Relationship) : “부서에는 사원이 근무한다.”\n  - 기능 관계(Function Relationship) : “교수는 학생을 가르친다.”\n  - 사건 관계(Event Relationship) : 고객은 상품을 주문한다.“\n- 엔터티ㆍ관계ㆍ속성의 사례 데이터(인스턴스)를 통해 업무를 확인하면서 논리 데이터 모델링 진행이 중요\n- 발생 가능한 관계 형태\n[[img:IV-48]]\n[[img:IV-49]]\n- 다대다 관계 : Cartesian Product (다대다의 곱집합) 발생 → 연관 엔터티를 사용하여 일대다의 관계로 표현"
      },
      {
       "no": 3,
       "title": "관계 정의 사항",
       "body": "‖ **항목** | **정의 사항** |\n| **관계명** | 명명 규칙을 준수하였는가?¶두 엔터티간의 업무적 관계를 표현하는 ‘동사형’으로 부여하였는가? |\n| **관계요약 설명** | 관계가 왜 존재해야 하는가를 기술하고 있는가? (업무규칙, 정규화, ...) |\n| **외래 키** | 외래 키가 부모 엔터티의 주 키(Primary Key)와 일치하는가?¶외래 키 항목이 주 키와 주 키가 아닌 속성에 펼쳐져 있는가? |\n| **관계 유형** | IDEF1X : Identifying/Non Identifying/Category |\n| **기수성, 선택성** | 업무 규칙에 근거하여 기수성, 선택성을 정의하였는가? |\n| **참조무결성** | 업무 규치에 근거하여 참조무결성을 정의하였는가? |\n\n#### 가. 관계명\n#### 나. 외래 키 : 모든 외래 키 속성은 반드시 데이터 모델 내 주키로 선언되어 있어야 함.(참조무결성)\n#### 다. 관계 유형 : IDEF1X(식별, 비식별)\n#### 라. 기수성, 선택성\n#### 라. 참조무결성 : 데이터의 정확성/일관성을 보장하는 입력/수정/삭제 규칙"
      },
      {
       "no": 4,
       "title": "특수 관계",
       "body": "#### 가. 자기 참조 관계\n- 계층 구조 모델\n[[img:IV-50]]\n  - 조직 변경 경우 대응이 어려움 → 계층 구조 순환 전개 모델 표현이 더 적합\n- 예) 회계업무의 계정과목, 조직,\n[[img:IV-51]]\n\n| 계층 구조 변경에 매우 취약¶사용이 쉽고 간편, 수행 속도에 상대적으로 유리¶계층 구조 변경 시 과거 데이터의 수정 필요¶계층 구조이면서 변동이 거의 없는 업무에 적용¶(예 – 회계업무의 계정과목) | 계층 구조 변경에 매우 유연¶사용이 약간 불편, 잘못 사용 시 수행 속도 저하¶계층 구조 변경 시 과거 데이터의 수정 없음.¶계층 구조이면서 변동이 발생하는 업무에 적용¶(예 – 조직) |\n\n[[img:IV-52]]\n#### 나. 다대다 (N:N) 관계\n- Cartesian Product(다대다의 곱집합) 발생, 정보의 왜곡 → 연결(Associative) 엔터티로 다대다 관계 해소\n[[img:IV-53]]\n#### 다. 배타적 관계\n- 어떤 엔터티의 행이 두 개 이상의 엔터티의 행과 관계를 맺는데 있어서 어느 시점에 반드시 하나의 엔터티의 행과 관계를 맺는 형태\n\n| 공정 | << |\n| 공정번호 | 공정명 |\n| 1-1000 | 가 부품조립 |\n| 1-2000 | 나 부품조립 |\n| 1-3000 | 다 부품조립 |\n\n| 창고 | << |\n| 창고코드 | 창고명 |\n| 100 | 제1창고 |\n| 200 | 제2창고 |\n| 300 | 제3창고 |\n\n| 외주가공처 | << |\n| 외주가공처ID | 외주가공처명 |\n| 10000 | ㈜한국 |\n| 20000 | ㈜대한 |\n| 30000 | ㈜민국 |\n\n| 출고 | << | << | << | << |\n| 출고일자 | 출고번호 | 공정번호(FK) | 창고코드(FK) | 외주가공처ID(FK) |\n| 200105017 | 10001 | 1-1000 | Null | Null |\n| 200207121 | 10005 | Null | 200 | Null |\n| 200301077 | 10007 | Null | Null | 2000 |\n\n[그림 IV-2-33] 배타적 관계 – 인스턴스 차트\n- ※ ‘출고’의 특정 한 행은 다른 엔터티와 모두 관계가 있는 것이 아니라, 특정 하나의 엔터티의 한 행과만 관계를 맺는다\n- ※ CASE*METHOD 표기법으로 표현 가능(ER-Win의 ID 표기법으로 표현 불가능)\n\n[[img:IV-54]]\n- 배타적 관계의 특성\n  - 배타적 관계는 동일하다.\n  - 배타적 관계는 항상 필수(Mandatory)이거나 선택(Optional)이어야 한다.\n  - 배타적 관계는 반드시 하나의 인스턴스에만 속해야 한다.\n  - 어떤 엔터티는 다수의 배타적 관계를 가질 수 있다.\n    (지정된 관계는 단 하나의 배타적 관계에만 사용되어야 한다.)\n[[img:IV-55]]\n\n‖ **Number of Valid Relationships in Arc Per Entity Instance** | << | **유효한 관계 수** | << |\n| ^^ | ^^ | **Minimum** | **Maximum** |\n|  | **두 개의 관계가 필수(Mandatory)** | **n** | **n** |\n|  | **두 개의 관계가 필수(Mandatory)**¶**Arc 관계(배타적)** | **1** | **1** |\n|  | **두 개의 관계가 선택(Optional)** | **0** | **n** |\n|  | **두 개의 관계가 선택(Optional)**¶**Arc 관계(배타적)** | **0** | **1** |\n\n[[img:IV-56]]\n[[img:IV-57]]\n[[img:IV-58]]\n[[img:IV-59]]\n[그림 IV-2-36] 배타적 관계 vs 일반 관계 참여 수\n※ 2번째, 4번째 배타적 관계를 표현할 수 있는 모델링 도구 없음 → 최소 참여수를 **텍스트로 기록 필요**"
      }
     ]
    },
    {
     "no": 5,
     "title": "속성 정의",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "속성 개념",
       "body": "- 속성(Attribute) : 엔터티에 속하는 모든 인스턴스들이 공통으로 가지는 특성 (데이터베이스 내에 저장되는 최소단위의 정보)"
      },
      {
       "no": 2,
       "title": "속성 도출",
       "body": "#### 가. 현행 시스템 자료 : 설계 자료, 사용자 지침서 등\n#### 나. 현업 장표ㆍ보고서\n#### 다. 사용자와 협의\n#### 라. 데이터 흐름도의 데이터 저장소 : 데이터 저장소(Data Store), 데이터 사전(Data Dictionary)\n#### 마. 전문 서적 및 자료\n#### 바. 다른 시스템 자료"
      },
      {
       "no": 3,
       "title": "속성 정의 사항",
       "body": "- 속성 상세 정보의 중요성\n  - 속성 상세 정보 정의는 업무 관련 데이터의 본질/목적 이해에 도움\n  - 속성 수준의 무결성 설정/강화에 도움\n  - 데이터 무결성을 개선하여 데이터 품질 향상\n  - 데이터 사전(Data Dictionary) 구성\n\n‖ **항목** | **정의 사항** |\n| **속성 명** | 명명 규칙을 준수하였는가? |\n| **속성 설명** | 속성이 왜 존재해야 하는가를 기술하고 있는가? (업무 관점 중요성) |\n| {r}**선택성**{/r} **및** {r}**선택성 조건**{/r} | 반드시 값을 가져야 하는지에 대한 여부¶{r}다른 속성 값에 의한{/r} {b}필수, 금지 여부{/b}¶{2013} {b}**필요조건 / 금지조건 / 무관계조건**{/b} |\n| **속성 유형** | 기본 속성, 유도 속성, 설계 속성 |\n| **유도 알고리즘** | 추출/계산 속성에 대한 알고리즘 |\n| **도메인** | 속성이 지닐 수 있는 값(일반 도메인, 특수 도메인) |\n| **허용 값 (Permitted Value)** | 허용 값을 사용하여 속성 도메인을 제한 |\n| **기본 값 (Default Value)** | 속성에 지정하는 초기 속성 값 |\n| **소유 권한** | 속성에 대한 권한을 가지는 개인, 기능 또는 조직에 대한 기록 |\n\n#### 가. 속성명\n- 조직에서 널리 쓰이는 용어(명사/명사구) 사용\n- 엔터티명 + 수식어 + 도메인명 형태(사원+입사+일자)\n  - 예1) ‘고객’의 상태코드, ‘사원’의 상태코드\n    - ‘상태코드’라는 속성만으로 고객과 사원에 각각 속성 경우\n      → 데이터 사전에 상태코드 하나로 정의 불가능(고객과 사원의 상태코드 도메인이 각각 다름)\n      → ‘고객상태코드’, ‘사원상태코드’ 형태로 속성 도출이 적합\n  - 예2) ‘최초입력일자’, ‘최종수정일자’ 속성\n    → ‘고객최초입력일자’, ‘사원최초입력일자’ 형태보다는\n    → ‘최초입력일자’ 형태의 속성명은 도메인이 같기 때문에 엔터티 명을 속성 명과 함께 표기할 필요 없음.\n- (중복을 허락하는 외래 키 속성이 아니면) **전체 데이터 모델 내에서 유일하도록 복합 명사 사용** 권장\n  - 1) 의미가 명확한 속성 명칭 부여\n  - 2) 유일한 복합명사 사용 : 보편적이고 함축성 있는 단어 사용(단순 일반 용어만으로는 구체적 의미 설명 어려움)\n  - 3) 단수형으로 속성 명 사용\n  - 4) 표준 단어 및 용어 제정\n    - 데이터 모델링 전에 표준 단어/용어 사전 미리 생성 \n      → 기준 준수 유도, 일관성 유지에 도움\n      → 표준화 준수 여부 관리, 표준 변경 대상 선정, 어떤 속성의 파생 근원 분석에 도움\n    - 속성을 칼럼으로 전환할 때 사용할 영문 약어 같이 제정 바람직\n#### 나. 속성 설명\n- 구성 요소\n  - 속성 정의 : 이 속성이 업무에서 왜 중요한지, 어떤 업무적인 이유에서 이 속성을 사용하게 되었는지 기록\n  - 선택적 속성 경우 모든 선택성 조건 기록\n#### 다. 선택성 및 선택성 조건\n- 필수 속성 : 모슨 인스턴스가 속성 값을 가져야 하는 속성\n- 선택적 속성 : 속성 값을 가지지 않을 수도 있는 속성\n  - 선택성 조건 : 속성의 선택성이 다른 속성 값에 의해 영향 받는 것\n- 예) 고객등급코드 = 일반 ⇒ ‘카드신용도’ 값 필요 (필수 속성)\n        고객등급코드 = VIP ⇒ ’카드신용도‘ 값 필요 없음. (금지 속성)\n#### 라. 속성 유형\n- 기본(Basic) 속성 : 속성 값이 해당 인스턴스에 원래 존재하여, 다른 속성 값으로부터 유도될 수 없는 속성\n- 유도(Derived) 속성 : 속성 값이 항상 다른 속성 값으로부터 유도되거나 계산되는 속성\n  - 유도 알고리즘 계산 결과 (예 - 주문 총액, 유효종료일자, 주가수익비, 내부수익률)\n  - 논리 데이터 모델 단계에서부터 유도 속성 / 유도 알고리즘 표기\n- 설계(Designed) 속성 : 업무 제약사항을 반영하거나 시스템 운영을 단순화하기 위하여 생성하는 속성\n#### 마. 유도 알고리즘(Derived Algorithm) : 속성 수준의 무결성 강화, 데이터 품질 향상\n#### 바. 도메인 : 하나의 속성에 대해 지정 가능한 값의 집합, 개개의 속성은 그 속성의 도메인에 속해야 한다.\n#### 사. 허용 값 (Permitted Value) : 속성이 취할 수 있는 모든 값들의 집합\n#### 아. 기본 값 (Default Value) : 속성에 지정하는 초기 속성 값\n#### 자. 소유 권한\n- 데이터 거버넌스 차원의 속성 정의 및 승인에 대한 권한(메타 데이터 승인 권한- 속성 자체를 생성/삭제/수정/할 수 있는 권한)을 가지는 개인, 기능 또는 조직에 대한 기록 관리\n- 데이터(속성 값)를 생성/사용 권한을 가지는 개인, 기능 또는 조직에 대한 기록 관리"
      },
      {
       "no": 4,
       "title": "속성 검증 및 확정",
       "body": "#### 가. 원자 값 단위까지 분할\n- 엔터티에 나타난 속성 값 : 논리적으로 더 이상 분해할 수 없는 단위 값(Unit Value)\n- 업무에 대한 단일 사실(Single Fact)을 나타냄. \n  (그 안에 의미가 있지만 모델 사용자들에게 숨겨져 있을지도 모르는 어떤 다른 사실들을 포함하지 않는다.)\n- 코드 또는 식별자\n  - 계좌번호(16) = 지점코드(3) + 상품코드(2) + 계좌개설일자(8) + 일련번호(3)\n  - 지점코드, 상품코드, 계좌개설일자 속성 : 중복 관리\n    → 문제점 : 분해된 속성의 값이 중복 관리 되는 속성의 값과 일치하는지 보장할 수 없음.\n- 16자리의 계좌번호만 있고 개별로 있는 지점코드/상품코드/계좌개설일자가 테이블에 없는 형태(속성이 원자 값으로 분리되지 않은 경우)의 문제점\n  - 속성은 단일 사실과 단일 개념을 나타내야 한다는 정의에 위배\n    (지점/상품/계좌개설일자의 정보가 계좌번호 속성에 은닉되어 있음.)\n  - 지점/상품의 개수 증가 시 이 자릿수만으로 부족할 수 있음.\n  - 계좌번호만 보고는 업무적으로 계좌번호가 구성된 업무 규칙을 못 보여주며, 모델의 다른 요소들에 대한 여러 가지 종속성(지점, 상품, 고객과의 관계)을 모호하게 함.\n  - {r}원자 값이 아닌 속성은 접근경로(Access path)를 잃어 버림.{/r}\n  - **⇒** {r}**원자 속성(atomic attribute)은 단순 정의역(Simple Domain)을 가짐**{/r}\n  - **⇒** {r}**속성에 의해 표현되는 단일 업무 사실은 단순 정의역에 의해 지원되어야 함**{/r}\n- 원자 값 속성 사례 분석\n  - 1) 일자 형태의 속성 : 매출일자, 생년월일\n    - 매출일자(DDMMYYYY) :\n      하나로 결합했을 때만 매출이 발생한 일자라는 의미 → 통합된 하나의 속성으로 간주\n    - 생년월일(DDMMYYYY) : \n      특정 월일(DDMM) 캠페인 같은 경우 유의미 → 연도(YYYY), 월일(DDMM) 속성 분리\n  - 2) 외부에서 만들어진 공인된 속성 : 우편번호 유형\n    - 우편번호, 주민등록번호, 사업자등록번호, 법인번호, 여권번호\n    - 조직 외부에서 만들어졌기 때문에 외부에서 정해진 형태 그대로 사용하는 것이 바람직\n      (예 – 우편번호 체계가 변경되는 경우 부분 사용은 문제 발생)\n  - 3) 전화번호 유형 : 전화번호, 팩스번호\n    - 지역번호 + 국번호 + 개별번호\n    - {r}속성의 분리가 맞느냐 합치는 것이 맞느냐는 그 속성을 사용하는 조직의 업무에 따라 다름{/r}\n    - 일반적인 회사의 경우 전화번호를 분리해서 사용하는 경우 거의 없음. (통신사 vs 일반회사)\n#### 나. 하나의 값만을 가지는지 검증\n- 엔터티에 들어가는 인스턴스마다 반드시 하나의 값(Single Value)만 보유하고 있어야 한다.\n- 단일 값 속성 사례 분석\n[[img:IV-60]]\n[[img:IV-61]]\n  - 1) 계약일자 : 고객은 여러 개의 계약일자를 가질 수 있음. → 고객의 속성(X), 가입계약의 속성(O)\n  - 2) 차량번호 : 고객은 하나 이상의 차량을 가질 수 있음. → 고객의 속성(X), 고객차량의 속성(O)\n  - 3) 취미 : 고객은 여러 개의 취미를 가질 수 있음.\n#### 다. 유도 속성인지 검증\n[[img:IV-62]]\n[[img:IV-63]]\n- 1) 현재 정보만 관리하는 형태 : 현주소, 현고객등급코드 등\n  - 자식 엔터티에 있는 맨 마지막 정보를 현재의 정보라는 의미로 중복하는 경우\n  - 이력(선분) 개념이 들어간 자식 정보 중에서 현재 시점을 통과하고 있는 선분에 해당하는 데이터를 미리 가져다 두는 형태\n- 2) 최초 정보를 보관하는 형태 : 최초가입일자, 모집사원번호 등 (자식 엔터티의 정보 중 최초 발생 정보)\n- 3) 집계 정보를 관리하는 형태 : 인원 수, 가족 수, 총직원 수 등 (하위 엔터티 정보의 집계, 건수/횟수/차수 등)\n- 4) {r}추출 관계만 관리하는 형태{/r} : 가입 계약번호, 관리 사원 등\n  - {r}자식 엔터티의 식별자를 전부 또는 일부만 옮겨둔 경우{/r}\n  - 대부분의 경우 {r}마지막 건의 식별자 사용{/r}\n- 5) 대표 정보만 관리하는 형태 : 대표 전자메일 ID, 취미, 법인의 대표자 정보\n  - 자식 엔터티의 여러 개의 정보 중 가장 대표적인 것 하나만을 선정하여 사용하는 경우\n- 6) 다른 속성의 일부 정보만 분리한 형태 : 성별, 결혼 여부 등\n- 7) 일부분만 추출 값인 형태 : 인원 수, 법인의 대표자 정보 등\n  - {b}이 속성에 값이 들어가는 수많은 인스턴스 중에서 일부는 다른 엔터티에세 가공하여 만들 수 있지만, 다른 일부는 원시 값인 경우{/b}\n    {b}→ (추가 설명) 거래처 엔터티의 '대표자명'을 보면, 임직원 정보까지 받아 관리하는 주요 거래처는 거래처임직원 엔터티에서 직위가 대표이사인 행을 뽑으면 된다.(유도 가능){/b}\n    {b}하지만 대다수 일반 거래처는 임직원 데이터 자체가 없어서 사업자등록증 보고 직접 입력한다.(원시 값){/b}"
      },
      {
       "no": 5,
       "title": "유도 속성 규칙",
       "body": "- 초기 데이터 모델링 이론\n  - 유도 속성 / 계산된 속성 : 중복으로 인식, 데이터 모델에 표현 X → 데이터 모델 내에 반드시 기술 필요\n- 유도(Derived) 속성\n  - 경영층이 원하는 정보\n  - 사용자들의 요구사항을 나타냄\n  - 물리적 구현에 대한 것을 내포하지 않음. → 데이터 모델에 표현 필요\n  - 향후에 식별자로서의 역할 X\n- {r}계산(Calculated) 속성{/r}은 {r}엔터티의 단일 사례에 대한 어떤 특성을 기술{/r}\n  - (추가 설명) 계산 범위가 자기 행 안에서 완결된다. {r}다른 행이나 다른 엔터티를 쳐다볼 필요가 전혀 없다.{/r}\n  - 나이는 그 행의 생년월일만 있으면 나오고, \n    부가세액은 그 행의 공급가액에 0.1을 곱하면 되고, \n    주문금액은 그 행의 단가와 수량을 곱하면 된다.\n\n[정리] {2013}\n- {b}**전용(轉用)이 발생하는 경우**{/b}\n  - 모델러가 속성의 의미를 매우 추상적·모호하게 정의하여 개발자들이 각기 다르게 이해하는 경우\n  - 개발 막바지 또는 운용 중인 시스템에서 새로운 요구 사항으로 새로운 속성 추가가 필요할 때\n  - ERP 패키지에서 미리 전용의 용도로 속성을 정의해 두는 경우\n  - → {r}표준 단어 사전{/r}을 {r}사전에 제정{/r}하는 것은 전용을 방지하기 위한 활동이다."
      }
     ]
    },
    {
     "no": 6,
     "title": "식별자 확정",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "식별자 개념",
       "body": "- 엔터티 내의 모든 인스턴스는 유일하게 구분되어야 한다. → 식별자\n#### 가. 식별자 종류\n- **본질 식별자(Natural Identifier, Natural Key(=Business Key))**\n  - 1) 기준 정보 엔터티의 본질 식별자\n    - 기준 정보 엔터티 : 부모 엔터티 없이도 혼자서 정의될 수 있는 엔터티(사원, 고객, 상품)\n    - 인위적으로 식별자 생성 (사원번호, 고객번호, 상품번호)\n  - 2) 거래 처리 엔터티의 본질 식별자\n    - 부모 엔터티가 누구인지(하나의 인스턴스를 유일하게 발생시키는 일련의 속성이 어떤 것인지)를 확인하는 방식으로 식별자 생성 (육하원칙 이용)\n- **인조 식별자(Artificial Identifier, Surrogate Key)** : 인위적으로 만든 속성으로 유일성 보장\n- **보조 식별자(Alternate Identifier, Alternate key)** : 유일한 식별은 가능하나 대표성을 갖지 못함\n[[img:IV-64]]\n#### 나. 후보 식별자(Candidate Identifier) 도출\n- 1) 널(NULL)이 될 수 없다.\n- 2) 각 인스턴스를 유일하게 식별할 수 있어야 한다.\n- 3) 나머지 속성들을 직접 식별할 수 있어야 한다.\n- 4) 후보 식별자로 속성 집합을 선택하는 경우에는 개념적으로 유일해야 한다\n  - (부서+성명) 식별자 → X (부서 내에 동명이인 가능)\n  - (부서명+팀명) 식별자 → O (부서 내에 같은 팀명은 없음)\n- 5) 후보 식별자의 데이터는 자주 변경되지 않는 것이어야 한다\n  - 데이터베이스 설계 단계에서 식별자들은 대부분 인덱스를 통해 구현 \n    → 자주 변경되는 경우 인덱스 트리 구조 재구성에 많은 시간 필요, 성능 저하\n#### 다. 보조 식별자\n- 원래의 식별자를 대신할 수 있는 또 다른 속성들이나 관계(관계속성)\n- 예) 사원번호 대신 주민등록번호 사용 : 식별자로서의 역할 가능\n- 여러 참조 엔터티 중에서 원래의 식별자보다 보조 식별자로 연결을 맺는 것이 자신에게는 훨씬 유리한 경우\n#### 라. 인조 식별자 지정\n- 인조 식별자 : 기존의 본질 식별자를 그대로 인정할 수 없는 여러 가지 상황이 발생했을 때, 전부 혹은 일부를 임의의 값을 가진 속성들로 대체하여 새롭게 구성한 식별자 (예 – 사원번호)\n##### 1) 최대한 범용적인 값을 사용 (사원번호, 상품코드, 은행코드, HS코드(무역상품 분류체계), 국가/통화(通貨)코드 등)\n##### 2) 유일한 값을 만들기 위한 인조 식별자를 사용한다.\n  - 본질 식별자를 그대로 사용하면 심각한 문제가 발생하는 경우\n  - 유일 값에 대한 확신이 없을 때 이를 해결하기 위해 인조 속성을 영입하는 경우\n##### 3) 하나의 인조 식별자 속성으로 대체할 수 없는 형태를 주의한다.\n  - 구체적으로 본질 식별자의 어느 부분을 대체하고 있는지를 분명하게 정의해야 함.\n  - 하나의 인조 식별자 속성에 같이 대체될 수 있는 것과 절대로 그렇게 해서는 안 되는 경우가 있음에 유의\n    - otherwise, 인스턴스의 정의가 모호해질 수 있음.\n    - 예) 이력을 대체하는 일련번호 인조식별자를 갖고 있는 엔터티가 자식을 갖게 되면 일련번호 인조식별자가 상속되게 되고, 이때 부모에 변경이력이 발생하게 되면 자식에 변경이 없더라도 새로운 이력 일련번호를 상속하여 자식을 다시 만들어야 하는 상황이 발생할 수 있음. 이로 인해 자식의 정보를 활용하는데 있어서 혼란이나 왜곡이 생길 수 있음.\n##### 4) 편의성·단순성 확보를 위한 인조 식별자를 사용할 수 있다.\n  - 속성의 길이가 너무 길거나 기억하기가 어려워서 좀 더 쉽고 간편한 이름으로 변경할 목적으로 인조 속성 사용\n##### 5) 의미의 체계화를 위한 인조 식별자를 사용할 수 있다 (코드화)\n##### 6) 내부적으로만 사용하는 인조 식별자\n  - 현업 사용자들에게는 전혀 알려주지 않으면서 시스템 내부적으로만 사용하는 형태\n  - 시스템적인 필요성에 의해서 도입하는 경우\n#### 마. 식별자 확정\n##### 1) 식별 관계의 두 가지 의미\n- 가) 식별자로서의 역할\n- 나) 정보로서의 역할\n    - 상대방의 식별자를 상속 받았기 때문에 자신이 보유한 정보가 증가했다는 의미\n    - 부모의 식별자를 자식이 상속 받고, 다시 그것을 그 자식들에게 물려준다면 자식들은 굳이 나를 경유하지 않고서도 조상이 누구인지 알 수 있는 것과 유사\n    - 내 식별자에 부모의 식별자를 포함시키지 않는 순간에 내 자손들에게는 더 이상 조상의 식별자를 상속시키지 못한다.\n[[img:IV-65]]\n##### 2) 식별자 상속과 단절의 원리\n  - 식별자의 적절한 상속과 단절 전략은 실질적인 처리의 단순화를 가져다 줄 수 있음.\n[[img:IV-66]]\n※ C_엔터티에는 아버지인 B_엔터티를 경유하지 않고서도 직접 A_엔터티와 연결될 수 있음 (a를 통해)\n##### 3) 식별자 확정 절차\n  - 하향식(Top-down) 방식(상위 엔터티부터 시작해서 하위 엔터티로)으로 순차적으로 결정\n- 가) 기준 정보 엔터티 식별자 확정 : 최상위 엔터티이므로 서로 독립적으로 식별자 확정\n- 나) 중요 거래 처리 엔터티 식별자 확정\n    - 해당 업무의 근본이 되는 엔터티\n    - 자신이 하위에 거느리고 있는 수많은 엔터티의 상황을 종합적으로 감안한 전략적 결정\n    - 가급적 식별자 속성의 개수를 적게 → 경우에 따라서는 전체를 대신하는 인조 식별자를 생성\n- 다) 기타 거래 처리 엔터티 식별자 확정\n    - 인조 속성을 많이 사용하지 않는 것이 바람직 (정보로서의 가치는 현저하게 감소)"
      }
     ]
    },
    {
     "no": 7,
     "title": "정규화",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "정규화 정의",
       "body": "- 정규화(Normalization)\n  - 엔터티(릴레이션)에 데이터의 입력/수정/삭제 연산 수행 시 발생하는 이상(Anomaly) 현상 제거\n  - 정확성, 일관성, 단순성, 비중복성, 안정성을 만족시키는 최적의 데이터 구조를 만들어가는 과정\n  - 이상 현상이 발생하지 않도록, 엔터티를 관련이 있는 속성들로만 구성하기 위해 엔터티를 분해하는 과정\n  - 중복 데이터의 제거\n- 제1정규형(1NF)에서부터 제5정규형(5NF)과 BCNF(Boyce-Codd Normal Form)까지로 구성"
      },
      {
       "no": 2,
       "title": "정규화 장점",
       "body": "- 중복값이 줄어든다.(테이블에 중복되는 데이터들을 최소화)\n- NULL 값이 줄어든다.\n- 복잡한 코드로 데이터 모델을 보완할 필요가 없다.\n- {r}새로운 요구 사항의 발견 과정을 돕는다.{/r}\n- {r}업무 규칙의 정밀한 포착을 보증한다. → 업무 규칙의 체계화{/r}\n- 데이터 구조의 안정성을 최대화한다"
      },
      {
       "no": 3,
       "title": "정규화 과정",
       "body": "[[img:IV-67]]\n[[img:IV-68]]\n[[img:IV-69]]\n※정규화되어 있지 않아서 데이터 값의 중복 발생\n\n| 주문상품 | << | << | << | << | << | << | << | << | << |\n| 주문번호 | 주문일자 | 납품회사코드 | 납품 회사명 |  | 상품코드 | 상품명 |  | 금액(천원) | 납품지점 |\n| 201901001 | 2019111 | S09001 | ㈜S전자 | ... | SR321UC | 일반냉장고 | ... | 15,000 | 가양지점 |\n| 201901001 | 2019111 | S09001 | ㈜S전자 |  | HDR124RT | 드럼세탁기 |  | 50,000 | 송파지점 |\n| 201901001 | 2019111 | S09001 | ㈜S전자 |  | HT-TXQ12 | 스마트TV |  | 60,000 | 송파지점 |\n| 201901002 | 2019112 |  |  |  | ... | 김치냉장고 |  | ... | ... |\n| 201901002 | 2019112 |  |  |  | ... | 스마트TV |  | ... | ... |\n| 201901003 | 2019112 |  |  |  | ... | 일반냉장고 |  | ... | ... |\n| 201901003 | 2019112 |  |  |  | ... | 김치냉장고 |  | ... | ... |\n| 201901003 | 2019112 |  |  |  | ... | 스마트TV |  | ... | ... |\n| 201901003 | 2019112 |  |  |  | ... | 전자레인지 |  | ... | ... |\n\n- 입력 이상(Insertion Anomaly)\n  - 별도의 사실이 발생하기 전까지 원하는 데이터를 입력할 수 없음.\n  - 어떤 데이터를 입력하려고 할 때 불필요하게 원하지 않는 데이터도 함께 입력해야 하는 구조\n    - 구매주문이 발생하기 전까지는 새로운 납품회사(고객)를 등록할 수 없는 문제 \n      → 별도의 납품회사 엔터티 생성 필요\n- 수정 이상(Update Anomaly)\n  - 일부 속성 값을 수정함으로써 원하지 않는 정보의 이상 현상(데이터의 정확성/일관성 보장 못하는 현상)이 발생\n    - 납품 회사 ‘S09001’의 회사명 변경 → ‘S09001’ 모든 건의 회사명을 변경해야 하나, 일부만 수정한다면 나납품회사 ‘S09001’ 회사명이 동일하지 않는 문제 발생 → 별도의 납품회사 엔터티 생성 필요\n- 삭제 이상(Deletion Anomaly)\n  - 일부 정보를 삭제함으로써 유지되어야 할 정보까지도 연쇄(Triggering) 삭제되는 현상 발생\n#### 가. 제1정규형(1NF, 1st Normal Form)\n##### 1) 정의\n  - 모든 속성은 반드시 하나의 값을 가져야 한다. 즉, 반복 형태가 있어서는 안된다.\n  - 각 속성의 모든 값은 동일한 형식이어야 한다.\n  - 각 속성들은 유일한 이름을 가져야 한다.\n  - 행(Row)들은 서로 간에 식별 가능해야 한다.\n\n| **관계형 모델 이론** | 모든 속성이 오직 하나의 원자적 값을 취하는 릴레이션 → 릴레이션 자체의 정의이자 특성이다. |\n| **CJ. Date, 1986** | 릴레이션 R이 제1정규형(1NF)이라 함은 모든 기초를 이루는 정의역(domain)이 원자값만을 담고 있다는 것과 동치이다. |\n| **Finkelstein, 1989** | 반복 그룹 속성(Repeating Group attributes)을 식별하여 새로운 엔터티로 옮긴다. |\n| **논리 데이터 모델링** | 모든 속성은 반드시 하나의 값을 가져야 한다. (다중 값(Multi Value) 또는 반복 형태가 있어서는 안 됨). |\n\n##### 2) 정규화 작업\n[[img:IV-70]]\n\n[그림 IV-2-49] 제1정규형 사례 데이터\n\n| 주문 | << | << | << |\n| 주문번호¶(PK) | 주문일자 | 고객번호 | 고객명 |\n| 201901001 | 2019111 | S09001 | ㈜S전자 |\n| 201901002 | 2019112 | ... | ... |\n| 201901003 | 2019112 | ... | ... |\n\n| 주문상품 | << | << | << | << |\n| 주문번호¶(PK, FK) | 상품코드¶(PK) | 상품명 | 금액 (천원) | 납품지점 |\n| 201901001 | SR321UC | 일반냉장고 | 15,000 | ... |\n| 201901001 | HDR124RT | 드럼세탁기 | 50,000 | ... |\n| 201901001 | HT-TXQ12 | 스마트TV | 60,000 | ... |\n| 201901002 | ... | 김치냉장고 | ... | ... |\n| 201901002 | ... | 스마트TV | ... | ... |\n| 201901003 | ... | 일반냉장고 | ... | ... |\n| 201901003 | ... | 김치냉장고 | ... | ... |\n| 201901003 | ... | 스마트TV | ... | ... |\n| 201901003 | ... | 전자레인지 | ... | ... |\n\n  - 주문일자, 납품일자, 납품회사코드 등 : 반복 그룹(Repeating Group) 형태의 값\n  - 어떤 속성이 다수의 값 또는 반복 그룹 값을 가지고 있다면 1:M 관계의 새로운 엔터티 추가\n  - 관계형 모델에서는 릴레이션(Relation) 정의상 한 속성이 하나의 값만을 가져야 한다. 그러므로 비정규형 릴레이션은 엄밀히 말하면 릴레이션으로 간주할 수 없다.\n  - 여러 개의 복합적인 의미를 가지고 있는 속성이 분해되어 하나의 의미만을 표현하는 속성들로 분해되어야 한다. 즉 속성수가 늘어나야 한다.\n  - 하나의 속성이 하나의 값을 가질 수 있어야 하며, 이 조건을 만족시키기 위해선 로우(Row)가 늘어나거나 다른 릴레이션으로 분리되어야 한다.\n#### 나. 제2정규형(2NF, 2nd Normal Form)\n##### 1) 정의\n  - 식별자가 아닌 모든 속성은 식별자 전체 속성에 완전 종속되어야 한다.\n  - 주 키(key)가 아닌 모든 칼럼이 주 키에 종속적이어야 제2정규형(2NF, 2nd Normal Form) 만족\n\n| **관계형 모델 이론** | 제1정규형에 속하고(Single-value, atomic 속성들로 이루어지고), 모든 Non-key  속성들이 후보 키(Candidate key)에 함수 종속되어야 한다. |\n| **CJ. Date, 1986** | 릴레이션 R이 제2정규형(2NF)이라 함은 그 릴레이션이 제1정규형에 속하고, 모든 Non-key 속성이 주 키(PK)에 완전 종속됨과 동치이다. |\n| **Finkelstein, 1989** | 주 키(PK)에 부분적으로 종속되는 속성을 식별하여 다른 엔터티를 생성하여 옮긴다. |\n| **논리 데이터 모델링** | 모든 속성은 반드시 식별자 속성 전부에 종속되어야 한다.¶(식별자 일부에만 종속되어서는 안 됨). |\n\n##### 2) 정규화 작업\n[[img:IV-71]]\n\n[그림 IV-2-51] 제2정규형 사례 데이터\n\n| 주문 | << | << | << |\n| 주문번호(PK) | 주문일자 | 고객번호 | 고객명 |\n| 201901001 | 2019111 | S09001 | ㈜S전자 |\n| 201901002 | 2019112 | ... | ... |\n| 201901003 | 2019112 | ... | ... |\n\n| 주문상품 | << | << | << |\n| 주문번호¶(PK, FK) | 상품코드¶(PK) | 금액 (천원) | 납품지점 |\n| 201901001 | SR321UC | 15,000 | ... |\n| 201901001 | HDR124RT | 50,000 | ... |\n| 201901001 | HT-TXQ12 | 60,000 | ... |\n| 201901002 | ... | ... | ... |\n| 201901002 | ... | ... | ... |\n| 201901003 | ... | ... | ... |\n| 201901003 | ... | ... | ... |\n| 201901003 | ... | ... | ... |\n| 201901003 | ... | ... | ... |\n\n| 주문상품 | << |\n| 상품코드(PK) | 상품명 |\n| SR321UC | 일반냉장고 |\n| HDR124RT | 드럼세탁기 |\n| HT-TXQ12 | 스마트TV |\n| ... | 김치냉장고 |\n\n※ [그림 IV-2-48] 주문상품 엔터티의 상품명이 식별자인 주문번호+상품코드 중 상품코드에 종속 → 상품 엔터티로 분리 생성\n※ 어떤 속성 식별자 전체에 종속되어 있지 않으면 잘못된 위치. 새로운 엔터티 즉, 상위 부모 엔터티(상품)를 생성하고 UID BAR를 상속받게 된다.\n#### 다. 제3정규형(3NF, 3rd Normal Form)\n##### 1) 정의\n  - 제2정규형을 만족하고 식별자를 제외한 나머지 속성들 간의 종속이 존재하면 안된다.\n\n| **관계형 모델 이론** | 제2정규형에 속하고, 모든 Non-key 속성들 사이에 함수종속관계가 없어야 한다. |\n| **CJ. Date, 1986** | 릴레이션 R이 제3정규형(3NF)이라 함은 그 릴레이션이 제2정규형에 속하고, 모든 Non-key 속성이 주 키(PK)에 비 이행적으로 종속됨과 동치이다. |\n| **Finkelstein, 1989** | 주 키(PK)와의 속성들 간에 종속되는 속성을 식별하여 다른 엔터티를 생성하고 속성을 옮긴다. |\n| **논리 데이터 모델링** | 식별자(UID)가 아닌 모든 속성 간에는 서로 종속될 수 없다. (속성 간 종속성 배제) |\n\n##### 2) 정규화 작업\n[[img:IV-72]]\n※ [그림 IV-2-51] 고객명 속성이 고객번호에 종속적 → 고객 엔터티 분리 생성\n※ 제3정규형을 위반하고 있을 때에는 [그림 IV-2-52] 고객 엔터티처럼 {r}부모 엔터티가 생성{/r}되고 그 부모 엔터티로부터 식별자가 없는 {r}비식별 관계로 상속{/r}받게 된다.\n\n[정리] 정규화\n- **1정규화 진행 →** 자식 엔터티 생성\n- **2정규화 진행 →** 부모 엔터티 생성 (부모 엔터티 생성, 식별관계 상속)\n- **3정규화 진행→** 참조관계 상위 엔터티 생성 (부모 엔터티 생성, 비식별관계 상속)\n\n[[img:IV-73]]"
      }
     ]
    },
    {
     "no": 8,
     "title": "이력 관리",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "이력 관리란?",
       "body": "[[img:IV-74]]\n[[img:IV-75]]\n- 특정 시점의 데이터를 찾으려면 <=은 것들을 모두 읽어 MAX를 구해야 함.\n- 선분을 표시하기 위한 두 점에서 하나를 빼면 선분이 없어진다."
      },
      {
       "no": 2,
       "title": "이력 관리 대상 선정",
       "body": "#### 가. 사용자 조사\n- 변경 내역을 감시할 필요가 있는가?\n- 시간의 경과에 따라 데이터가 변할 수 있는가?\n- 시간의 경과에 따라 관계가 변할 수 있는가?\n- 과거의 데이터를 조회할 필요가 있는가?\n- 과거 버전을 보관할 필요가 있는가?\n#### 나. 이력 데이터의 종류\n- 1) 발생 이력(Occurrence History) 데이터\n  - 어떤 데이터가 발생할 때마다 이력 정보를 남겨야만 한다면 → 발생 이력(Occurrence History)\n    - 예) 고객의 웹사이트 접속 데이터\n  - 이벤트성 이력 데이터를 관리하는 방법\n    - 이벤트가 발생할 때에만 이력 데이터를 발생하는 방법\n    - 이력이 발생하지 않더라도 날마다 데이터를 생성하는 방법\n\n| **{u}이벤트 발생할 때마다 생성{/u}**¶이벤트가 발생할 때마다 사진을 찍어 두어야 이력을 관리할 수 있는가? | **{u}날마다 생성{/u}**¶아무 변화가 없는 경우도 데이터 생성 그러나 완벽한 이력관리는 불가능 |\n\n[그림 IV-2-56] 발생 이력 예\n\n[[img:IV-76]]\n[[img:IV-77]]\n##### 2) 변경 이력 (Modification History) 데이터\n- 예) 주문 정보 변경 경우 → 변경된 새로운 주문 정보를 이력 정보로 남겨야 함.\n##### 3) 진행 이력 (Progress History) 데이터\n  - 업무의 진행에 따라 이 데이터를 이력 정보로 남겨야만 하는 경우\n- 예) 주문 업무 처리\n#### 다. 이력 관리 형태\n- 시점 이력 : 데이터의 변경이 발생한 시각만을 관리\n- 선분 이력 : 데이터 변경의 시작 시점부터 그 상태의 종료 시점까지 관리\n##### 1) 시점 이력\n  - 특정 통화의 환율이 변경되면 새로운 인스턴스가 생겨나고(New Record), 그 시점의 해당 통화의 환율과 발생 시각을 기록/보관함으로써 환율이 어느 시점에 얼마의 값으로 변경되었다라는 정보를 관리\n  - 특정한 시점의 데이터를 추출하고자 할 경우에 불필요한 작업을 수행 (주의 필요)\n[[img:IV-78]]\n- 가) 시점 이력 활용 예\n  SELECT 환율\n  FROM 환율 변동 이력\n  WHERE 발생 시각 = (SELECT MAX(발생시각)\n  FROM 환율 변동 이력\n  WHERE 발생 시각 <=20020521 AND 통화_ID = ‘USD’)\n  AND 통화_ID = ‘USD’\n##### 2) 선분 이력\n  - 각 통화의 특정 기간 동안 유효한 환율을 관리\n[[img:IV-79]]\n- 가) 선분 이력 활용 예\n  SELECT 환율\n  FROM 환율 변동 이력\n  WHERE 발생 시각 between 시작 시각 and 종료 시각 AND 통화_ID = ‘USD’\n- 나) 선분 이력 의미\n[[img:IV-80]]\n\n| 선분 이력 의미¶17을 가진 선분을 = 로 찾을 수는 없다.¶그러나 17이 통과하는 선분을 찾아보자.¶어떤 점이나 반드시 하나의 선분을 통과한다.¶선분이 아무리 길어도 레코드는 하나이다. | 17의 지점을 선분 이력 데이터에서 찾는 방법¶부등식 표현 : 시작점 <= 17 <= 종료점¶연산자 표현 : 17 Between 시작점 and 종료점 |\n\n#### 라. 선분 이력 관리 유형\n##### 1) {r}인스턴스 레벨 이력 관리{/r}\n  - 하나의 인스턴스의 어떤 변경이라도 발생하면 전체 인스턴스를 새롭게 생성하는 방식\n[[img:IV-81]]\n  - 특징\n    - 한번의 액세스로 스냅샷 참조 가능 (한번의 액세스로 해당 시점의 모든 데이터 참조 가능)\n    - {r}**로그성 데이터를 저장**{/r}할 목적인 경우 적당한 방법이다.\n    - 다른 이력 관리 유형에 비해서 **저장하기가 쉽다.**\n    - 가장 큰 **단점** 중에 하나는 **하나 이상의 칼럼에 변경이 발생했을 때 이벤트가 모호**해진다는 점이다.\n    - 만약 **이벤트가 자식 정보를 가지게 된다면 매우 치명적**이다. 즉, 각각의 변경 이벤트가 하위의 데이터(엔터티)를 가지게 된다면 해당 이벤트를 찾기가 매우 어려워진다.\n    - 이력 관리의 다른 유형들에 비해서 **저장 공간의 낭비**를 초래할 수 있다.\n    - 실제 어떤 데이터가 변경된 것인지를 찾기 위해서는(즉, 이벤트를 찾기 위해서는) 과거의 데이터를 Merge 해서 비교를 해야만 가능할 수 있다.\n    - 특정 순간의 스냅샷만 보는게 아니라면 처리가 복잡해지는 경향이 있다.\n    - {r}**{u}변화가 빈번하게 발생하는 상황{/u}**{/r}이라면 고려해 볼 수 있는 유형이다.\n##### 2) {r}속성 레벨 이력 관리{/r}\n  - 이력을 관리할 대상 속성에서 변화가 생길 때만 이력을 생성\n[[img:IV-82]]\n  - 특징\n    - 변경 이벤트가 매우 분명하게 관리된다. 즉, 실제 어떤 데이터가 변경되었는지가 분명하다.\n    - 하나의 이력 관리 엔터티에서 다른 엔터티와 **통합 이력 관리**가 가능하다.\n    - 변경된 것만 처리하기 때문에 **독립적 처리**가 가능하다.\n    - {r}**{u}변화가 발생할 가능성은 매우 낮으면서{/u}**{/r} **{u}이력 관리 대상 속성은 매우 많은 경우{/u}**에 사용하는 것이 유리\n    - **특정 속성들에 변화가 집중되는 경우**에 해당 속성에 대해서만 이력을 관리할 수 있기 때문에 유리하다.\n    - 여러 속성에 대한 이력이 필요할 때 많은 Merge가 발생하게 된다.\n    - 이력 관리의 다른 유형들에 비해서 향후 사용될 **데이터 액세스 쿼리에서 조건 검색이 조금 어렵다.**\n    - **변화가 너무 많은 경우에는 적용이 곤란**하다.\n##### 3) {r}주제 레벨 이력 관리{/r}\n  - 내용이 유사하거나 연동될 확률이 높은 것별로 로우(Row) 레벨 이력을 관리하는 방법\n[[img:IV-83]]\n  - 특징\n    - **로우(Row) 레벨과 속성 레벨의 장점을 모두 수용**하는 형태의 이력 관리 형태이다.\n    - **목적이 분명한 엔터티를 생성**함으로써 **확장성**을 확보할 수 있는 용도로 사용할 수 있다.\n    - 변경 부분만 처리가 가능하다. (**독립적 처리 가능**)\n    - 다른 엔터티와 **통합 이력 관리**가 가능하다.\n    - **속성 레벨의 단점을 해소**할 수 있다.\n    - 전체를 참조할 때 로우(Row) 레벨에 비해 Merge가 발생하는 문제점이 존재한다.\n    - {r}**{u}부문에 따라 변경 정도의 차이가 심한 경우{/u}**{/r} 유리하다."
      },
      {
       "no": 3,
       "title": "선분 이력 관리용 식별자 확정",
       "body": "#### 가. 선분 이력에서 식별자 결정 시 고려사항\n- 향후 성능 측면도 고려 해야 함.\n[[img:IV-84]]\n- 의미적인 UID는 부서코드 + 이력시작일 + 이력종료일을 주키(PK)로 하는 것이 유리\n  → 물리적인 측면, 즉 실제 데이터는 유일하지만 의미적으로는 유일하지 않은 일이 발생\n- 의미적인 유일성을 검증할 수 있는 조치를 병행해야 함.\n#### 나. 선분 이력에서 종료점 처리 시 주의 사항\n- 1) 종료점이 미정이므로 NULL\n  - 논리적으로는 타당하지만 비교가 불가능\n  - 인덱스를 사용하지 못하므로 수행 속도 저하\n- 2) 수렴하므로 최대치 부여\n  - 아직 종료되지 않았으므로 무한히 계속되는 것으로 간주\n  - 최대치 부여 (예 - 일자라면 9999/12/31)\n  - 가능한 테이블(Table) 생성 시 기본값 제약(Default constraints) 부여\n  - 수행 속도에 유리"
      }
     ]
    },
    {
     "no": 9,
     "title": "논리 데이터 모델 품질 검토",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "논리 데이터 모델 품질 검토 개요",
       "body": "- 이해관계자는 {u}데이터 모델 리뷰 세션{/u}을 통해 작성된 데이터 모델의 품질 검토\n- 개념 데이터 모델, 논리 데이터 모델, 물리 데이터 모델 대상으로 모델 품질 검토 수행\n- 논리·물리 데이터 모델 검토 기준은 데이터아키텍처 정책 수립 시 ‘**DA원칙ㆍ표준**’에 포함되어야할 중요 사안\n- 데이터 모델의 품질 검토 기준\n  - 주로 논리 데이터 모델과 물리 데이터 모델에 대해 적용\n  - 조직에 따라서는 개념 데이터 모델에 대한 검토 기준을 추가하기도 함.\n  - 논리 데이터 모델 품질 검토의 목적 : ‘완벽한 모델’보다 **‘(조직에) 적합한 모델’의 관점**에서 생각\n\n‖ **기준 항목** | **설명** | **검토 관점 사례** |\n| **정확성** | 데이터 모델이 표기법에 따라 정확하게 표현되었고, 업무영역 또는 요구사항이 정확하게 반영되었음을 의미함 | 사용된 표기법에 따라 데이터 모델이 정확하게 표현 되었는가¶대상 업무영역의 업무 개념과 내용이 정확하게 표현 되었는가¶요구사항의 내용이 정확하게 반영 되었는가¶업무규칙이 정확하게 표현 되었는가 |\n| **완전성** | 데이터 모델의 구성 요소를 정의하는데 있어서 누락을 최소화하고, 요구사항 및 업무영역 반영에 있어서 누락이 없음을 의미함 | 모델 표현의 충실성(완성도)¶필요한 항목(엔터티/속성 설명 등)들의 작성 상태¶논리 데이터 모델링 단계에서 결정해야할 항목들의 작성 상태(속성의 선택성(optionality), 식별자, 정규화, 엔터티/속성의 중복배제, 이력관리 등)¶요구사항 반영 및 업무 영역 반영의 완전성 : 목적하는 업무 영역을 기술(설계)하는데 있어서 논리 데이터 모델 구성요소(엔터티, 속성, 관계 등)들이 누락없이 정의 된 정도 |\n| **준거성** | 제반 준수 요건들이 누락 없이 정확하게 준수되었음을 의미함 | 데이터 표준, 표준화 규칙 등을 준수하였는가¶법적 요건을 준수 하였는가 |\n| **최신성** | 데이터 모델이 현행 시스템의 최신 상태를 반영하고 있고, 이슈사항들이 지체없이 반영되고 있음을 의미 | 업무상의 변경이나 결정사항 등이 시의 적절하게 반영되고 있는가¶최근의 이슈사항이 반영 되었는가¶현행 데이터 모델은 현행 시스템과 일치 하는가 |\n| **일관성** | 여러 영역에서 공통 사용되는 데이터 요소가 전사 수준에서 한 번만 정의되고 이를 여러 다른 영역에서 참조·활용되면서, 모델 표현상의 일관성을 유지하고 있음을 의미함 | 여러 주제영역에서 공통적으로 사용되는 엔터티는 일관성 있게 사용되는가(전사 수준에서 한 번만 정의되고 이를 여러 다른 영역에서 참조·활용한다는 의미에서 통합성이라 하기도 함)¶모델 표현상의 일관성을 유지하고 있는가 |\n| **활용성** | 작성된 모델과 그 설명 내용이 이해관계자에게 의미를 충분하게 전달할 수 있으면서, 업무 변화 시에 설계 변경이 최소화되도록 유연하게 설계되어 있음을 의미 | 작성된 설명 내용이나 모델 표기 등이 사용자나 모델을 보는 사람에게 충분히 이해가 될 수 있고, 모델의 작성 의도를 명확하게 이해할 수 있는가 (의사소통의 충분성)¶데이터 모델은 유연성을 갖고 있는가 (오류가 적고 업무변화에 유연하게 대응하여 데이터 구조의 변경이 최소화 될 수 있는 설계 결과) |"
      },
      {
       "no": 2,
       "title": "논리 데이터 모델 품질 검토 체크리스트의 활용",
       "body": "‖ **검토 대상** | **검토항목** | **검토 내용** |\n| **엔터티** | 엔터티명 | 명명규칙을 준수하였는가?¶제안요건에 따라 약어를 사용한 경우 약어사용 규칙을 준수하였는가?¶의미 전달이 명확한 명칭을 사용하였는가?¶속성 구성에 비추어 적합한 명칭을 사용하고 있는가? |\n| ^^ | 엔터티 설명 | 데이터 집합의 개요나 성격, 관리 목적 등을 설명하였는가?¶데이터 집합 구성상의 특징이 설명되어 있는가?¶데이터 집합의 생명주기나 오너십 등을 비롯한 기타 특이사항에 대한 내용을 포함하고 있는가?¶설명된 내용은 모든 이해관계자가 이해하고 의사소통 하는 데에 어려움이 없도록 쉽고 상세하게 기술되었는가? |\n| ^^ | 엔터티 정의 | 도출된 엔터티는 요구사항을 충족하거나 업무 영역을 설명하기에 충분한가?¶우선순위에 따른 엔터티 분류 관점에서 중요한 키엔터티나 메인엔터티가 누락되지 않았는가?¶엔터티는 {r}**서브타입**{/r}을 사용하여 {r}구체적·입체적으로 정의되었는가?{/r}¶서브타입 정의 시 구분자 속성은 명확하게 정의하였는가?¶{r}서브타입 구성{/r}은 {r}엔터티의 성격을 설명하기에 충분한가?{/r}¶서브타입은 충분하게 도출되었는가? (전체집합=Σ서브타입)¶향후의 업무 변화 가능성에 대비하여 모델 변경을 최소화할 수 있도록 유연성, 확장성이 고려되었는가? |\n| ^^ | 통합 수준 | 업무 행위의 주체가 될 수 있는 전사관계자와 같은 중요 기준데이터는 통합이 고려되었는가?¶엔터티 간 동질성을 부여할 수 있는 유사 목적·구성의 엔터티에 대해 통합이 고려되었는가? (서브타입 사용)¶코드 엔터티는 통합이 고려되었는가?¶계층구조 엔터티에 대한 통합은 고려되었는가?¶배타관계 엔터티의 통합은 고려되었는가?¶{r}다른 영역에서 동일 목적의 엔터티는 동일 명칭과 구조로{/r} {b}일관되게{/b} {r}사용되었는가?{/r}¶엔터티 분리는 명확하고 합리적인 근거와 목적에 의해 적절한 형태로 이루어졌는가? |\n| ^^ | 권한 | 메타데이터 권한을 정의 하였는가? (엔터티 생성/변경/삭제)¶데이터 오너십을 정의 하였는가? (데이터 생성/변경/삭제) |\n| ^^ | 발생 건수/빈도 | 현재의 데이터 저장 건수/빈도는 파악하였는가?¶향후 예상되는 데이터 저장 건수/빈도의 변화가능성은 파악하였는가? |\n| ^^ | 다른 엔터티와의 관계 | 다른 엔터티와 하나 이상의 관계를 가지고 있는가? |\n| ^^ | 법규 준수 | 관련 법규에서 요구하는 데이터를 보관하기 위한 엔터티를 정의하였는가?¶조직 특성에 비추어 보호가 요구되는 엔터티를 식별하였는가? |\n| ^^ | 요구 사항¶추적 가능성 | 정의된 엔터티는 요구사항과 매핑이 되었는가? |\n| **속성** | 속성명 | 속성명은 명명규칙을 준수하였는가?¶제한요건에 따라 약어를 사용한 경우 약어사용 규칙을 준수하였는가?¶의미 전달이 명확한 명칭을 사용하였는가? |\n| ^^ | 속성 정의 | 엔터티명이나 엔터티 성격에 맞는 속성이 도출되었는가?¶엔터티의 성격이나 목적에 비추어 속성은 충분하게 도출되었는가?¶속성의 선택성 결정은 적절한가?¶{r}유일값 원칙에 위배되는 속성이 존재하는가?{/r}¶{r}속성의 원자단위 구성은 적절한가?{/r}¶속성의 관리 목적상 상세화 여부 검토가 수행되었는가?¶인조 속성의 생성 단위나 생성 규칙이 정의되었는가? |\n| ^^ | 속성 설명 | 속성의 개요나 성격, 관리 목적 등을 설명하였는가?¶속성으로 관리하고자 하는 데이터의 형태적 혹은 구성상의 특징이 포함되어 있는가?¶데이터 집합으로서 속성의 생명주기나 오너십 등을 비롯한 기타 특이사항에 대한 내용을 포함하고 있는가?¶설명된 내용은 모든 이해관계자가 이해하고 의사소통 하는 데에 어려움이 없도록 쉽고 상세하게 기술되었는가? |\n| ^^ | 속성 유형 | 엔터티 성격에 맞게 식별자가 정의되었는가?¶관계를 통해 상속받은 관계속성은 명확한 역할명을 사용하고 있는가? |\n| ^^ | 식별자 정의 | 모든 본질식별자가 적절하게 파악되었는가?¶인조식별자 사용 시 대응하는 속성 구성이 파악되었는가?¶실질식별자로서 본질식별자나 인조식별자를 사용하는 기준을 준수하고 있는가? |\n| ^^ | 법규 준수 | 법규상 암호화 대상인 속성은 식별하였는가?¶법규상 필요한 속성은 정의되었는가?¶법규상 수집·보관에 따른 제약이 존재하는 속성은 처리 방안을 고려하고 적용하였는가? |\n| ^^ | 도메인 정의 | 표준 도메인을 정의하여 적용하였는가?¶속성의 도메인은 일관성 있게 정의되었는가? |\n| ^^ | 추출 속성의 정의 | 추출 속성은 명확하고 합리적인 이유를 토대로 정의하였는가?¶추출 속성의 원시 속성은 식별하였는가?¶추출 속성은 추출 방법 또는 산식이 명확하게 정의되었는가?¶추출 속성의 빈도(구성 수준)는 적절한가? |\n| ^^ | 요구 사항¶추적 가능성 | 속성 수준에서 필요한 요구사항 매핑은 수행되었는가? |\n| ^^ | {r}오너십 정의{/r} | 속성 수준에서 데이터 오너십 정의가 필요한 경우 데이터 오너십이 정의 되었는가? |\n| **관계** | 관계명 | 관계명이 누락된 관계가 존재하는가?¶관계명 부여 규칙 존재 시 이를 준수하였는가?¶두 엔터티 간의 업무적 관계를 자식(자식 엔터티)이 바라보는 부모(부모 엔터티)의 역할 관점으로 파악하여 관계명을 표현하였는가? |\n| ^^ | 관계 정의 | 업무 영역을 설명하거나 요구사항을 충족하는데 있어서 필요한 관계들이 충분히 도출·정의되었는가?¶관계 정의는 업무 영역의 내용이나 요구사항과 일치하는가?¶배타적 관계가 정의된 경우 업무 내용과 일치하는가?¶배타적 관계가 정의된 경우 현재의 업무 개선 관점이 고려되었는가?¶{r}배타 관계 해소를 위한 검토가 수행되었는가?{/r} |\n| ^^ | 관계 설명 | 관계가 왜 존재해야 하는지의 관점에서 기술하고 있는가? (업무규칙, 정규화 등) |\n| ^^ | 관계 표현 | 표기법에 따라 정확하게 표현하였는가?¶관계에 표현된 기수성·선택성은 업무규칙을 정확하게 설명하는가? |\n| ^^ | 식별자 상속 | 자식에 상속된 관계 속성은 정확한 역할명으로 표현되었는가?¶모든 관계 속성들의 출처(또는 관계)가 명확하게 파악되었는가? |\n| ^^ | 요구 사항¶추적 가능성 | 관계에 대해 필요한 요구사항 매핑은 수행되었는가? |\n| ^^ | 외래키(외부키) | 외래키(외부키)가 부모 엔터티의 주식별자(실질식별자)와 일치하는가?¶{r}외래키 항목이 기본키와 기본키가 아닌 속성에 펼쳐져 있는가?{/r}¶자식에 상속된 관계 속성의 선택성은 적절한가? |\n| ^^ | 참조무결성 | 업무규칙에 근거하여 참조무결성을 정의하였는가? |\n| **모델 전반** | 주제 영역 적절성 | 주제영역의 구성은 적절한가? |\n| ^^ | 논리 모델 상세화 | 데이터 모델상에 정규화가 미흡한 부분이 존재하는가?¶최종적인 논리 데이터 모델에서 다대다 관계는 모두 해소하였는가? |\n| ^^ | 이력 관리 | 이력관리 대상 선정과 이력관리 방법은 적절한가? |"
      }
     ]
    }
   ]
  },
  {
   "no": 3,
   "title": "물리 데이터 모델링",
   "sections": [
    {
     "no": 1,
     "title": "물리 데이터 모델링 이해",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "물리 데이터 모델 정의",
       "body": "- 물리 데이터 모델\n  - 논리적 모델을 특정 데이터베이스로 설계함으로써 생성된 데이터를 저장할 수 있는 물리적인 스키마\n  - 물리적인 테이블(Table)로 확정\n- 물리 데이터 모델링\n  - 논리 데이터 모델을 사용하고자 하는 각 DBMS의 특성을 고려하여 데이터베이스 저장 구조(물리 데이터 모델)로 변환하는 것\n  - 데이터의 구조에 관련된 것들을 물리적인 모습까지 설계\n- 데이터베이스 디자인\n  - 물리적인 모델(설계도면)을 DBMS 관점의 객체로 생성하는 최적의 설계(디자인)를 하는 것\n- 예) 객체별 저장 공간의 효율적 사용 계획, 객체 파티셔닝 설계, 최적의 인덱스 설계 등"
      },
      {
       "no": 2,
       "title": "물리 데이터 모델 의의",
       "body": "- 물리적 데이터 모델링 = 관계 데이터 모델링(RDM, Relation Data Modeling)\n  - 논리적 데이터 모델을 각각의 관계형 데이터베이스 관리 시스템의 특성, 기능, 성능 등을 고려하여 데이터베이스의 물리적인 구조(Schema)를 작성해가는 과정\n  - 논리 데이터 모델에서 도출된 내용 변환을 포함하여 데이터의 저장공간, 데이터의 분산, 데이터 저장 방법 등을 함께 고려하는 단계\n  - 이 과정에서 결정되는 많은 부분이 데이터베이스 운용 성능(Performance)으로 나타남."
      },
      {
       "no": 3,
       "title": "논리 데이터 모델-물리 데이터 모델",
       "body": "- 1개의 논리적 데이터 모델 → 여러 개 다른 형태의 물리적 데이터 모델 설계\n#### 가. 분산 데이터베이스 구축 시 : 노드별로 원하는 형태의 물리적 모델을 생성하고자 할 경우\n#### 나. 물리 데이터 모델 비교 : 여러 개의 물리적 모델을 생성하여 종합적인 비교 검토 목적 경우\n#### 다. 물리적 환경의 변화 : 물리적인 환경 변경 → 새로운 목표 물리적 모델로 개선할 경우\n#### 라. 물리적 모델의 형상 관리 : 물리적 모델이 변해갈 때 그 이력을 관리할 목적"
      }
     ]
    },
    {
     "no": 2,
     "title": "물리 요소 조사 및 분석",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "시스템 구축 관련 명명 규칙",
       "body": ""
      },
      {
       "no": 2,
       "title": "하드웨어 자원 파악",
       "body": "#### 가. CPU\n#### 나. MEMORY\n#### 다. DISK\n#### 라. I/O Controller\n#### 마. Network\n- 현재 처리 가능한 속도\n- 집중적인 부하가 발생하는 시간대\n- 동시 접속 최대 가용 사이트 수"
      },
      {
       "no": 3,
       "title": "운영체제 및 DBMS 버전 파악",
       "body": ""
      },
      {
       "no": 4,
       "title": "DBMS 파라미터 정보 파악",
       "body": "- 데이터 저장 공간 관리 기법, 메모리 관리 기법 등과 관련된 파라미터들\n- 데이터 쿼리에서 활용하는 옵티마이져(Optimizer)의 운영 방법"
      },
      {
       "no": 5,
       "title": "데이터베이스 운영과 관련된 관리 요소 파악",
       "body": "- 사용자 관리 기법 및 정책\n- 백업/복구 기법 및 정책\n- 보안 관리 정책"
      }
     ]
    },
    {
     "no": 3,
     "title": "논리-물리모델 변환",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "논리 데이터 모델-물리 데이터 모델 변환 용어",
       "body": "[[img:IV-85]]"
      },
      {
       "no": 2,
       "title": "엔터티-테이블 변환",
       "body": "#### 가. 테이블 설명\n[[img:IV-86]]\n[[img:IV-87]]\n##### 1) 테이블(Table)\n- 칼럼(Column), 로우(Row)로 구성\n##### 2) 로우(Rows) : 튜플, 인스턴스, 어커런스\n##### 3) 칼럼(Columns)\n##### 4) 기본키(Primary keys)\n- 어떤 경우라도 테이블 내에 동일한 값을 갖는 튜플이 존재하지 않도록 한다.\n##### 5) 외래키(Foreign keys)\n- 외부 데이터 집합과의 관계 구현\n#### 나. 서브타입 변환\n- 집합(엔터티)의 구성을 서브타입을 사용하여 구체적으로 표현\n- 각각의 서브타입들이 독립적인 속성(Attribute), 관계(Relationship)를 가지고 있는 경우\n   → 서브타입(Sub Type)을 사용한 집합 표현 필수\n- 서브타입 모델의 테이블 변환 작업\n  - 슈퍼타입 기준 테이블 변환\n  - 서브타입 기준 테이블 변환\n  - 개별타입 기준 테이블 변환\n[[img:IV-88]]\n[[img:IV-89]]\n##### 1) 슈퍼타입 기준 테이블 변환\n  - 서브타입을 **슈퍼타입에 통합하여 하나의 테이블**로 만든다.\n  - 이 통합된 테이블에는 **모든 서브타입의 데이터를 포함**해야 한다.\n  - 주로 서브타입에 적은 양의 속성이나 관계를 가진 경우에 적용된다.\n- 가) 절차\n    - 슈퍼타입으로 테이블 명칭 부여\n    - 서브타입을 구분할 수 있도록 칼럼 추가\n    - 슈퍼타입의 속성을 칼럼명으로\n    - 서브타입의 속성을 칼럼명으로\n    - 슈퍼타입의 관계를 FK로\n    - 서브타입의 관계를 FK로\n- 나) 테이블 사례\n[[img:IV-90]]\n    - TYPE : 서브타입을 구분할 수 있는 칼럼이다. 즉 사원 구분에 해당하는 칼럼이다.\n    - DEPT : 위의 구분이 정규직일 경우에 부서로부터의 관계로 인해서 생성된 칼럼이다.\n    - UNION : 위의 구분이 임시직일 경우에 협력 업체로부터의 관계로 인해서 생성된 칼럼이다.\n- 다) 하나의 테이블로의 통합이 유리한 경우\n    - 데이터 액세스가 좀더 간편\n    - 뷰를 활용하여 각 서브타입만을 액세스하거나 수정 가능\n    - 수행 속도가 좋아지는 경우가 많다\n    - 서브타입 구분없는 임의 집합의 가공 용이\n    - 다수의 서브타입을 통합한 경우 조인(JOIN) 감소 효과가 크다.\n    - 복잡한 처리를 하나의 SQL로 통합하기가 용이\n- 라) 하나의 테이블로의 통합이 불리한 경우\n    - {r}특정 서브타입의{/r} {r}**NOT NULL 제한 불가**{/r}\n    - 테이블의 칼럼 수가 증가\n    - 테이블의 블럭 수가 증가\n    - 처리시마다 서브타입의 구분(TYPE)이 필요해지는 경우가 많다\n    - 인덱스(INDEX) 크기가 증가\n##### 2) 서브타입 기준 테이블 변환\n    - 슈퍼 타입 속성들을 각 서브타입에 추가하여 **각각의 서브타입마다 하나의 테이블로** 만든다\n    - 분할된 테이블에는 해당 서브타입의 데이터만 포함돼야 한다\n    - 주로 **서브타입에 많은 양의 속성이나 관계를 가진 경우**에 적용된다.\n[[img:IV-91]]\n- 가) 절차\n    - 서브타입마다 테이블 명칭 부여\n    - 서브타입의 속성을 칼럼명으로\n    - 테이블마다 슈퍼타입의 속성을 칼럼으로\n    - 서브타입마다 해당되는 관계들을 FK로\n    - 테이블마다 슈퍼타입의 관계를 FK로\n- 나) 테이블 사례\n[[img:IV-92]]\n[[img:IV-93]]\n- 다) 서브타입 기준으로 여러 개의 테이블로 분할한 경우가 유리한 경우\n    - 각 서브타입 속성들의 선택 사양이 명확한 경우에 유리하다.\n    - 처리 시마다 서브타입 유형 구분이 불필요하다.\n    - {r}**전체 테이블 스캔 시**{/r} {r}유리{/r}하다.\n    - **단위 테이블의 크기가 감소**한다.\n- 라) 서브타입 기준으로 여러 개의 테이블로 분할한 경우가 불리한 경우\n    - 서브타입 구분 없이 데이터 처리하는 경우 {r}UNION이 발생{/r}한다.\n    - **처리 속도가 감소**하는 경우가 많다\n    - 트랜젝션 처리시 여러 테이블을 처리하는 경우가 증가한다.\n    - **복잡한 처리의 SQL 통합이 어려워진다.**\n    - 부분 범위 처리가 불가능해 질 수 있다.\n    - {r}여러 테이블을 합친 뷰{/r}는 {r}**조회만 가능**{/r}하다.\n    - UID 유지관리가 어렵다.\n##### 3) 개별타입 기준 테이블 변환\n    - **슈퍼타입과 서브타입을 각각 테이블로 변환**한 경우이다.\n    - 슈퍼타입과 서브타입 테이블 간에는 **1:1 관계**가 생성된다. (한쪽을 모두 합치면 전체와 같게 된다는 면에서 개념적으로 아크 관계와 유사)\n- 가) 다음의 여러 가지 경우를 만족할 때 사용\n    - **전체 데이터 처리가 빈번하게 발생할 경우**에 적용한다.\n    - **서브타입의 처리**는 주로 **독립적으로 발생할 경우**에 적용한다.\n    - 테이블을 통합했을 때 칼럼의 수가 너무 많아지는 경우에 적용한다.\n    - 서브타입의 칼럼 수가 많은 경우에 적용한다.\n    - {r}**트랜잭션이 주로 공통 부분(슈퍼타입)에서 발생**{/r}한다.\n    - 슈퍼타입의 처리 범위가 넓고 빈번하여 단일 테이블 클러스터링을 해야 할 때 적용한다.\n[[img:IV-94]]\n#### 다. 서브타입 변환 예\n[[img:IV-95]]\n##### {r}1) Case 1 : 서브타입을 테이블로 분리{/r}\n[[img:IV-96]]\n- {b}엔터티1은 그대로 TABLE10으로 전환되었다. 서브타입 세트란 일종의 구분코드라는 속성이라고 할 수 있으며, 서브타입세트1은 칼럼(SUBTYSET1)으로 전환되었다. 엔터티1에 있던 서브타입1,2는 서브타입세트1의 속성에 들어가는 값의 내용이므로 칼럼으로 전환할 필요가 없다.{/b}\n- {b}엔터티2는 서브타입별로 테이블을 분리한 모습이다. 서브타입21은 TABLE21로, 서브타입22는 TABLE22로 전환되었다. 공통 속성인 키2, 속성21은 양쪽 모두에 전환되었고, 엔터티1에서 오는 공통 관계는 KEY1로 전환되었다.{/b}\n- {b}엔터티3은 두 종류의 서브타입 세트를 가지고 있다. 위의 물리 모델은 이 중에서 서브타입세트32에 있는 서브타입별로 분리한 모습이다. 자세히 살펴보면 슈퍼타입에 있던 공통 속성 중에서 자신이 필요로 하는 일부분만 전환되었음을 발견할 수 있다. 바커표기법으로 표현할 모델에서 관계선에 세로선(UID BAR)이 붙어 있다면 식별자의 일부가 되겠다는 뜻이므로 물리적 모델이 될 때는 당연히 기본키(PK, Primary Key)이면서 외래키(FK, Foreign Key)가 되어야 한다.{/b}\n##### {r}2) Case 2 : 서브타입을 통합 테이블로 생성 (?????){/r}\n[[img:IV-97]]\n\n[정리] {2013}\n- **서브타입 도출 근거**\n- **분류 속성 :** 분류 속성에 따라 엔티티의 정보가 {r}차별화{/r}되는 경우에 서브타입을 도출할 수 있다.\n- **다수의 선택적 속성 :** {r}다수의 선택적 속성{/r}이 존재하는 경우에 서브타입을 도출할 수 있다.\n- **선택적 관계가 존재하는 경우 :** 서브타입으로 분할함으로써 {r}관계가 필수적으로 변하는지{/r}를 확인한다.\n- **서브타입 도출 절차**\n  - 분류 속성을 확인(엔티티의 발생이 차별화되는 경우)한다.\n  - 분류 속성값에 의해 분류되는 서브타입을 파악한다.\n  - 분류 속성에 따라 필수적/선택적 분할을 정의한다.\n  - 서브타입별 속성을 할당한다.\n  - 슈퍼타입의 관계를 해당 서브타입에 정의한다.\n- **서브타입의 활용**\n  - 데이터 모델에 업무 규칙을 명확히 표현하여 업무를 정확히 이해할 수 있다.\n  - 엔티티의 정의를 좀더 구체화하여 데이터 모델에 대한 가독성을 향상시킬 수 있다.\n  - 속성의 선택성 제거\n  - 관계의 선택성 제거\n  - 서브타입의 표현은 업무 규칙의 명확성과 표현의 복잡성이라는 트레이드 오프(Trade Off) 관계가 적절히 조화를 이루어야 한다.\n\n[정리] **실습 예제**\n[문] 다음 지문의 내용을 보고 제시된 커뮤니티 관리 논리 데이터 모델을 적합한 물리 데이터 모델로 변환하시오.\n- 우리가 관리하는 커뮤니티에 대해 전체를 대상으로 하는 이벤트나 검색 경우가 빈번하다.\n- 커뮤니티 대표자가 누구인지는 등록단체에 대해서만 관리할 것이다.\n- 사실상 등록단체에 가입한 회원은 개인회원뿐이고, 앞으로도 그럴 것이다.\n- 법인 회원과 개인 회원은 관리할 항목들이 많이 다르고, 같이 검색할 일은 별로 없다.\n  칼럼명 약어 사용 규칙 : 단어와 단어는 ‘_’로 연결\n\n‖ 커뮤니티 → cmnt, | 번호 → no, | 명(이름) → nm, | 등록일 → endt, |\n| 구분 → gb, | 대표자 → ldr, | 단체 → org, | 등록번호 → regno, |\n| 등록기관 → regag, | 일련 → ser, | 발생일자 → actdt, | 지원내역 → supdtl, |\n| 회원 → mbr, | 등록번호 → regdtl, | 가입단체 → jnorg, | 가입일 → jndt, |\n| 후원기업 → spnco, | 법인 → busi, | 개인 → prsn, | ... |\n\n[[img:IV-98]]\n[정리] **실습 예제 답안**\n지문 내용은 물리 데이터 모델 변환에 앞서 논리 데이터 모델에 수정이 필요함을 암시하고 있다\n- 우리가 관리하는 커뮤니티에 대해 전체를 대상으로 하는 이벤트나 검색이 빈번하다.\n  → 슈퍼타입 기준 테이블 변환 방식 적용 필요\n- 커뮤니티 대표자가 누구인지는 등록단체에 대해서만 관리할 것이다.\n  → 커뮤니티 대표자번호 관계 속성이 등록단체 서브타입으로 이동되어야 함을 의미\n- 사실상 등록단체에 가입한 회원은 개인회원뿐이고, 앞으로도 그럴 것이다.\n  → 회원등록내역 엔터티가 회원 슈퍼타입이 아닌 개인 서브타입과 관계를 가져야 함을 의미\n- 법인 회원과 개인 회원은 관리할 항목들이 많이 다르고, 같이 검색할 일은 별로 없다.\n  → 회원 엔터티에 대해 서브타입 기준 테이블 변환 방식 적용 필요\n[[img:IV-99]]\n[[img:IV-100]]\n#### 라. 테이블 목록 정의서 (테이블 목록)\n[[img:IV-101]]"
      },
      {
       "no": 3,
       "title": "속성-칼럼 변환",
       "body": "#### 가. 일반 속성 변환\n- 엔터티에 있는 각 속성들에 대한 칼럼명을 사례 데이터 표의 칼럼명란에 기록한다\n- 칼럼의 명칭은 속성의 명칭과 반드시 일치할 필요는 없으나 프로그래머와 사용자의 혼동을 피하기 위해 가능한 표준화된 약어를 사용한다.\n- 표준화된 약어의 사용은 SQL 해독 시간을 감소시킨다.\n- **SQL의 예약어(reserved word)의 사용을 피한다.**\n- 가급적 칼럼 명칭은 짧은 것이 좋으며, 짧은 명칭은 개발자의 생산성에 긍정적인 영향을 준다.\n- **필수 입력 속성**은 Nulls/Unique 란에 **NN**을 표시한다.\n- 실제 테이블에 대한 설계를 검증하기 위한 목적으로 가능하다면 표본 데이터를 입력시킨다.\n#### 나. Primary UID → 기본키(Primary Key) 변환\n##### 1) 변환 절차\n  - 사례 데이터 표의 키 형태 란에 엔터티의 Primary UID에 속하는 모든 속성에 PK를 표시\n  - PK로 표시된 모든 칼럼은 Nulls/Unique 란에 반드시 **NN, U**로 표시되어야 함\n  - 여러 개의 칼럼으로 UID가 구성되어 있는 경우는 각각의 칼럼에 **NN, U1**을 표시\n  - 또 다른 Unique Key(Secondary UID)가 있다면 **U2**로 표시\n##### 2) 변환 예\n[[img:IV-102]]\n#### 다. Primary UID(관계의 UID Bar) → 기본키(Primary Key) 변환\n##### 1) 변환 절차\n  - 테이블에 외래키 칼럼을 포함시킨다.\n  - PK의 일부분으로 표시\n    - Nulls/Unique 란에 각각 **NN, U1**을 표시\n    - 키 형태란에 **PK, FK**를 표시\n    - 여러 UID BAR가 있는 경우는 (PK, FK1), (PK, FK2), …\n    - 여러 칼럼으로 구성된 경우 PK, FK1을 각각 표시\n  - 추가된 FK 칼럼에 표본 데이터를 추가\n##### 2) 변환 예\n[[img:IV-103]]\n#### 라. Secondary (Alternate) UID → Unique Key 변환\n- Primary UID 변환 절차와 동일\n#### 마. 테이블 정의서\n[[img:IV-104]]"
      },
      {
       "no": 4,
       "title": "관계 변환",
       "body": "#### 가. 1:M 관계 변환\n##### 1) 변환 절차\n  - 1(One) 에 있는 PK를 M(Many)의 FK로 변환\n    - FK의 명칭 결정\n    - 키 형태 란에 FK 표시\n    - Nulls/Unique 란에 NN 표시(Must Be 관계시)\n    - 필수 관계가 아닌 경우에는 NN를 체크하지 않는다.\n  - 표본 데이터 추가\n  - UID BAR 가 있는 경우는 전단계에서 실시\n##### 2) 변환 예\n[[img:IV-105]]\n##### 3) 1:M 관계에서 1쪽이 Mandatory 관계일 때의 변환시 주의사항\n  - 자식 쪽의 레코드(Row)가 반드시 하나 이상은 되어야만 부모 쪽의 레코드(Row)를 생성할 수 있다.\n  - 자식 쪽의 레코드(Row)를 삭제할 경우에는 전체를 다 삭제할 수는 없고 반드시 하나 이상의 자식 레코드(Row)를 남겨두어야 한다. 또는 자식, 부모 레코드(Row)를 동시에 삭제해야 한다.\n[[img:IV-106]]\n#### 나. 1:1 관계 변환\n- 양쪽 다 Optional인 경우에는 보다 빈번하게 사용되는 테이블이 외래키를 가지는 것이 유리\n##### 1) 변환절차\n  - Mandatory 반대쪽에 있는 테이블의 기본키를 Mandatory 쪽 테이블의 외래키로 변환한다.\n  - NN 표시를 한다.\n##### 2) 변환 예\n[[img:IV-107]]\n##### 3) 변환 시 주의 사항\n  - **1:1 관계에 의해서 생긴 모든 외래키 부분은 Unique Key가 필수적이다.**\n  - 한쪽이 Optional이고 다른 한쪽이 Mandatory라면 Mandatory쪽의 테이블에 외래키가 생성 된다.\n  - 양쪽다 Mandatory라면 변환시에 어떤 테이블에 외래키를 생성할 것인지를 선택해야 한다.\n[[img:IV-108]]\n#### 다. 1:M 순환 관계 변환\n- 최상위 관계 속성은 항상 Optional인 형태의 관계\n##### 1) 변환 절차\n  - 해당 테이블 내에 외래키 칼럼 추가. 외래키는 같은 테이블 내의 다른 로우의 기본키 칼럼 참조\n  - 외래키 칼럼 명칭은 가능한 한 관계 명칭을 반영한다. 외래키는 결코 Null이 될 수 없다. (Not Null)\n##### 2) 변환 예\n[[img:IV-109]]\n#### 라. 배타적 관계 변환\n[[img:IV-110]]\n[[img:IV-111]]\n##### 1) 외래키 (Foreign Key) 분리 방법\n  - 각각의 관계를 관계 칼럼으로 생성하는 방법\n  - 장점 : 실제 외래키 제약조건 (Foreign Key Constraints)을 생성할 수 있다.\n  - 각각의 키 칼럼들이 Optional, 추가적으로 체크 제약 조건(Check Constraints) 생성\n    ∎추가적인 체크 제약 조건\n\n| CHECK ( **JUMIN_NO IS NOT NULL**¶AND  PART_NO IS NULL¶AND  BUSINESS_ID IS NULL)¶OR     ( JUMIN_NO IS NULL¶AND  **PART_NO IS NOT NULL**¶AND  BUSINESS_ID IS NULL)¶OR  ( JUMIN_NO IS NULL¶AND  PART_NO IS NULL¶AND  **BUSINESS_ID IS NOT NULL**) |\n\n##### 2) 외래키 결합 방법\n  - 각각의 관계를 하나의 관계 칼럼으로 생성하는 방법\n  - 단점 : {r}실제 외래키 제약조건을 생성할 수 없다.{/r}\n  - 각각의 관계를 선택적으로 구분할 수 있는 추가적인 칼럼이 필요하게 된다.\n  - ∎구분 칼럼 추가 (J : 개인, P : 단체, B : 법인)\n[[img:IV-112]]"
      },
      {
       "no": 5,
       "title": "관리상 필요한 칼럼 추가",
       "body": "#### 가. 개념\n- 논리 데이터 모델에는 존재하지 않지만 관리상의 이유로 혹은 데이터베이스를 이용하는 프로그래밍이 좀더 빠르게 수행되도록 하기 위해서 테이블이나 칼럼 추가\n- 예) 데이터 등록 일자, 시스템 번호\n#### 나. 시스템 칼럼 추가 예\n- 생성일시, 생성 프로세스 ID (논리 데이터 모델에서는 존재하지 않는 속성, 물리 데이터 모델에 추가)\n[[img:IV-113]]"
      },
      {
       "no": 6,
       "title": "데이터 타입 선택",
       "body": "#### 가. 개념\n#### 나. 문자 타입 (Character Data Types)\n##### 1) 세부 문자 타입 선택을 위한 기준\n- 가) 영문만 사용되는가?\n    - 유니코드 형식 : 2바이트(Byte) 체계\n    - 영문은 1바이트 (한글은 2바이트) → 유니코드 데이터 타입 : **N**CHAR, **N**VARCHAR 등 사용\n- 나) 4000자 혹은 8000자 이상의 문자열이 포함되는가? → LONG, TEXT 등 사용\n- 다) 입력되는 값의 길이가 일정한가? → CHAR, VARCHAR\n##### 2) 문자 형식 데이터 타입 설정 예 (MS SQL Server)\n[[img:IV-114]]\n#### 다. 숫자 타입 (Numeric Types)\n##### 1) 세부 숫자 타입 선택을 위한 기준\n- 가) 정말 숫자 데이터인지 판단한다.\n    - 주민등록번호 : 숫자처럼 보이지만 숫자가 아님. (수치 연산을 하지 않음.)\n- 나) 세부 숫자 타입 결정\n    - 불린(Boolean) : 참(TRUE) 혹은 거짓(False)을 저장하는 경우에 선택한다.\n    - 정수(Integer) : 소수점 이하를 처리하지 않는 경우에 선택한다.\n    - 소수(Decimal) : 소수점 이하를 처리하는 경우에 선택한다.\n    - 화폐(Money) : 금액을 저장하기 위한 경우에 선택한다.\n##### 2) 숫자 형식 데이터 타입 지정 예\n[[img:IV-115]]\n#### 라. 날짜 타입 (Datetime Types)\n##### 1) 세부 날짜 타입 선택을 위한 기준\n    - 날짜 타입 : 일자 + 시분초\n    - 일반적인 시간 저장이냐? / 정밀한 시간 저장이냐? 에 따라 날짜 타입 결정\n##### 2) 세부 날짜 타입 지정 예\n[[img:IV-116]]"
      },
      {
       "no": 7,
       "title": "데이터 표준 적용",
       "body": "#### 가. 개념\n- 표준 용어, 표준 도메인, 표준 명명 규칙 등\n#### 나. 데이터 표준 적용 대상\n##### 1) 데이터베이스(Database)\n##### 2) 스토리지 그룹(Storage Group)\n- DASD(Direct Access Storage Device)\n##### 3) 테이블스페이스(Tablespace)\n- 테이블이 생성되는 물리적인 영역(하나 또는 그 이상의 테이블 저장)\n##### 4) 테이블(Table)\n##### 5) 칼럼(Column)\n##### 6) 인덱스(Index)\n##### 7) 뷰(View )\n#### 다. 데이터 표준 적용 방법\n##### 1) {r}명명 규칙에 의한 표준화 적용{/r}\n  - 테이블명 : 엔터티 한글명과 동일한 용어 사용, 해당 용어를 영문명으로 전환\n  - 영문명 : 영문 약어 사용, 표준 용어 사전에 등록된 표준 영문 약어 참조\n  - 테이블의 명명 순서 : 업무 영역 + 주제어 수식어 + 주제어 + 분류어 수식어 + 분류어 + 접미사 순\n[[img:IV-117]]\n  - 테이블 영문명 : Under Bar(_) 사용 (예 - 업무관계자_사원_정보 IVPT_EMP_INFO)\n##### 2) {r}표준 용어집에 의한 표준화 적용{/r}"
      }
     ]
    },
    {
     "no": 4,
     "title": "반정규화",
     "intro": "- 반정규화 과정 : 정규화된 데이터 모델은 시스템의 성능 향상, 개발 과정의 편의성, 운영의 단순화를 위해 정규화의 원칙들에 위배되는 행위를 의도적으로 수행하게 된다.\n  - 테이블 관점에서의 반정규화\n  - 칼럼 관점에서의 반정규화\n  - 데이터의 일관성/무결성 우선이냐? ↔ 데이터베이스의 성능/단순화 우선이냐?",
     "items": [
      {
       "no": 1,
       "title": "테이블 분할",
       "body": "#### 가. 개념\n- 테이블 분할(파티셔닝) : 하나의 테이블을 수직 혹은 수평 분할하는 것\n#### 나. 수평 분할(Horizontal Partitioning)\n##### 1) 개념\n  - 레코드(Record)를 기준으로 테이블 분할\n[[img:IV-118]]\n##### 2) 사용 의의\n  - **하나의 테이블에 데이터가 너무 많고, 레코드 중에서 특정한 덩어리의 범위만을 주로 액세스하는 경우**\n  - 분할된 각 테이블은 서로 다른 디스크에 위치시켜 **물리적인 디스크의 효용성을 극대화**할 수 있다.\n  - DBMS 차원에서 제공 - 범위 분할, 해쉬 분할, 복합 분할 등\n#### 다. 수직 분할 (Vertical Partitioning)\n##### 1) 개념\n  - 하나의 테이블이 가지는 칼럼의 개수가 너무 많아서\n  - 이러한 수직 분할이 일어나는 이유 (사용 경우)\n    - **조회 위주의 칼럼과 갱신 위주의 칼럼으로 나뉘는 경우**\n    - **특별히 자주 조회되는 칼럼이 있는 경우**\n    - **특정 칼럼 크기가 아주 큰 경우**\n    - **특정 칼럼에 보안을 적용해야 하는 경우**\n[[img:IV-119]]\n##### 2) 갱신 위주의 칼럼 수직 분할\n- 가) 개념\n    - 데이터를 갱신하는 작업이 일어날 때 업데이트하려는 레코드(Record), 즉 레코드에 잠금(Locking)을 수행하기 때문이다.\n- 나) DBMS 버전별 적용 검토\n    - 잠금이 레코드 전체에 걸리기 때문에 업데이트가 완료될 때까지 해당 레코드를 사용할 수 없게 됨.\n    - 몇 개의 갱신 위주의 칼럼에 대한 작업이 나머지 조회 위주의 칼럼 이용을 방해\n      ⇒ 갱신 위주의 칼럼들을 수직 분할 → 데이터 사용 효율성 증가\n\n[그림 IV-3-32] 바커 표기법(좌)과 IE 표기법(우)에 따른 갱신 위주의 칼럼 수직 분할 예\n\n[[img:IV-120]]\n[[img:IV-121]]\n##### 3) 자주 조회되는 칼럼 분할\n- 가) 개념\n    - 테이블의 특정한 칼럼들이 자주 조회된다면 이러한 칼럼들을 분리해서 별도의 테이블로 관리하면 조회되는 쿼리의 작업 성능을 향상\n    - 실제 물리적인 I/O의 양을 줄여서 데이터 액세스 성능 향상\n- 나) 물리적인 DBMS 메커니즘 고려\n- 다) 회원 인증 테이블 사례\n\n[그림 IV-3-33] 바커 표기법(좌)과 IE 표기법(우)에 따른 자주 조회되는 칼럼 분할 예\n\n[[img:IV-122]]\n[[img:IV-123]]\n##### 4) 특정 칼럼의 크기가 아주 큰 경우 분할\n- 가) 개념\n    - 특정한 데이터 형식에 기인하는 경우가 대부분 (LOB(Large Objects) - 텍스트/이미지)\n- 나) 회원 사진 테이블 사례\n\n[그림 IV-3-34] 특정 칼럼이 아주 큰 경우 바커 표기법(좌)과 IE 표기법(우)에 따른 분할 예\n\n[[img:IV-124]]\n[[img:IV-125]]\n##### 5) 특정 칼럼에 보안을 적용해야 하는 경우의 분할\n- 가) 개념\n- 나) 회원 등급 테이블 사례\n\n[그림 IV-3-35] 특정 칼럼에 보안을 적용해야 하는 경우 바커 표기법(좌)과 IE 표기법(우)에 따른 분할 예\n\n[[img:IV-126]]\n[[img:IV-127]]"
      },
      {
       "no": 2,
       "title": "중복 테이블 생성",
       "body": "#### 가. 개념\n- Group By, Sum 등의 집계 함수 사용 경우 (많은 양의 데이터 대상, 여러 개의 테이블 데이터 추출)\n   → 통계 테이블, 중복 테이블 사용\n#### 나. 중복 테이블 생성 판단 근거\n- 정규화에 충실하면 종속성, 활용성은 향상되나 수행 속도 증가가 발생하는 경우 고려한다.\n- 많은 범위를 자주 처리해야 하는 경우에 고려한다.\n- 특정 범위의 데이터만 자주 처리되는 경우에 고려한다.\n- 처리 범위를 줄이지 않고는 수행 속도를 개선할 수 없는 경우에 고려한다.\n- 요약 자료만 주로 요구되는 경우에 고려한다.\n- 추가된 테이블의 처리를 위한 오버헤드를 고려하여 결정한다.\n- 인덱스의 조정이나 부분 범위 처리로 유도, 클러스터링을 이용하여 해결할 수 있는지를 철저히 검토한 후 결정\n#### 다. 중복 테이블 유형\n##### 1) 집계(통계) 테이블 추가\n- 가) 집계 테이블 유형\n    - 단일 테이블의 GROUP BY\n    - 여러 테이블의 조인 GROUP BY\n- 나) 집계 테이블 생성 시 유의 사항\n    - 로우 수와 활용도를 분석하고 시뮬레이션을 통해서 그 효용성에 대한 면밀한 검토가 선행되어야 한다.\n    - 집계 테이블에 단일 테이블 클러스터링을 한다면 집계 레벨을 좀더 낮춰 활용도를 높일 수 있는지 검토\n    - 클러스터링, 결합 인덱스, 고단위 SQL을 활용하면 굳이 집계 테이블 없이도 양호한 수행 속도를 낼 수 있다. 이러한 부분도 사전 검토되어야 한다.\n    - 집계 테이블을 다시 집계, 조인하면 추출할 수 있는지를 검토하여 지나친 집계 테이블을 만들지 않도록\n    - 추가된 집계 테이블을 기존 응용 프로그램이 이용할 수 있는지를 찾아 보정시키는 노력이 필요하다.\n    - 데이터베이스 트리거의 오버헤드에 주의하고 데이터의 일관성 보장 유의\n      (집계 테이블과 원본 데이터의 일관성 유지 중요)\n##### 2) 진행 테이블 추가\n- 가) 진행 테이블 추가 상황\n    - **여러 테이블의 조인이 빈번히 발생하며 처리 범위도 넓은 경우**\n    - **M:M** 관계가 포함된 처리의 과정을 추적, 관리하는 경우\n    - **검색 조건이 여러 테이블에 걸쳐 다양하게 사용되며 복잡하고 처리량이 많은 경우**\n- 나) 진행 테이블 생성 시 유의 사항\n    - 데이터량이 적절하고 활용도가 좋아지도록 기본키를 선정\n    - 필요에 따라 적절한 추출(Derived) 칼럼을 추가하여 집계 테이블의 역할도 하는 다목적 테이블을 구상\n    - **다중 테이블 클러스터링**이나 **조인 SQL**을 적절히 이용하면 굳이 진행 테이블을 만들지 않아도 양호한 수행 속도를 낼 수 있는 경우가 많다."
      },
      {
       "no": 3,
       "title": "중복 칼럼 생성",
       "body": "#### 가. 개념\n#### 나. 중복 칼럼 생성 상황\n- **빈번하게 조인**을 일으키는 칼럼에 대해서 고려해 볼 수 있다.\n- **속도가 중요한 칼럼(**조인의 범위가 다량인 경우를 온라인화해야 하는 경우**)**에 대해서는 중복 칼럼 고려\n- 액세스의 조건으로 자주 사용되는 칼럼에 대해서 고려해 볼 수 있다.\n- 자주 사용되는 액세스 조건이 다른 테이블에 분산되어 있어 상세한 조건 부여에도 불구하고 액세스 범위를 줄이지 못하는 경우에 자주 사용되는 조건들을 하나의 테이블로 모아서 조건의 변별성을 극대화할 수 있다.\n- **복사된 칼럼의 도메인은 원본 칼럼과 동일하게** 해야 한다. 이것은 (데이터의 일관성을 위한 필수 사항)\n- 접근 경로의 단축을 위해서 부모 테이블의 칼럼을 자식 테이블에 중복시킬 수 있다.\n- 상위 레벨의 테이블에 집계된 칼럼을 추가(M:1 관계)할 수 있다. 즉, **집계 칼럼**을 추가한다.\n- 하위 레벨의 테이블로 중복 칼럼을 복사(M:1 관계)할 수 있다.\n- 연산된 결과를 주로 사용하는 경우에도 미리 연산을 하여 중복 칼럼을 생성할 수 있다.\n- 여러 칼럼의 조합 또는 복잡한 연산의 결과를 통해서 판단할 수 밖에 없는 값이 검색의 조건으로 사용되는 경우에는 연산의 결과를 중복 칼럼으로 생성할 수 있다.\n- 여러 개의 로우로 구성되는 값을 하나의 로우에 나열하는 경우(로우로 관리하던 데이터를 칼럼으로 관리하는 경우)\n- 기본키의 칼럼이 길거나 여러 개의 칼럼으로 구성되어 있는 경우 인위적인 기본키를 추가할 수 있다.\n#### 다. 중복 칼럼 생성 시 유의 사항\n- **다중 테이블 클러스터링**으로 해결할 수 있는지 검토한다.\n- SQL **GROUP 함수** 이용하여 처리할 수 있는지 검토한다.\n- 저장 공간의 지나친 낭비를 고려하여 적절한 대비책을 마련해야 한다.\n- 반복 칼럼은 특별한 경우를 제외하고는 절대 사용할 필요가 없고, 있다면 sum(decode.. ) 용법과 같은 SQL 기법 등을 활용하여 이러한 부분을 피할 수 있도록 한다.\n- 경우에 따라 상대 테이블의 ROWID를 복사하는 경우가 효과적일 때도 있다.\n- **데이터의 일관성 보장에 유의**해야 한다. 성능을 향상시키기 위해서 데이터의 일관성을 저해해서는 안 됨.\n- **칼럼의 중복이 지나치게 심하면 데이터 처리의 오버헤드가 발생**하게 된다.\n- 사용자나 프로그램은 반드시 원본 칼럼만 수정하는 것이 바람직하다.\n- 가능하면 중복 칼럼을 적게 가져가는 것이 바람 \n  (일반적으로 수행 속도를 우려해서 지나치게 많은 중복 칼럼을 생성하고 있음.)\n- 클러스터링, 결합 인덱스, 적절한 SQL을 이용하면 특별한 경우를 제외하고는 거의 해결 가능하기 때문에 이 부분을 먼저 적극적으로 고려해 보는 것이 바람직하다.\n- 중복 칼럼을 이용하면 손쉽게 액세스 효율을 개선할 수 있으나 **지나친 중복화**는 반드시 **데이터 일관성 오류 발생의 개연성 증가 및 데이터 처리 오버헤드 증가**라는 반대급부가 있다는 것을 염두에 두고 수행해야 한다.\n- JOIN, SUB-QUERY 액세스 경로의 최적화 방안을 보다 철저히 강구해야 한다."
      }
     ]
    },
    {
     "no": 5,
     "title": "물리 데이터 모델 품질 검토",
     "intro": "",
     "items": [
      {
       "no": 1,
       "title": "물리 데이터 모델 품질 검토 개요",
       "body": "- 물리 데이터 모델 품질 검토의 목적 : ‘성능’과 ‘오류 예방’의 관점\n\n‖ **기준 항목** | **설명** | **검토 관점 사례** |\n| **정확성** | 데이터 모델이 표기법에 따라 정확하게 표현되었고, 업무 영역 또는 요구사항이 정확하게 반영되었음을 의미함 | 사용된 표기법에 따라 물리 데이터 모델이 정확하게 표현 되었는가?¶대상 업무영역의 업무 개념과 내용이 정확하게 표현 되었는가?¶요구사항의 내용이 정확하게 반영 되었는가?¶업무규칙이 정확하게 표현/적용 되었는가? |\n| **완전성** | 데이터 모델의 구성 요소를 정의하는데 있어서 누락을 최소화하고, 요구사항 및 업무 영역 반영에 있어서 누락이 없음을 의미 | 물리 데이터 모델 작성 항목의 충실성(완성도)¶필요한 설명 항목(테이블/칼럼 설명 등)들의 작성 상태¶물리 모델링 단계에서 결정해야할 항목들의 작성 상태(칼럼의 데이터 타입 및 길이, Null 허용 여부, 서브타입 변환, 배타관계 변환, PK, FK, 데이터 무결성 관련 제약사항 등등. 필요에 따라서는 저장공간 지정, 테이블/인덱스 생성 관련 파라미터 결정 사항 등까지도 포함)¶요구사항 반영 및 업무 영역 반영의 완전성 : 목적하는 업무 영역을 기술(설계)한 논리 데이터 모델의 구성요소 (엔터티, 속성, 관계, 식별자 등)들이 누락없이 물리 데이터 모델로 변환되어 정의된 정도 (단, 특별한 목적에 의해 일부만 물리 데이터 모델로 변환될 수 있으며, 이 경우 목적이 명확해야함) |\n| {r}**준거성**{/r} | {r}제반 준수 요건들이 누락 없이 정확하게 준수되었음을 의미{/r} | {r}데이터 표준, 표준화 규칙 등을 준수하였는가?{/r}¶법적 요건을 준수하였는가?¶법적 요건을 준수하기에 충분하도록 도메인이 정의되었는가? |\n| **최신성** | 데이터 모델이 현행 시스템의 최신 상태를 반영하고 있고, 이슈사항들이 지체없이 반영되고 있음을 의미 | 업무상의 변경이나 결정사항 등이 시의 적절하게 반영되고 있는가¶최근의 이슈사항이 반영 되었는가¶현행 데이터 모델은 현행 시스템과 일치 하는가 |\n| **일관성** | 여러 영역에서 공통 사용되는 데이터 요소가 전사 수준에서 한 번만 정의되고 이를 여러 다른 영역에서 참조·활용되면서, 모델 표현상의 일관성을 유지하고 있음을 의미 | 여러 주제영역에서 공통적으로 사용되는 엔터티는 일관성 있게 변환되었는가 (전사 수준에서 한 번만 정의되고 이를 여러 다른 영역에서 참조·활용한다는 의미에서 통합성이라 하기도 함)¶모델 표현상의 일관성을 유지하고 있는가¶동일·유사 목적·용도의 칼럼들은 일관성 있게 정의되었는가¶조인 대상 칼럼들은 일관성 있게 정의 되었는가 |\n| **활용성** | 작성된 모델과 그 설명 내용이 이해관계자에게 의미를 충분하게 전달할 수 있으면서, 업무 변화 시에 설계 변경이 최소화되도록 유연하게 설계되어 있음을 의미 | 작성된 설명 내용이나 모델 표기 등이 사용자나 모델을 보는 사람에게 충분히 이해가 될 수 있고, 모델의 작성 의도를 명확하게 이해할 수 있는가 (의사소통의 충분성)¶PK, UK 등의 칼럼 구성은 데이터 무결성을 보장하면서 데이터 액세스를 효율화하기에 충분한가?¶논리 데이터 모델의 유연성이 물리 데이터 모델에도 반영되었는가 (오류가 적고 업무 변화에 유연하게 대응하여 데이터 구조의 변경이 최소화 할 수 있는 설계 결과)¶코드화 대상 칼럼에 대한 코드 정의는 업무 지원 및 적용에 충분한가? |"
      },
      {
       "no": 2,
       "title": "물리 데이터 모델 품질 검토 체크리스트의 활용",
       "body": "‖ **검토 대상** | **검토항목** | **검토 내용** |\n| **테이블** | 테이블명 | 명명규칙을 준수하였는가?¶제안요건에 따라 약어를 사용한 경우 약어사용 규칙을 준수하였는가?¶의미 전달이 명확한 명칭을 사용하였는가?¶테이블 한글명은 엔터티 명칭과 일치하는가? |\n| ^^ | 테이블명 설명 | 데이터 집합의 개요나 성격, 관리 목적 등을 설명하였는가?¶데이터 집합 구성상의 특징이 설명되어 있는가?¶데이터 집합의 {r}생명주기나 오너십{/r} 등을 비롯한 기타 특이사항에 대한 내용을 포함하고 있는가?¶설명된 내용은 모든 이해관계자가 이해하고 의사소통 하는 데에 어려움이 없도록 쉽고 상세하게 기술되었는가? |\n| ^^ | {r}테이블 정의{/r} | 특별한 이유가 존재하지 않는 한 논리 데이터 모델의 엔터티가 누락 없이 물리 데이터 모델로 변환되었는가?¶{r}테이블 형태는 성능을 고려하여 결정되었는가?{/r} (일반 힙 테이블, IOT, 클러스터, 클러스터드 테이블, 파티션 등)¶{r}서브타입의 변환 형태는 명확한 판단 기준에 의해 결정되었는가?{/r}¶테이블 생성 관련 파라미터들은 적절하고 충분하게 정의되었는가?¶향후의 업무 변화 가능성에 대비하여 모델 변경을 최소화할 수 있도록 {r}유연성, 확장성{/r}이 고려되었는가? |\n| ^^ | 통합 수준 | 다른 영역에서 동일 목적으로 사용되는 테이블은 동일 명칭과 구조로 일관되게 사용되었는가? |\n| ^^ | {r}권한{/r} | {r}메타데이터 권한{/r}을 정의 하였는가? (테이블 생성/변경/삭제)¶데이터 {r}오너쉽{/r}을 정의 하였는가? (데이터 생성/변경/삭제)¶테이블에 대한 {r}접근 권한{/r}을 정의하였는가?¶테이블에 대한 접근 권한은 적절하게 정의되었는가? |\n| ^^ | 발생 건수/빈도 | 현재의 데이터 저장 건수/빈도는 파악하였는가?¶향후 예상되는 데이터 저장 건수/빈도의 변화 가능성은 파악하였는가? |\n| ^^ | 법규 준수 | 관련 법규에서 요구하는 데이터를 보관하기 위한 테이블을 정의하였는가?¶조직 특성에 비추어 보호가 요구되는 테이블을 식별하였는가? |\n| ^^ | 요구 사항¶추적 가능성 | 정의된 테이블은 요구사항과 매핑이 되었는가? |\n| **칼럼** | 칼럼명 | 칼럼명은 명명규칙을 준수하였는가?¶제한요건에 따라 약어를 사용한 경우 약어사용 규칙을 준수하였는가?¶의미 전달이 명확한 명칭을 사용하였는가?¶{r}칼럼의 한글명은 속성명과 일치하는가?{/r} |\n| ^^ | 칼럼 정의 | 시스템 내부적으로만 사용되는 칼럼(입력자, 입력일시, 변경자, 변경일시, 내부적으로만 사용되는 identity 칼럼 등) 외에 논리 모델 상에 정의된 속성과의 얼라인먼트가 유지되고 있는가?¶논리 모델의 인조식별자와 같이 일련번호를 저장하는 칼럼의 일련번호 생성 규칙과 방법이 정의되었는가? (Identity 칼럼, Sequence 객체 등) |\n| ^^ | 칼럼 설명 | 논리 모델에 정의된 속성의 개요나 성격, 관리 목적, 저장 데이터의 형태적 또는 구성상의 특징 등이 물리 모델에 적합한 설명으로 작성되었는가?¶데이터 집합으로서 속성의 생명주기나 오너쉽 등을 비롯한 기타 특이사항에 대한 내용을 포함하고 있는가?¶설명된 내용은 모든 이해관계자가 이해하고 의사소통 하는 데에 어려움이 없도록 쉽고 상세하게 기술되었는가? |\n| ^^ | Primary Key | PK 칼럼의 구성은 데이터의 유일성을 보장하기에 충분한가?¶FK 칼럼에 대한 참조무결성 규칙은 정의되었는가? |\n| ^^ | Unique Key | PK 외에 본질식별자에 해당하는 모든 칼럼에 UK가 정의되었는가?¶대체식별자로 정의된 칼럼에 대해 UK가 정의되었는가? |\n| ^^ | 법규 준수 | 법규상 암호화 대상인 칼럼의 데이터타입과 길이는 암호화를 고려하여 정의되었는가? |\n| ^^ | 도메인 정의 | 표준 도메인을 정의하여 적용하였는가?¶칼럼의 도메인(데이터 타입, 길이, Not Null 제약, Default 제약, Check 제약 등)은 일관성 있게 정의되었는가? |\n| ^^ | 추출 칼럼의 정의 | 추출 칼럼에 대한 추출 방법 또는 산식이 명확하게 정의되었는가?¶추출 칼럼에 대한 추출 방법 또는 산식을 적용한 방법은 적절한가? (어플리케이션 로직, 트리거, 기타 등) |\n| ^^ | 요구 사항¶추적 가능성 | 칼럼 수준에서 필요한 요구사항 매핑은 수행되었는가? |\n| ^^ | 오너십 정의 | 칼럼 수준에서 데이터 오너쉽 정의가 필요한 경우 데이터 오너쉽이 정의되었는가? |\n| **FK** | 참조무결성¶규칙 정의 | 논리모델 상의 관계들은 특별한 이유가 없는 한 누락 없이 참조무결성 규칙이 정의되었는가?¶정의된 참조무결성 규칙은 업무 영역의 내용이나 요구사항과 일치하는가?¶배타적 관계의 FK 칼럼에 대한 참조무결성 규칙을 적용하기 위한 방법은 적절한가? (DBMS의 FK 제약조건, 어플리케이션 로직, DB 트리거 등) |\n| ^^ | 요구 사항¶추적 가능성 | 참조무결성 규칙에 대해 필요한 요구사항 매핑은 수행되었는가? |\n| ^^ | {r}FK 일관성{/r} | FK 칼럼은 참조하는 PK 칼럼과 {r}도메인 정의가 일치{/r}하는가? |\n| **모델 전반** | 반정규화 | 반정규화 방법과 형태, 적용 범위는 적절한가?¶반정규화된 테이블이나 칼럼은 명확한 목적에 근거하고 있는가? |\n| ^^ | 인덱스 정의 주1) | PK 인덱스 외에 추가적인 인덱스가 고려되었는가?¶PK 인덱스를 포함하여 인덱스의 구성 칼럼들은 적절하게 선정되었는가? (액세스 경로 분석 수행 여부)¶인덱스 생성에 관련된 파라미터들은 충분하고 적절하게 정의되었는가? |\n| ^^ | 스토리지 정의 주2) | 스토리지 구성은 I/O 분산과 액세스 성능을 고려하여 정의했는가?¶스토리지 정의 파라미터들은 적절하게 정의되었는가?¶테이블과 인덱스는 적절한 테이블스페이스에 할당되었는가? |\n\n※ 주1)과 주2)는 방법론이나 모델링 도구에 따라 데이터베이스 설계의 검토 항목으로 보기도 함."
      }
     ]
    }
   ]
  }
 ]
});
